[
  {
    "id": 1,
    "slug": "hyderabadi-chicken-masala",
    "title_en": "Hyderabadi Chicken Masala",
    "title_bn": "হায়দ্রাবাদি চিকেন মাসালা",
    "image": "https://i.ytimg.com/vi/QamJu5u___Y/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=QamJu5u___Y",
    "youtube_id": "QamJu5u___Y",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Medium",
    "prep_time": 25,
    "cook_time": 45,
    "servings": 6,
    "createdAt": "2026-01-06T01:34:14.626Z",
    "updatedAt": "2026-01-06T01:34:14.626Z",
    "blogContent": {
      "id": 1,
      "recipe_id": 1,
      "intro_en": "Hyderabadi Chicken Masala is a regal and spicy dish that captures the authentic flavors of Nizami cuisine. This recipe features succulent chicken pieces simmered in a thick, aromatic gravy enriched with cashews and freshly ground spices.",
      "intro_bn": "হায়দ্রাবাদি চিকেন মাসালা একটি রাজকীয় এবং সুস্বাদু পদ যা নিজামি খাবারের আসল স্বাদ বহন করে। এই রেসিপিতে নরম চিকেনের টুকরোগুলো কাজু এবং তাজা বাটা মশলার ঘন সুগন্ধি গ্রেভিতে রান্না করা হয়।",
      "what_makes_it_special_en": "The secret lies in the 'Special Masala' made by dry roasting whole spices and grinding them with raw onions. Unlike standard curries, this version relies on slow-cooking the chicken in its own natural juices and yogurt, intensifying the deep savory flavors.",
      "what_makes_it_special_bn": "এই রেসিপির বিশেষত্ব হলো গোটা মশলা ভেজে তার সাথে কাঁচা পেঁয়াজ বেটে তৈরি করা 'স্পেশাল মাসালা'। সাধারণ কারির মতো না হয়ে, এই রান্নাটি চিকেন এবং দই থেকে বের হওয়া জলেই ধীর আঁচে সম্পন্ন হয়, যা স্বাদকে বহুগুণ বাড়িয়ে দেয়।",
      "cooking_tips_en": "Always whisk your yogurt well and introduce the chicken on low heat to prevent curdling. Constant stirring is essential after adding the cashew paste to avoid it sticking to the bottom of the pot.",
      "cooking_tips_bn": "দই যাতে ফেটে না যায় তার জন্য ভালো করে ফেটিয়ে নিন এবং কম আঁচে চিকেন যোগ করুন। কাজু বাটা দেওয়ার পর কড়াইতে যাতে লেগে না যায় তাই অনবরত নাড়তে হবে।",
      "serving_en": "Pair this rich gravy with aromatic Basmati rice, Saffron Polao, or hot Butter Naan for a complete royal dining experience.",
      "serving_bn": "রাজকীয় খাবারের অভিজ্ঞতার জন্য এই রিচ গ্রেভি সুগন্ধি বাসমতি চাল, জাফরান পোলাও অথবা গরম বাটার নানের সাথে পরিবেশন করুন।",
      "storage_en": "Store in an airtight container in the refrigerator for up to 3 days. Reheat on low flame, adding a splash of warm water if the gravy has thickened significantly.",
      "storage_bn": "এয়ারটাইট কন্টেইনারে ৩ দিন পর্যন্ত ফ্রিজে সংরক্ষণ করতে পারেন। পরে খাওয়ার সময় সামান্য গরম জল দিয়ে কম আঁচে গরম করে নিন।",
      "full_blog_en": "Hyderabadi cuisine is a beautiful blend of Mughlai and local flavors, and this Chicken Masala is a perfect example of that legacy. The journey starts with a vibrant marination, where the acidity of the yogurt begins to tenderize the meat while the Kashmiri chili provides a gorgeous hue. The real character of the dish comes from the spice paste—the nuttiness of roasted cashews balanced by the heat of whole peppercorns and dried chilies.\n\nCooking this masterpiece requires patience. By frying the onions to a perfect golden brown and then slow-cooking the chicken without external water, you achieve a level of flavor that water-based curries simply cannot match. The addition of ghee at the end provides that signature aroma that fills the entire house. It’s a dish designed for slow weekends and family gatherings.\n\nMastering the art of heat management is key here. Chef Atanu emphasizes keeping the flame low during critical additions like the yogurt and the spice paste. This ensures a silky-smooth texture in the gravy, free from the grainy bits of curdled dairy. The thick, oil-separated masala is the hallmark of a perfectly prepared curry.\n\nWhether you serve it with a fragrant polao or a crispy paratha, the Hyderabadi Chicken Masala is bound to be the star of your dinner table. The tender meat falling off the bone and the complex layers of spice make every bite a memorable experience. Follow this authentic guide to bring a piece of Hyderabad to your kitchen tonight.",
      "full_blog_bn": "হায়দ্রাবাদি রান্না হলো মুঘলাই এবং স্থানীয় স্বাদের এক অপূর্ব মেলবন্ধন, আর এই চিকেন মাসালা সেই ঐতিহ্যের একটি চমৎকার উদাহরণ। রান্নার শুরুতেই টক দই এবং মশলার ম্যারিনেশন মাংসকে নরম করে তোলে, আর কাশ্মীরি লঙ্কা গ্রেভিতে নিয়ে আসে এক আকর্ষণীয় রঙ। এই পদের আসল বৈশিষ্ট্য আসে মশলার পেস্ট থেকে—যেখানে ভাজা কাজুর স্বাদ গোলমরিচ এবং শুকনো লঙ্কার ঝালের সাথে ভারসাম্য বজায় রাখে।\n\nএই মাসালাটি তৈরি করতে কিছুটা ধৈর্যের প্রয়োজন। পেঁয়াজগুলোকে সোনালী করে ভেজে বেরেস্তা তৈরি করা এবং পরে কোনো বাড়তি জল ছাড়া চিকেনের নিজস্ব জলেই রান্না করার মাধ্যমে এক অসাধারণ স্বাদ পাওয়া যায়। শেষে ঘি-এর ব্যবহার একটি সিগনেচার সুগন্ধ নিয়ে আসে যা আপনার পুরো ঘরকে মৌ মৌ করবে। এটি ছুটির দিনের আড্ডা বা পারিবারিক অনুষ্ঠানের জন্য সেরা একটি পদ।\n\nরান্নার আঁচ নিয়ন্ত্রণে রাখাই এখানে সফলতার চাবিকাঠি। শেফ অতনু দেখিয়েছেন কীভাবে দই বা মশলার পেস্ট দেওয়ার সময় আঁচ কমিয়ে রাখতে হয়। এতে গ্রেভি হয় রেশমের মতো মসৃণ। মশলা থেকে তেল আলাদা হয়ে আসা একটি নিখুঁত কারির পরিচয়।\n\nআপনি এটি সুগন্ধি পোলাও বা মচমচে পরোটার সাথে পরিবেশন করুন না কেন, এই হায়দ্রাবাদি চিকেন মাসালা আপনার ডিনার টেবিলের মূল আকর্ষণ হবেই। হাড় থেকে মাংস খুলে আসার মতো নরম টেক্সচার এবং মশলার প্রতিটি স্তর প্রতি কামড়কে করে তোলে স্মরণীয়। আজই আপনার রান্নাঘরে হায়দ্রাবাদের এই স্বাদ নিয়ে আসতে এই আসল পদ্ধতিটি অনুসরণ করুন।"
    },
    "ingredients": [
      {
        "id": 1,
        "recipe_id": 1,
        "ingredient_id": 1,
        "quantity": "2",
        "unit_en": "kg",
        "unit_bn": "কেজি",
        "notes_en": "medium sized pieces",
        "notes_bn": "মাঝারি টুকরো করা",
        "ingredient": {
          "id": 1,
          "name_en": "Chicken",
          "name_bn": "চিকেন",
          "img": "https://www.themealdb.com/images/ingredients/Chicken.png",
          "phonetic": [
            "murgi",
            "murgee",
            "murghi",
            "chicken"
          ],
          "createdAt": "2026-01-06T01:34:15.775Z",
          "updatedAt": "2026-01-06T01:34:15.775Z"
        }
      },
      {
        "id": 2,
        "recipe_id": 1,
        "ingredient_id": 2,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "freshly made",
        "notes_bn": "তাজা বাটা",
        "ingredient": {
          "id": 2,
          "name_en": "Beef",
          "name_bn": "গরুর মাংস",
          "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Raw_beef_steak.jpg/640px-Raw_beef_steak.jpg",
          "phonetic": [
            "gorur mangsho",
            "gorur mangso",
            "mangsho",
            "beef"
          ],
          "createdAt": "2026-01-06T01:34:16.068Z",
          "updatedAt": "2026-01-06T01:34:16.068Z"
        }
      },
      {
        "id": 3,
        "recipe_id": 1,
        "ingredient_id": 3,
        "quantity": "4",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "slit",
        "notes_bn": "চেরা",
        "ingredient": {
          "id": 3,
          "name_en": "Egg",
          "name_bn": "ডিম",
          "img": "https://www.themealdb.com/images/ingredients/Egg.png",
          "phonetic": [
            "dim",
            "deem",
            "anda"
          ],
          "createdAt": "2026-01-06T01:34:16.250Z",
          "updatedAt": "2026-01-06T01:34:16.250Z"
        }
      },
      {
        "id": 4,
        "recipe_id": 1,
        "ingredient_id": 4,
        "quantity": "1/2",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 4,
          "name_en": "Onion",
          "name_bn": "পেঁয়াজ",
          "img": "https://www.themealdb.com/images/ingredients/Onion.png",
          "phonetic": [
            "piaz",
            "piyaz",
            "peaj",
            "peyaj"
          ],
          "createdAt": "2026-01-06T01:34:16.425Z",
          "updatedAt": "2026-01-06T01:34:16.425Z"
        }
      },
      {
        "id": 5,
        "recipe_id": 1,
        "ingredient_id": 5,
        "quantity": "1/2",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "ground",
        "notes_bn": "গুঁড়ো",
        "ingredient": {
          "id": 5,
          "name_en": "Garlic",
          "name_bn": "রসুন",
          "img": "https://www.themealdb.com/images/ingredients/Garlic.png",
          "phonetic": [
            "rosun",
            "roshun",
            "rasun"
          ],
          "createdAt": "2026-01-06T01:34:16.608Z",
          "updatedAt": "2026-01-06T01:34:16.608Z"
        }
      },
      {
        "id": 6,
        "recipe_id": 1,
        "ingredient_id": 6,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for color",
        "notes_bn": "রঙের জন্য",
        "ingredient": {
          "id": 6,
          "name_en": "Ginger",
          "name_bn": "আদা",
          "img": "https://www.themealdb.com/images/ingredients/Ginger.png",
          "phonetic": [
            "ada",
            "aadaa",
            "adha"
          ],
          "createdAt": "2026-01-06T01:34:16.780Z",
          "updatedAt": "2026-01-06T01:34:16.780Z"
        }
      },
      {
        "id": 7,
        "recipe_id": 1,
        "ingredient_id": 7,
        "quantity": "150",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "fresh and thick",
        "notes_bn": "তাজা ও ঘন",
        "ingredient": {
          "id": 7,
          "name_en": "Green Chili",
          "name_bn": "কাঁচা মরিচ",
          "img": "https://www.themealdb.com/images/ingredients/Green%20Chili.png",
          "phonetic": [
            "kacha morich",
            "kachka morich",
            "morich"
          ],
          "createdAt": "2026-01-06T01:34:16.949Z",
          "updatedAt": "2026-01-06T01:34:16.949Z"
        }
      },
      {
        "id": 8,
        "recipe_id": 1,
        "ingredient_id": 8,
        "quantity": "200",
        "unit_en": "ml",
        "unit_bn": "মিলি",
        "notes_en": "plus 3-4 tsp for marinade",
        "notes_bn": "সাথে ৩-৪ চামচ ম্যারিনেশনের জন্য",
        "ingredient": {
          "id": 8,
          "name_en": "Tomato",
          "name_bn": "টমেটো",
          "img": "https://www.themealdb.com/images/ingredients/Tomato.png",
          "phonetic": [
            "tomato",
            "tamato",
            "tometo"
          ],
          "createdAt": "2026-01-06T01:34:17.123Z",
          "updatedAt": "2026-01-06T01:34:17.123Z"
        }
      },
      {
        "id": 9,
        "recipe_id": 1,
        "ingredient_id": 9,
        "quantity": "12",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "whole for paste",
        "notes_bn": "বাটার জন্য আস্ত",
        "ingredient": {
          "id": 9,
          "name_en": "Potato",
          "name_bn": "আলু",
          "img": "https://www.themealdb.com/images/ingredients/Potato.png",
          "phonetic": [
            "alu",
            "aloo",
            "aalu"
          ],
          "createdAt": "2026-01-06T01:34:17.296Z",
          "updatedAt": "2026-01-06T01:34:17.296Z"
        }
      },
      {
        "id": 10,
        "recipe_id": 1,
        "ingredient_id": 10,
        "quantity": "400",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "300g sliced for frying, 100g for raw paste",
        "notes_bn": "৩০০ গ্রাম ভাজার জন্য স্লাইস করা, ১০০ গ্রাম কাঁচা বাটার জন্য",
        "ingredient": {
          "id": 10,
          "name_en": "Rice",
          "name_bn": "চাল",
          "img": "https://www.themealdb.com/images/ingredients/Rice.png",
          "phonetic": [
            "chal",
            "chaal",
            "bhat"
          ],
          "createdAt": "2026-01-06T01:34:17.472Z",
          "updatedAt": "2026-01-06T01:34:17.472Z"
        }
      },
      {
        "id": 11,
        "recipe_id": 1,
        "ingredient_id": 11,
        "quantity": "1",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "clarified butter",
        "notes_bn": "খাঁটি ঘি",
        "ingredient": {
          "id": 11,
          "name_en": "Flour",
          "name_bn": "ময়দা",
          "img": "https://www.themealdb.com/images/ingredients/Flour.png",
          "phonetic": [
            "atta",
            "moida",
            "maida"
          ],
          "createdAt": "2026-01-06T01:34:17.646Z",
          "updatedAt": "2026-01-06T01:34:17.646Z"
        }
      },
      {
        "id": 12,
        "recipe_id": 1,
        "ingredient_id": 12,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "to taste",
        "notes_bn": "স্বাদমতো",
        "ingredient": {
          "id": 12,
          "name_en": "Milk",
          "name_bn": "দুধ",
          "img": "https://www.themealdb.com/images/ingredients/Milk.png",
          "phonetic": [
            "dud",
            "dudh",
            "doodh"
          ],
          "createdAt": "2026-01-06T01:34:17.817Z",
          "updatedAt": "2026-01-06T01:34:17.817Z"
        }
      }
    ],
    "steps": [
      {
        "id": 1,
        "recipe_id": 1,
        "step_number": 1,
        "instruction_en": "Marinate 2 kg chicken with 2 tsp ginger-garlic paste, slit green chilies, coriander leaves, salt, turmeric powder, Kashmiri red chili powder, 150g yogurt, and 3-4 tsp oil. Mix well and rest for 7 minutes.",
        "instruction_bn": "২ কেজি চিকেন ২ চা চামচ আদা-রসুন বাটা, চেরা কাঁচা লঙ্কা, ধনেপাতা, নুন, হলুদ গুঁড়ো, কাশ্মীরি লঙ্কার গুঁড়ো, ১৫০ গ্রাম টক দই এবং ৩-৪ চা চামচ তেল দিয়ে ভালো করে মাখিয়ে ৭ মিনিট রেখে দিন।",
        "timestamp": "0:56"
      },
      {
        "id": 2,
        "recipe_id": 1,
        "step_number": 2,
        "instruction_en": "Dry roast cashews, 8 dry red chilies, 2 tsp coriander seeds, 1 tsp cumin, cinnamon, black peppercorns, and mace in a pan for 2-3 minutes until fragrant.",
        "instruction_bn": "১২টি কাজু, ৮টি শুকনো লঙ্কা, ২ চা চামচ গোটা ধনে, ১ চা চামচ জিরে, দারুচিনি, গোল মরিচ এবং জৈত্রি প্যানে ২-৩ মিনিট সুগন্ধ বের হওয়া পর্যন্ত ভেজে নিন।",
        "timestamp": "1:51"
      },
      {
        "id": 3,
        "recipe_id": 1,
        "step_number": 3,
        "instruction_en": "Grind the roasted spices with 100g raw diced onions and a little water into a smooth, fine paste.",
        "instruction_bn": "ভাজা মশলাগুলো ১০০ গ্রাম কাঁচা পেঁয়াজ কুচি এবং সামান্য জল দিয়ে একটি মসৃণ পেস্ট তৈরি করে নিন।",
        "timestamp": "2:35"
      },
      {
        "id": 4,
        "recipe_id": 1,
        "step_number": 4,
        "instruction_en": "Heat 200ml oil and 1 tbsp ghee in a pot. Add 300g sliced onions and fry on high heat until they turn golden brown (birista).",
        "instruction_bn": "পাত্রে ২০০ মিলি তেল এবং ১ টেবিল চামচ ঘি গরম করুন। এরপর ৩০০ গ্রাম স্লাইস করা পেঁয়াজ দিয়ে সোনালী করে ভাজুন (বেরেস্তা)।",
        "timestamp": "2:55"
      },
      {
        "id": 5,
        "recipe_id": 1,
        "step_number": 5,
        "instruction_en": "Add the prepared spice-onion paste to the fried onions and cook on low heat for 3-4 minutes until the raw smell of onion disappears.",
        "instruction_bn": "ভাজা পেঁয়াজের মধ্যে তৈরি করা মশলা-পেঁয়াজ পেস্টটি দিন এবং পেঁয়াজের কাঁচা গন্ধ দূর করতে ৩-৪ মিনিট কম আঁচে কষান।",
        "timestamp": "3:55"
      },
      {
        "id": 6,
        "recipe_id": 1,
        "step_number": 6,
        "instruction_en": "Add the marinated chicken to the pot. Mix well on low heat for 5 minutes to prevent the yogurt from curdling, then cover and cook.",
        "instruction_bn": "ম্যারিনেট করা চিকেন যোগ করুন। দই যাতে ফেটে না যায় তার জন্য কম আঁচে ৫ মিনিট ভালো করে মিশিয়ে নিয়ে ঢাকা দিন।",
        "timestamp": "4:28"
      },
      {
        "id": 7,
        "recipe_id": 1,
        "step_number": 7,
        "instruction_en": "Cover and cook for another 15-20 minutes without adding any external water. Let the chicken cook in its own juices and the yogurt.",
        "instruction_bn": "বাড়তি কোনো জল না দিয়ে ঢাকা দিয়ে আরও ১৫-২০ মিনিট রান্না হতে দিন। চিকেনের নিজস্ব জল এবং দইয়েই মাংস সেদ্ধ হবে।",
        "timestamp": "5:38"
      },
      {
        "id": 8,
        "recipe_id": 1,
        "step_number": 8,
        "instruction_en": "Finish with fresh coriander leaves and a touch of garam masala. Serve hot with polao, paratha, or roti.",
        "instruction_bn": "তাজা ধনেপাতা এবং সামান্য গরম মশলা ছড়িয়ে রান্না শেষ করুন। পোলাও, পরোটা বা রুটির সাথে গরম গরম পরিবেশন করুন।",
        "timestamp": "6:32"
      }
    ]
  },
  {
    "id": 2,
    "slug": "dim-aloo-fulkopir-dalna",
    "title_en": "Egg Curry with Potato and Cauliflower (Dim Aloo Fulkopir Dalna)",
    "title_bn": "ডিম, আলু ও ফুলকপির ডালনা",
    "image": "https://i.ytimg.com/vi/4Y1WBbw1m6g/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=4Y1WBbw1m6g",
    "youtube_id": "4Y1WBbw1m6g",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Medium",
    "prep_time": 20,
    "cook_time": 40,
    "servings": 8,
    "createdAt": "2026-01-06T01:34:18.085Z",
    "updatedAt": "2026-01-06T01:34:18.085Z",
    "blogContent": {
      "id": 2,
      "recipe_id": 2,
      "intro_en": "This Egg Curry with Potato and Cauliflower is a comforting Bengali classic that brings together the richness of eggs with the earthy flavors of winter vegetables. It's a versatile dish that often surpasses fish or meat curries in popularity at a typical Bengali dinner table.",
      "intro_bn": "ডিম, আলু ও ফুলকপির এই তরকারিটি একটি অত্যন্ত সুস্বাদু ঘরোয়া রান্না। শীতের সবজির সাথে ডিমের এই মেলবন্ধন মাছ বা মাংসের স্বাদকেও হার মানাতে পারে।",
      "what_makes_it_special_en": "The secret lies in the fresh-ground spice paste and frying each main component—eggs, potatoes, and cauliflower—separately before combining them. This builds layers of deep, caramelized flavors that define the dish.",
      "what_makes_it_special_bn": "এই রেসিপির বিশেষত্ব হলো আস্ত মশলা ভিজিয়ে রেখে বাটা এবং প্রতিটি উপকরণ (ডিম, আলু, ফুলকপি) আলাদাভাবে ভেজে নেওয়া। এতে তরকারির স্বাদ বহুগুণ বেড়ে যায়।",
      "cooking_tips_en": "Always fry the cauliflower florets until well-browned to prevent them from becoming mushy in the gravy. Using mustard oil is essential for the authentic smoky aroma and sharp taste.",
      "cooking_tips_bn": "ফুলকপি সবসময় লালচে করে ভাজবেন যাতে ঝোলে দেওয়ার পর তা গলে না যায়। খাঁটি সরষের তেল ব্যবহার করলে রান্নায় আসল ঝাঁঝালো স্বাদ ও গন্ধ পাওয়া যাবে।",
      "serving_en": "Best served hot with steamed Basmati rice. It also pairs wonderfully with handmade rotis or parathas for a hearty breakfast.",
      "serving_bn": "গরম ধোঁয়া ওঠা ভাতের সাথে এটি সবচেয়ে ভালো লাগে। এছাড়া রুটি বা পরোটার সাথেও এটি দারুণ মানিয়ে যায়।",
      "storage_en": "Can be stored in an airtight container in the refrigerator for up to 2 days. Reheat gently on the stovetop, adding a splash of warm water if the gravy has thickened.",
      "storage_bn": "এয়ারটাইট পাত্রে ভরে ফ্রিজে ২ দিন পর্যন্ত রাখা যায়। খাওয়ার আগে সামান্য গরম জল দিয়ে ভালো করে ফুটিয়ে নেবেন।",
      "full_blog_en": "Bengali households have a special place for 'Dim-er Dalna' (Egg Curry), but when winter arrives, adding potatoes and cauliflower florets elevates it to a whole new level. This specific recipe focuses on the traditional 'bata moshla' (ground spices) technique. By soaking whole cumin, coriander, and dried chilies before grinding, you unlock an intensity of flavor that pre-packaged powders simply can't match. The process begins with carefully frying the star ingredients. Searing the eggs creates a slightly chewy, flavorful outer layer, while frying the potatoes and cauliflower ensures they hold their shape while soaking up the spicy gravy later. The base of the curry is a rich blend of onions, tomato puree, and the prepared spice paste, cooked slowly until the oil separates. This slow-cooking method is key to a professional-grade result. Once water is added and the curry comes to a boil, the fried components go back in, allowing the centers to become tender and infused with spice. Finishing with fresh coriander and a pinch of garam masala adds a fragrant top note that rounds out the earthy spices. It's a dish that tastes like home, perfect for a cozy family lunch.",
      "full_blog_bn": "বাঙালির হেঁশেলে ডিমের ডালনা খুবই পরিচিত একটি পদ। তবে শীতের নতুন আলু আর কচি ফুলকপি যখন এর সাথে যোগ হয়, তখন তার স্বাদ হয় অতুলনীয়। এই রেসিপিতে গুঁড়ো মশলার পরিবর্তে বাটা মশলা ব্যবহারের ওপর জোর দেওয়া হয়েছে, যা রান্নায় বনেদি স্বাদ নিয়ে আসে। প্রথমে ডিম, আলু ও ফুলকপি আলাদাভাবে লালচে করে ভেজে নেওয়া হয়। এরপর পেঁয়াজ, টমেটো বাটা এবং বাটা মশলা দিয়ে ধীর আঁচে কষানো হয় যতক্ষণ না তেল ছেড়ে আসে। এই কষানোর পদ্ধতিই হলো রান্নার আসল রহস্য। সবশেষে ধনেপাতা ও গরম মশলা ছড়িয়ে নামিয়ে নিলে তৈরি হয়ে যায় অমৃত সম এই পদ। গরম ভাতের সাথে এক চামচ ঘি আর এই তরকারি থাকলে আর কিছুই লাগে না।"
    },
    "ingredients": [
      {
        "id": 13,
        "recipe_id": 2,
        "ingredient_id": 13,
        "quantity": "8-10",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "boiled and peeled",
        "notes_bn": "সেদ্ধ করা",
        "ingredient": {
          "id": 13,
          "name_en": "Coconut Oil",
          "name_bn": "নারকেল তেল",
          "img": "/ingredients/13_coconut_oil.jpg",
          "phonetic": [
            "coconut oil",
            "coocoonut ooil",
            "coconut oeel",
            "coconoot oil"
          ],
          "createdAt": "2026-01-06T01:34:18.989Z",
          "updatedAt": "2026-01-06T01:34:18.989Z"
        }
      },
      {
        "id": 14,
        "recipe_id": 2,
        "ingredient_id": 14,
        "quantity": "4-5",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "cubed",
        "notes_bn": "টুকরো করা",
        "ingredient": {
          "id": 14,
          "name_en": "Soy Sauce",
          "name_bn": "সয়া সস",
          "img": "https://www.themealdb.com/images/ingredients/Soy%20Sauce.png",
          "phonetic": [
            "soy sauce",
            "soy saauce",
            "sooy sauce",
            "soy saucee"
          ],
          "createdAt": "2026-01-06T01:34:19.175Z",
          "updatedAt": "2026-01-06T01:34:19.175Z"
        }
      },
      {
        "id": 15,
        "recipe_id": 2,
        "ingredient_id": 15,
        "quantity": "1",
        "unit_en": "large",
        "unit_bn": "বড়",
        "notes_en": "cut into florets",
        "notes_bn": "টুকরো করা",
        "ingredient": {
          "id": 15,
          "name_en": "Olive Oil",
          "name_bn": "অলিভ অয়েল",
          "img": "https://www.themealdb.com/images/ingredients/Olive%20Oil.png",
          "phonetic": [
            "olive oil",
            "oolive ooil",
            "olivee oil",
            "oleeve oeel"
          ],
          "createdAt": "2026-01-06T01:34:19.345Z",
          "updatedAt": "2026-01-06T01:34:19.345Z"
        }
      },
      {
        "id": 16,
        "recipe_id": 2,
        "ingredient_id": 10,
        "quantity": "3",
        "unit_en": "large",
        "unit_bn": "বড়",
        "notes_en": "chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 10,
          "name_en": "Rice",
          "name_bn": "চাল",
          "img": "https://www.themealdb.com/images/ingredients/Rice.png",
          "phonetic": [
            "chal",
            "chaal",
            "bhat"
          ],
          "createdAt": "2026-01-06T01:34:17.472Z",
          "updatedAt": "2026-01-06T01:34:17.472Z"
        }
      },
      {
        "id": 17,
        "recipe_id": 2,
        "ingredient_id": 16,
        "quantity": "3",
        "unit_en": "medium",
        "unit_bn": "মাঝারি",
        "notes_en": "pureed",
        "notes_bn": "বাটা",
        "ingredient": {
          "id": 16,
          "name_en": "Turmeric",
          "name_bn": "হলুদ",
          "img": "https://www.themealdb.com/images/ingredients/Turmeric.png",
          "phonetic": [
            "haldi",
            "holdi",
            "holdee",
            "halud"
          ],
          "createdAt": "2026-01-06T01:34:19.635Z",
          "updatedAt": "2026-01-06T01:34:19.635Z"
        }
      },
      {
        "id": 18,
        "recipe_id": 2,
        "ingredient_id": 17,
        "quantity": "20",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "sliced for paste",
        "notes_bn": "বাটার জন্য",
        "ingredient": {
          "id": 17,
          "name_en": "Coriander",
          "name_bn": "ধনেপাতা",
          "img": "https://www.themealdb.com/images/ingredients/Coriander.png",
          "phonetic": [
            "dhoniya",
            "dhonea",
            "dhania"
          ],
          "createdAt": "2026-01-06T01:34:19.802Z",
          "updatedAt": "2026-01-06T01:34:19.802Z"
        }
      },
      {
        "id": 19,
        "recipe_id": 2,
        "ingredient_id": 18,
        "quantity": "2",
        "unit_en": "whole bulbs",
        "unit_bn": "টি",
        "notes_en": "peeled for paste",
        "notes_bn": "বাটার জন্য",
        "ingredient": {
          "id": 18,
          "name_en": "Cumin",
          "name_bn": "জিরা",
          "img": "https://www.themealdb.com/images/ingredients/Cumin.png",
          "phonetic": [
            "jeera",
            "jira",
            "zira"
          ],
          "createdAt": "2026-01-06T01:34:19.973Z",
          "updatedAt": "2026-01-06T01:34:19.973Z"
        }
      },
      {
        "id": 20,
        "recipe_id": 2,
        "ingredient_id": 19,
        "quantity": "5-6",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "soaked",
        "notes_bn": "ভিজিয়ে রাখা",
        "ingredient": {
          "id": 19,
          "name_en": "Cinnamon",
          "name_bn": "দারুচিনি",
          "img": "https://images.unsplash.com/photo-1589733429478-43017351acc8?auto=format&fit=crop&w=600&q=80",
          "phonetic": [
            "dalchini",
            "daalchini"
          ],
          "createdAt": "2026-01-06T01:34:20.141Z",
          "updatedAt": "2026-01-06T01:34:20.141Z"
        }
      },
      {
        "id": 21,
        "recipe_id": 2,
        "ingredient_id": 20,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for paste",
        "notes_bn": "বাটার জন্য",
        "ingredient": {
          "id": 20,
          "name_en": "Cardamom",
          "name_bn": "এলাচ",
          "img": "https://www.themealdb.com/images/ingredients/Cardamom.png",
          "phonetic": [
            "elach",
            "elaach",
            "elaichi"
          ],
          "createdAt": "2026-01-06T01:34:20.321Z",
          "updatedAt": "2026-01-06T01:34:20.321Z"
        }
      },
      {
        "id": 22,
        "recipe_id": 2,
        "ingredient_id": 21,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for paste",
        "notes_bn": "বাটার জন্য",
        "ingredient": {
          "id": 21,
          "name_en": "Salt",
          "name_bn": "লবণ",
          "img": "https://www.themealdb.com/images/ingredients/Salt.png",
          "phonetic": [
            "noon",
            "nun",
            "lon",
            "namak"
          ],
          "createdAt": "2026-01-06T01:34:20.489Z",
          "updatedAt": "2026-01-06T01:34:20.489Z"
        }
      },
      {
        "id": 23,
        "recipe_id": 2,
        "ingredient_id": 22,
        "quantity": "1/2",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "for frying and cooking",
        "notes_bn": "রান্নার জন্য",
        "ingredient": {
          "id": 22,
          "name_en": "Sugar",
          "name_bn": "চিনি",
          "img": "https://www.themealdb.com/images/ingredients/Sugar.png",
          "phonetic": [
            "chini",
            "cheeni",
            "chinee"
          ],
          "createdAt": "2026-01-06T01:34:20.659Z",
          "updatedAt": "2026-01-06T01:34:20.659Z"
        }
      }
    ],
    "steps": [
      {
        "id": 9,
        "recipe_id": 2,
        "step_number": 1,
        "instruction_en": "Soak dry red chilies, ginger slices, garlic, cumin seeds, and coriander seeds in water for 10 minutes, then grind into a smooth paste.",
        "instruction_bn": "শুকনো লঙ্কা, আদা, রসুন, গোটা জিরে এবং গোটা ধনে ১০ মিনিট জলে ভিজিয়ে রেখে একটি মসৃণ পেস্ট তৈরি করে নিন।",
        "timestamp": "0:01:24"
      },
      {
        "id": 10,
        "recipe_id": 2,
        "step_number": 2,
        "instruction_en": "Heat mustard oil in a pan. Fry boiled eggs with a pinch of turmeric, chili powder, and salt until golden brown. Set aside.",
        "instruction_bn": "কড়াইতে সরষের তেল গরম করে সেদ্ধ ডিমগুলো হলুদ, লঙ্কার গুঁড়ো ও নুন দিয়ে লালচে করে ভেজে তুলে রাখুন।",
        "timestamp": "0:02:11"
      },
      {
        "id": 11,
        "recipe_id": 2,
        "step_number": 3,
        "instruction_en": "In the same oil, fry the potato chunks with a little salt until they are about 90% cooked and golden. Set aside.",
        "instruction_bn": "একই তেলে সামান্য নুন দিয়ে আলুর টুকরোগুলো লালচে করে ভেজে নিন (প্রায় ৯০% সেদ্ধ হওয়া পর্যন্ত) এবং তুলে রাখুন।",
        "timestamp": "0:03:08"
      },
      {
        "id": 12,
        "recipe_id": 2,
        "step_number": 4,
        "instruction_en": "Fry cauliflower florets with salt and turmeric until golden brown. Set aside.",
        "instruction_bn": "ফুলকপিগুলো নুন ও হলুদ দিয়ে লালচে করে ভেজে তুলে নিন।",
        "timestamp": "0:04:09"
      },
      {
        "id": 13,
        "recipe_id": 2,
        "step_number": 5,
        "instruction_en": "In the remaining oil, add whole spices (cloves, cinnamon, cardamom). Add chopped onions and fry until golden brown.",
        "instruction_bn": "বাকি তেলে গোটা গরম মশলা ফোড়ন দিয়ে কুচানো পেঁয়াজগুলো সোনালী করে ভাজুন।",
        "timestamp": "0:04:46"
      },
      {
        "id": 14,
        "recipe_id": 2,
        "step_number": 6,
        "instruction_en": "Add green chilies and turmeric powder. Mix in the prepared spice paste and sauté for 4-5 minutes until oil separates.",
        "instruction_bn": "কাঁচা লঙ্কা ও হলুদ গুঁড়ো দিন। এবার আগে থেকে তৈরি করা মশলার পেস্টটি দিয়ে ৪-৫ মিনিট কষান যতক্ষণ না তেল ছেড়ে আসছে।",
        "timestamp": "0:05:24"
      },
      {
        "id": 15,
        "recipe_id": 2,
        "step_number": 7,
        "instruction_en": "Add tomato puree and salt. Cook until the raw smell of tomatoes is gone.",
        "instruction_bn": "টমেটো বাটা ও নুন দিয়ে কষান যতক্ষণ না টমেটোর কাঁচা গন্ধ চলে যাচ্ছে।",
        "timestamp": "0:05:50"
      },
      {
        "id": 16,
        "recipe_id": 2,
        "step_number": 8,
        "instruction_en": "Add the fried potatoes and cauliflower. Mix well, cover, and cook for 1-2 minutes to let the flavors meld.",
        "instruction_bn": "ভেজে রাখা আলু ও ফুলকপি দিন। ভালো করে মিশিয়ে ঢেকে ১-২ মিনিট রান্না করুন।",
        "timestamp": "0:06:29"
      },
      {
        "id": 17,
        "recipe_id": 2,
        "step_number": 9,
        "instruction_en": "Add warm water for the gravy and bring to a boil. Add the fried eggs and simmer until the gravy reaches desired consistency.",
        "instruction_bn": "পরিমাণমতো গরম জল দিয়ে ফুটিয়ে নিন। ঝোল ফুটে উঠলে ভাজা ডিমগুলো দিয়ে দিন এবং কিছুক্ষণ ফুটিয়ে নিন।",
        "timestamp": "0:07:14"
      },
      {
        "id": 18,
        "recipe_id": 2,
        "step_number": 10,
        "instruction_en": "Finish with chopped coriander leaves and garam masala. Serve hot with steamed rice.",
        "instruction_bn": "ধনেপাতা কুচি ও গরম মশলা ছড়িয়ে নামিয়ে নিন। গরম ভাতের সাথে পরিবেশন করুন।",
        "timestamp": "0:07:22"
      }
    ]
  },
  {
    "id": 3,
    "slug": "fulkopir-fry-recipe",
    "title_en": "10-Minute Cauliflower Fry (Fulkopir Fry)",
    "title_bn": "ফুলকপির ফ্রাই রেসিপি মাত্ৰ ১০ মিনিটে",
    "image": "https://i.ytimg.com/vi/3EFlfRk9h60/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=3EFlfRk9h60",
    "youtube_id": "3EFlfRk9h60",
    "cuisine": "Indian",
    "category": "Snack",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 10,
    "cook_time": 15,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:20.839Z",
    "updatedAt": "2026-01-06T01:34:20.839Z",
    "blogContent": {
      "id": 3,
      "recipe_id": 3,
      "intro_en": "This Cauliflower Fry is a quick and easy recipe that turns a humble vegetable into a burst of flavors. It takes only 10-15 minutes to prepare and is perfect for busy weekdays.",
      "intro_bn": "এই ফুলকপি ফ্রাই একটি অত্যন্ত সহজ ও দ্রুত রেসিপি যা সাধারণ ফুলকপিকে অসাধারণ স্বাদে বদলে দেয়। মাত্র ১০-১৫ মিনিটে তৈরি এই পদটি ব্যস্ত দিনের জন্য একদম উপযুক্ত।",
      "what_makes_it_special_en": "The secret lies in the yogurt-based marination and cooking the cauliflower in its own juices without any extra water. This ensures a rich, concentrated taste in every bite.",
      "what_makes_it_special_bn": "এই রেসিপির বিশেষত্ব হলো দইয়ের ম্যারিনেশন এবং কোনো জল ছাড়া ফুলকপি থেকে বের হওয়া জলেই রান্না করা। এতে প্রতি কামড়ে মশলার গভীর স্বাদ পাওয়া যায়।",
      "cooking_tips_en": "Do not over-blanch the cauliflower; 30% cooking is enough. Ensure the water is completely drained before marinating so the spices coat the florets perfectly.",
      "cooking_tips_bn": "ফুলকপি খুব বেশি ভাপাবেন না; ৩০% সেদ্ধ হওয়াই যথেষ্ট। ম্যারিনেট করার আগে জল ভালো করে ঝরিয়ে নিন যাতে মশলাগুলো ফুলকপির গায়ে ঠিকমতো লেগে থাকে।",
      "serving_en": "This dish pairs exceptionally well with Luchi, Paratha, or hot Rotis. It can also be served as a side dish with Dal-Chawal.",
      "serving_bn": "এটি লুচি, পরোটা বা গরম রুটির সাথে খেতে দারুণ লাগে। এছাড়া ডাল-ভাতের সাথে সাইড ডিশ হিসেবেও পরিবেশন করা যায়।",
      "storage_en": "Store leftovers in an airtight container in the refrigerator for up to 1-2 days. Reheat gently in a pan before serving.",
      "storage_bn": "বেঁচে যাওয়া অংশ ১-২ দিন ফ্রিজে এয়ারটাইট পাত্রে রাখা যায়। খাওয়ার আগে প্যানে হালকা গরম করে নিন।",
      "full_blog_en": "Cauliflower is a versatile vegetable that can be cooked in numerous ways, but this '10-Minute Cauliflower Fry' is a game-changer. Often we find cauliflower curries either too mushy or undercooked, but the technique of blanching it only up to 30% ensures the perfect bite. The marination is the heart of this dish—yogurt adds a subtle tanginess while mustard oil and Kashmiri chili provide a beautiful color and aroma.\n\nThe process is incredibly straightforward. After blanching and marinating, the florets are sautéed with basic spices and finished with tomatoes and peas. What makes this version superior is the 'No Water' cooking method. The moisture from the tomatoes and the cauliflower itself is sufficient to cook the dish, preventing it from becoming a soggy curry. Adding crushed black pepper and black salt at the end provides a street-style kick that elevates the dish further. Whether you are a beginner or a seasoned cook, this recipe by Chef Atanu is a must-try for your next meal.",
      "full_blog_bn": "ফুলকপি দিয়ে অনেক কিছু রান্না করা যায়, তবে এই '১০ মিনিটের ফুলকপি ফ্রাই' আপনার রান্নার তালিকায় নতুন মাত্রা যোগ করবে। অনেক সময় ফুলকপি হয়তো খুব বেশি গলে যায় অথবা কাঁচা থেকে যায়, কিন্তু ৩০% ভাপিয়ে নেওয়ার পদ্ধতিটি এর টেক্সচার নিখুঁত রাখে। এই পদের প্রাণ হলো এর ম্যারিনেশন—টক দই স্বাদে টক ভাব আনে এবং সরষের তেল ও কাশ্মীরি লঙ্কা সুন্দর রঙ ও গন্ধ নিশ্চিত করে।\n\nরান্নাটি খুবই সহজ। ভাপিয়ে ও ম্যারিনেট করে নেওয়ার পর সাধারণ ফোড়ন দিয়ে কষানো হয় এবং শেষে টমেটো ও কড়াইশুঁটি যোগ করা হয়। এর সবচেয়ে বড় সুবিধা হলো এতে কোনো বাড়তি জল লাগে না। টমেটো ও ফুলকপির নিজস্ব জলই রান্নার জন্য যথেষ্ট, যা একে কাদার মতো হতে দেয় না। শেষে গোলমরিচ গুঁড়ো এবং বিটনুন যোগ করায় এতে একটি চটপটে স্বাদ আসে। আপনি নতুন রাঁধুনি হোন বা অভিজ্ঞ, শেফ অতনুর এই রেসিপিটি একবার ট্রাই করা অবশ্যই উচিত।"
    },
    "ingredients": [
      {
        "id": 24,
        "recipe_id": 3,
        "ingredient_id": 15,
        "quantity": "2",
        "unit_en": "medium sized",
        "unit_bn": "মাঝারি সাইজের",
        "notes_en": "cut into small florets",
        "notes_bn": "ছোট ছোট টুকরো করা",
        "ingredient": {
          "id": 15,
          "name_en": "Olive Oil",
          "name_bn": "অলিভ অয়েল",
          "img": "https://www.themealdb.com/images/ingredients/Olive%20Oil.png",
          "phonetic": [
            "olive oil",
            "oolive ooil",
            "olivee oil",
            "oleeve oeel"
          ],
          "createdAt": "2026-01-06T01:34:19.345Z",
          "updatedAt": "2026-01-06T01:34:19.345Z"
        }
      },
      {
        "id": 25,
        "recipe_id": 3,
        "ingredient_id": 7,
        "quantity": "3",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for marination",
        "notes_bn": "ম্যারিনেশনের জন্য",
        "ingredient": {
          "id": 7,
          "name_en": "Green Chili",
          "name_bn": "কাঁচা মরিচ",
          "img": "https://www.themealdb.com/images/ingredients/Green%20Chili.png",
          "phonetic": [
            "kacha morich",
            "kachka morich",
            "morich"
          ],
          "createdAt": "2026-01-06T01:34:16.949Z",
          "updatedAt": "2026-01-06T01:34:16.949Z"
        }
      },
      {
        "id": 26,
        "recipe_id": 3,
        "ingredient_id": 22,
        "quantity": "5-6",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for cooking and marination",
        "notes_bn": "রান্না এবং ম্যারিনেশনের জন্য",
        "ingredient": {
          "id": 22,
          "name_en": "Sugar",
          "name_bn": "চিনি",
          "img": "https://www.themealdb.com/images/ingredients/Sugar.png",
          "phonetic": [
            "chini",
            "cheeni",
            "chinee"
          ],
          "createdAt": "2026-01-06T01:34:20.659Z",
          "updatedAt": "2026-01-06T01:34:20.659Z"
        }
      },
      {
        "id": 27,
        "recipe_id": 3,
        "ingredient_id": 2,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "can be replaced with ginger-cumin paste for veg version",
        "notes_bn": "নিরামিষ করতে চাইলে আদা জিরে বাটা ব্যবহার করুন",
        "ingredient": {
          "id": 2,
          "name_en": "Beef",
          "name_bn": "গরুর মাংস",
          "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Raw_beef_steak.jpg/640px-Raw_beef_steak.jpg",
          "phonetic": [
            "gorur mangsho",
            "gorur mangso",
            "mangsho",
            "beef"
          ],
          "createdAt": "2026-01-06T01:34:16.068Z",
          "updatedAt": "2026-01-06T01:34:16.068Z"
        }
      },
      {
        "id": 28,
        "recipe_id": 3,
        "ingredient_id": 16,
        "quantity": "2",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "cut into wedges (1x6)",
        "notes_bn": "টুকরো করে কাটা",
        "ingredient": {
          "id": 16,
          "name_en": "Turmeric",
          "name_bn": "হলুদ",
          "img": "https://www.themealdb.com/images/ingredients/Turmeric.png",
          "phonetic": [
            "haldi",
            "holdi",
            "holdee",
            "halud"
          ],
          "createdAt": "2026-01-06T01:34:19.635Z",
          "updatedAt": "2026-01-06T01:34:19.635Z"
        }
      },
      {
        "id": 29,
        "recipe_id": 3,
        "ingredient_id": 23,
        "quantity": "100",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "fresh or frozen",
        "notes_bn": "তাজা বা ফ্রোজেন",
        "ingredient": {
          "id": 23,
          "name_en": "Butter",
          "name_bn": "মাখন",
          "img": "https://www.themealdb.com/images/ingredients/Butter.png",
          "phonetic": [
            "makhon",
            "makhan"
          ],
          "createdAt": "2026-01-06T01:34:22.164Z",
          "updatedAt": "2026-01-06T01:34:22.164Z"
        }
      },
      {
        "id": 30,
        "recipe_id": 3,
        "ingredient_id": 24,
        "quantity": "as required",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "Kashmiri chili powder: 1.5 tsp, Turmeric: 0.5 tsp, Coriander: 1 tsp, Cumin: 0.5 tsp",
        "notes_bn": "কাশ্মীরি লঙ্কার গুঁড়ো: ১.৫ চা চামচ, হলুদ: ০.৫ চা চামচ, ধনে গুঁড়ো: ১ চা চামচ, জিরে গুঁড়ো: ০.৫ চা চামচ",
        "ingredient": {
          "id": 24,
          "name_en": "Cheese",
          "name_bn": "পনির",
          "img": "https://www.themealdb.com/images/ingredients/Cheese.png",
          "phonetic": [
            "ponir",
            "paneer",
            "paner",
            "chiz"
          ],
          "createdAt": "2026-01-06T01:34:22.330Z",
          "updatedAt": "2026-01-06T01:34:22.330Z"
        }
      }
    ],
    "steps": [
      {
        "id": 19,
        "recipe_id": 3,
        "step_number": 1,
        "instruction_en": "Cut cauliflower into small, uniform florets. Blanch them in hot water with salt and turmeric for 3-4 minutes until 30% cooked. Drain well.",
        "instruction_bn": "ফুলকপি ছোট টুকরো করে কেটে নিন। নুন ও হলুদ মেশানো গরম জলে ৩-৪ মিনিট ভাপিয়ে নিন (৩০% সেদ্ধ হওয়া পর্যন্ত)। জল ঝরিয়ে রাখুন।",
        "timestamp": "0:45"
      },
      {
        "id": 20,
        "recipe_id": 3,
        "step_number": 2,
        "instruction_en": "Prepare a marination by mixing yogurt, mustard oil, Kashmiri red chili powder, turmeric, coriander powder, cumin powder, and salt.",
        "instruction_bn": "টক দই, সরষের তেল, কাশ্মীরি লঙ্কার গুঁড়ো, হলুদ গুঁড়ো, ধনে গুঁড়ো, জিরে গুঁড়ো এবং নুন মিশিয়ে একটি ম্যারিনেশনের মিশ্রণ তৈরি করুন।",
        "timestamp": "1:44"
      },
      {
        "id": 21,
        "recipe_id": 3,
        "step_number": 3,
        "instruction_en": "Coat the blanched cauliflower florets thoroughly with the yogurt mixture while they are still warm.",
        "instruction_bn": "ভাপানো ফুলকপিগুলো উষ্ণ থাকতেই দইয়ের মিশ্রণের সাথে ভালো করে মাখিয়ে নিন।",
        "timestamp": "3:01"
      },
      {
        "id": 22,
        "recipe_id": 3,
        "step_number": 4,
        "instruction_en": "Heat mustard oil in a pan. Sauté whole cumin seeds and dry red chilies. Add ginger-garlic paste and cook until the raw smell disappears.",
        "instruction_bn": "প্যানে সরষের তেল গরম করে গোটা জিরে ও শুকনো লঙ্কা ফোড়ন দিন। আদা-রসুন বাটা দিয়ে কাঁচা গন্ধ যাওয়া পর্যন্ত কষান।",
        "timestamp": "3:20"
      },
      {
        "id": 23,
        "recipe_id": 3,
        "step_number": 5,
        "instruction_en": "Add the marinated cauliflower to the pan. Cook on low heat for 5-7 minutes, stirring occasionally.",
        "instruction_bn": "ম্যারিনেট করা ফুলকপি দিয়ে দিন। কম আঁচে ৫-৭ মিনিট রান্না করুন এবং মাঝে মাঝে নেড়ে দিন।",
        "timestamp": "4:13"
      },
      {
        "id": 24,
        "recipe_id": 3,
        "step_number": 6,
        "instruction_en": "Add tomato wedges and green peas. Cover and cook until the cauliflower is 80-90% done. No extra water is needed.",
        "instruction_bn": "টমেটো টুকরো এবং কড়াইশুটি দিয়ে দিন। ঢাকা দিয়ে রান্না করুন যতক্ষণ না ফুলকপি ৮০-৯০% সেদ্ধ হয়। বাড়তি জল দেবেন না।",
        "timestamp": "5:15"
      },
      {
        "id": 25,
        "recipe_id": 3,
        "step_number": 7,
        "instruction_en": "Sprinkle crushed black pepper and black salt. Give it a final mix.",
        "instruction_bn": "গুঁড়ো করা গোলমরিচ এবং বিটনুন ছড়িয়ে ভালো করে মিশিয়ে নিন।",
        "timestamp": "6:32"
      },
      {
        "id": 26,
        "recipe_id": 3,
        "step_number": 8,
        "instruction_en": "Finish with green chilies, garam masala, and fresh coriander leaves. Serve hot with roti or paratha.",
        "instruction_bn": "কাঁচা লঙ্কা, গরম মশলা এবং ধনেপাতা কুচি ছড়িয়ে নামিয়ে নিন। রুটি বা পরোটার সাথে গরম গরম পরিবেশন করুন।",
        "timestamp": "7:07"
      }
    ]
  },
  {
    "id": 4,
    "slug": "crispy-cauliflower-pakora-recipe",
    "title_en": "Crispy Cauliflower Pakora (Fulkopir Pakora)",
    "title_bn": "মুচমুচে ফুলকপির পাকোড়া রেসিপি",
    "image": "https://i.ytimg.com/vi/k72x--k_U64/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=k72x--k_U64",
    "youtube_id": "k72x--k_U64",
    "cuisine": "Indian",
    "category": "Snack",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 15,
    "cook_time": 10,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:22.529Z",
    "updatedAt": "2026-01-06T01:34:22.529Z",
    "blogContent": {
      "id": 4,
      "recipe_id": 4,
      "intro_en": "Nothing beats the joy of munching on hot, crispy Cauliflower Pakoras on a winter evening. This recipe from Chef Atanu is designed to deliver a professional-grade crunch that stays crispy for long. Perfectly seasoned and deep-fried to perfection, these pakoras are a must-try for any snack lover.",
      "intro_bn": "শীতের সন্ধ্যায় ধোঁয়া ওঠা গরম ও মুচমুচে ফুলকপির পাকোড়ার মজাই আলাদা। শেফ অতনুর এই রেসিপিটি অনুসরণ করলে আপনি পাবেন পেশাদার মানের মুচমুচে ভাব যা অনেকক্ষণ বজায় থাকে। নিখুঁত মশলাদার এবং ভাজা এই পাকোড়াগুলো যে কোনো আড্ডার প্রধান আকর্ষণ হতে পারে।",
      "what_makes_it_special_en": "The secret to the extreme crunch in this recipe is the use of rice flour and the technique of dry-dusting the cauliflower with cornflour before battering. Additionally, the final tempering with garlic and curry leaves adds a sophisticated layer of aroma and flavor rarely found in home-cooked pakoras.",
      "what_makes_it_special_bn": "এই রেসিপির মুচমুচে হওয়ার আসল রহস্য হলো চালের গুঁড়ির ব্যবহার এবং ব্যাটারে ডোবানোর আগে শুকনো কর্নফ্লাওয়ার দিয়ে ডাস্ট করে নেওয়া। এছাড়া সবশেষে রসুন এবং কারিপাতা দিয়ে টস করায় এতে এমন একটি সুগন্ধ ও স্বাদ আসে যা সাধারণ ঘরোয়া পাকোড়ায় সচরাচর দেখা যায় না।",
      "cooking_tips_en": "1. Do not over-boil the cauliflower during blanching; it should retain a bite. 2. Ensure the florets are completely cold before adding to the batter to maintain the texture. 3. Fry in small batches to maintain oil temperature for consistent crispiness.",
      "cooking_tips_bn": "১. ভাপানোর সময় ফুলকপি খুব বেশি সেদ্ধ করবেন না; সামান্য শক্ত ভাব থাকতে হবে। ২. ব্যাটারে দেওয়ার আগে ফুলকপি পুরোপুরি ঠান্ডা করে নিন যাতে টেক্সচার নষ্ট না হয়। ৩. অল্প অল্প করে ভাজুন যাতে তেলের তাপমাত্রা ঠিক থাকে এবং সব পাকোড়া সমানভাবে মুচমুচে হয়।",
      "serving_en": "Serve these pakoras piping hot with a side of mint chutney or spicy tomato ketchup. They also make an excellent accompaniment to a hot cup of ginger tea or masala chai.",
      "serving_bn": "এই পাকোড়াগুলো পুদিনা চাটনি অথবা স্পাইসি টমেটো কেচাপের সাথে পরিবেশন করুন। এক কাপ আদা চা বা মশলা চায়ের সাথেও এটি দারুণ জমে যাবে।",
      "storage_en": "Pakoras are best eaten immediately. If they lose their crunch, you can reheat them in an oven or an air fryer for 2-3 minutes to restore the texture. Avoid covering them while hot as steam will make them soggy.",
      "storage_bn": "পাকোড়া গরম গরম খাওয়াই সবচেয়ে ভালো। যদি মুচমুচে ভাব কমে যায়, তবে ওভেন বা এয়ার ফ্রায়ারে ২-৩ মিনিট গরম করে নিতে পারেন। গরম অবস্থায় ঢেকে রাখবেন না, কারণ ভাপে এগুলো নরম হয়ে যাবে।",
      "full_blog_en": "Cauliflower is a versatile winter vegetable, and frying it into pakoras is perhaps its most popular avatar. This specific recipe focuses on the science of crispiness. By combining gram flour (besan) for taste and rice flour for texture, we create a batter that is both flavorful and light. The addition of tomato ketchup and chili paste provides a modern twist, giving the pakoras a tangy and spicy undertone that pairs beautifully with the earthy cauliflower.\n\nOne common issue home cooks face is the batter sliding off the vegetable. The technique shown here—dusting the cauliflower with dry cornflour—solves this by creating a rough surface for the batter to cling to. Furthermore, the blanching step ensures that even if you fry the pakoras quickly to keep the outside light, the inside is perfectly cooked and seasoned. The final 'tadka' or toss in garlic and curry leaves is what elevates this from a roadside snack to a gourmet appetizer. It’s an easy-to-follow method that brings professional results to your home kitchen.",
      "full_blog_bn": "ফুলকপি শীতের একটি অন্যতম সবজি, আর একে পাকোড়া হিসেবে ভাজা বোধহয় এর সবচেয়ে জনপ্রিয় রূপ। এই রেসিপিটি মূলত পাকোড়াকে দীর্ঘক্ষণ মুচমুচে রাখার কৌশলের ওপর ভিত্তি করে তৈরি। বেসন স্বাদের জন্য এবং চালের গুঁড়ি টেক্সচারের জন্য ব্যবহার করা হয়েছে। সাথে টমেটো কেচাপ ও চিলি পেস্টের মিশ্রণ একে একটি আধুনিক চটপটে স্বাদ দেয়।\n\nসাধারণত বাড়িতে পাকোড়া ভাজার সময় কোটিংটি মাংস বা সবজি থেকে ছেড়ে যায়। এই সমস্যা সমাধানে ফুলকপিগুলোকে শুকনো কর্নফ্লাওয়ার দিয়ে ডাস্ট করে নেওয়ার পদ্ধতিটি অত্যন্ত কার্যকর। ভাপিয়ে নেওয়ার ফলে ভাজার সময় ভেতরটা কাঁচা থাকার কোনো ভয় থাকে না। সবশেষে রসুন ও কারিপাতার ফোড়ন একে রাস্তার ধারের সাধারণ খাবার থেকে এক অনন্য gourmet অ্যাপেটাইজারে রূপান্তর করে। এটি একটি সহজ পদ্ধতি যা আপনাকে ঘরে বসেই রেস্টুরেন্টের মতো ফলাফল দেবে।"
    },
    "ingredients": [
      {
        "id": 31,
        "recipe_id": 4,
        "ingredient_id": 15,
        "quantity": "1",
        "unit_en": "medium size",
        "unit_bn": "মাঝারি সাইজের",
        "notes_en": "cut into small florets",
        "notes_bn": "ছোট ছোট টুকরো করে কাটা",
        "ingredient": {
          "id": 15,
          "name_en": "Olive Oil",
          "name_bn": "অলিভ অয়েল",
          "img": "https://www.themealdb.com/images/ingredients/Olive%20Oil.png",
          "phonetic": [
            "olive oil",
            "oolive ooil",
            "olivee oil",
            "oleeve oeel"
          ],
          "createdAt": "2026-01-06T01:34:19.345Z",
          "updatedAt": "2026-01-06T01:34:19.345Z"
        }
      },
      {
        "id": 32,
        "recipe_id": 4,
        "ingredient_id": 2,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "freshly prepared",
        "notes_bn": "তাজা বাটা",
        "ingredient": {
          "id": 2,
          "name_en": "Beef",
          "name_bn": "গরুর মাংস",
          "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Raw_beef_steak.jpg/640px-Raw_beef_steak.jpg",
          "phonetic": [
            "gorur mangsho",
            "gorur mangso",
            "mangsho",
            "beef"
          ],
          "createdAt": "2026-01-06T01:34:16.068Z",
          "updatedAt": "2026-01-06T01:34:16.068Z"
        }
      },
      {
        "id": 33,
        "recipe_id": 4,
        "ingredient_id": 25,
        "quantity": "4",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for extra crispiness",
        "notes_bn": "বেশি মুচমুচে করার জন্য",
        "ingredient": {
          "id": 25,
          "name_en": "Noodles",
          "name_bn": "নুডলস",
          "img": "https://www.themealdb.com/images/ingredients/Noodles.png",
          "phonetic": [
            "noodles",
            "noooodles",
            "noodlees"
          ],
          "createdAt": "2026-01-06T01:34:23.459Z",
          "updatedAt": "2026-01-06T01:34:23.459Z"
        }
      },
      {
        "id": 34,
        "recipe_id": 4,
        "ingredient_id": 26,
        "quantity": "3",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for binding",
        "notes_bn": "বাইন্ডিং এর জন্য",
        "ingredient": {
          "id": 26,
          "name_en": "Lentils",
          "name_bn": "মসুর ডাল",
          "img": "https://www.themealdb.com/images/ingredients/Lentils.png",
          "phonetic": [
            "dal",
            "daal",
            "dhal"
          ],
          "createdAt": "2026-01-06T01:34:23.627Z",
          "updatedAt": "2026-01-06T01:34:23.627Z"
        }
      },
      {
        "id": 35,
        "recipe_id": 4,
        "ingredient_id": 27,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for dusting",
        "notes_bn": "কোটিং এর জন্য",
        "ingredient": {
          "id": 27,
          "name_en": "Mustard Oil",
          "name_bn": "সরিষার তেল",
          "img": "https://www.southasiancentral.com/wp-content/uploads/2021/04/Radhuni-Mustard-Oil-500-ml.jpg",
          "phonetic": [
            "shorisher tel",
            "sorisher tel",
            "sarson tel"
          ],
          "createdAt": "2026-01-06T01:34:23.796Z",
          "updatedAt": "2026-01-06T01:34:23.796Z"
        }
      },
      {
        "id": 36,
        "recipe_id": 4,
        "ingredient_id": 28,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for tanginess",
        "notes_bn": "টক ভাব আনার জন্য",
        "ingredient": {
          "id": 28,
          "name_en": "Shrimp",
          "name_bn": "চিংড়ি",
          "img": "https://www.themealdb.com/images/ingredients/Shrimp.png",
          "phonetic": [
            "chingri",
            "choto chingri"
          ],
          "createdAt": "2026-01-06T01:34:23.976Z",
          "updatedAt": "2026-01-06T01:34:23.976Z"
        }
      },
      {
        "id": 37,
        "recipe_id": 4,
        "ingredient_id": 29,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "or chili sauce",
        "notes_bn": "অথবা চিলি সস",
        "ingredient": {
          "id": 29,
          "name_en": "Lemon",
          "name_bn": "লেবু",
          "img": "https://www.themealdb.com/images/ingredients/Lemon.png",
          "phonetic": [
            "lebu",
            "leboo",
            "nimbu"
          ],
          "createdAt": "2026-01-06T01:34:24.151Z",
          "updatedAt": "2026-01-06T01:34:24.151Z"
        }
      },
      {
        "id": 38,
        "recipe_id": 4,
        "ingredient_id": 30,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "or lemon juice",
        "notes_bn": "অথবা লেবুর রস",
        "ingredient": {
          "id": 30,
          "name_en": "Yogurt",
          "name_bn": "দই",
          "img": "https://www.themealdb.com/images/ingredients/Yogurt.png",
          "phonetic": [
            "doi",
            "dohi",
            "dahi"
          ],
          "createdAt": "2026-01-06T01:34:24.322Z",
          "updatedAt": "2026-01-06T01:34:24.322Z"
        }
      },
      {
        "id": 39,
        "recipe_id": 4,
        "ingredient_id": 18,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "chopped for final toss",
        "notes_bn": "শেষে কুচি করে দেওয়ার জন্য",
        "ingredient": {
          "id": 18,
          "name_en": "Cumin",
          "name_bn": "জিরা",
          "img": "https://www.themealdb.com/images/ingredients/Cumin.png",
          "phonetic": [
            "jeera",
            "jira",
            "zira"
          ],
          "createdAt": "2026-01-06T01:34:19.973Z",
          "updatedAt": "2026-01-06T01:34:19.973Z"
        }
      },
      {
        "id": 40,
        "recipe_id": 4,
        "ingredient_id": 31,
        "quantity": "10-12",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "for aroma",
        "notes_bn": "সুগন্ধের জন্য",
        "ingredient": {
          "id": 31,
          "name_en": "Lamb",
          "name_bn": "ভেড়ার মাংস",
          "img": "https://www.themealdb.com/images/ingredients/Lamb.png",
          "phonetic": [
            "bherar mangsho",
            "lamb"
          ],
          "createdAt": "2026-01-06T01:34:24.608Z",
          "updatedAt": "2026-01-06T01:34:24.608Z"
        }
      }
    ],
    "steps": [
      {
        "id": 27,
        "recipe_id": 4,
        "step_number": 1,
        "instruction_en": "Cut the cauliflower into small, uniform florets. Blanch them in hot water with salt for 3 minutes until slightly tender but not fully cooked. Drain and let them cool completely.",
        "instruction_bn": "ফুলকপি ছোট ও সমান টুকরো করে কেটে নিন। নুন মেশানো গরম জলে ৩ মিনিট ভাপিয়ে নিন যাতে সামান্য নরম হয় কিন্তু পুরোপুরি সেদ্ধ না হয়। জল ঝরিয়ে পুরোপুরি ঠান্ডা হতে দিন।",
        "timestamp": "0:01:24"
      },
      {
        "id": 28,
        "recipe_id": 4,
        "step_number": 2,
        "instruction_en": "Prepare the marinade by mixing ginger-garlic paste, coriander powder, cumin powder, Kashmiri red chili powder, tomato ketchup, chili paste, chopped coriander, vinegar, salt, and black salt in a bowl.",
        "instruction_bn": "একটি বাটিতে আদা-রসুন বাটা, ধনে গুঁড়ো, জিরে গুঁড়ো, কাশ্মীরি লঙ্কার গুঁড়ো, টমেটো কেচাপ, চিলি পেস্ট, ধনেপাতা কুচি, ভিনেগার, নুন এবং বিট নুন মিশিয়ে ম্যারিনেশন তৈরি করুন।",
        "timestamp": "0:02:47"
      },
      {
        "id": 29,
        "recipe_id": 4,
        "step_number": 3,
        "instruction_en": "Add rice flour and gram flour (besan) to the spice mix. Gradually add a little water and whisk to make a thick, consistent batter. Avoid making it too thin.",
        "instruction_bn": "মশলার মিশ্রণে চালের গুঁড়ি এবং বেসন দিন। অল্প অল্প জল যোগ করুন এবং ফেটিয়ে একটি ঘন ব্যাটার তৈরি করুন। খুব বেশি পাতলা করবেন না।",
        "timestamp": "0:03:31"
      },
      {
        "id": 30,
        "recipe_id": 4,
        "step_number": 4,
        "instruction_en": "Lightly dust the cooled cauliflower florets with dry cornflour. This helps the batter stick better and ensures maximum crispiness.",
        "instruction_bn": "ঠান্ডা হওয়া ফুলকপিগুলো শুকনো কর্নফ্লাওয়ার দিয়ে হালকা করে ডাস্ট করে নিন। এতে ব্যাটারটি ভালো করে লেগে থাকবে এবং পাকোড়া বেশি মুচমুচে হবে।",
        "timestamp": "0:03:54"
      },
      {
        "id": 31,
        "recipe_id": 4,
        "step_number": 5,
        "instruction_en": "Add the dusted cauliflower to the batter and mix gently by hand until each floret is evenly coated.",
        "instruction_bn": "ডাস্ট করা ফুলকপিগুলো ব্যাটারে দিয়ে দিন এবং হালকা হাতে মাখিয়ে নিন যাতে প্রতিটি টুকরোয় সমানভাবে মশলা লাগে।",
        "timestamp": "0:04:18"
      },
      {
        "id": 32,
        "recipe_id": 4,
        "step_number": 6,
        "instruction_en": "Heat oil on medium flame. Deep fry the florets in batches for 2-3 minutes until they turn golden brown and crispy. Avoid stirring for the first minute to let the coating set.",
        "instruction_bn": "মাঝারি আঁচে তেল গরম করুন। ফুলকপিগুলো কয়েকবারে লালচে এবং মুচমুচে করে ২-৩ মিনিট ধরে ভাজুন। প্রথম এক মিনিট নাড়াচাড়া করবেন না যাতে কোটিংটি ঠিকমতো সেট হয়।",
        "timestamp": "0:05:06"
      },
      {
        "id": 33,
        "recipe_id": 4,
        "step_number": 7,
        "instruction_en": "For a restaurant-style finish, heat 2-3 tsp oil in a pan. Sauté chopped garlic, green chilies, and curry leaves. Toss the fried pakoras in this mixture for a minute and serve hot.",
        "instruction_bn": "রেস্টুরেন্ট স্টাইল ফিনিশ আনতে একটি প্যানে ২-৩ চামচ তেল গরম করে কুচানো রসুন, কাঁচা লঙ্কা এবং কারিপাতা ভাজুন। ভাজা পাকোড়াগুলো এতে দিয়ে এক মিনিট টস করে নিন এবং গরম গরম পরিবেশন করুন।",
        "timestamp": "0:06:33"
      }
    ]
  },
  {
    "id": 5,
    "slug": "biye-barir-phulkopir-roast",
    "title_en": "Bengali Wedding-Style Cauliflower Roast",
    "title_bn": "বিয়েবাড়ির ফুলকপি রোস্ট",
    "image": "https://i.ytimg.com/vi/v7Tf6FhBYvk/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=v7Tf6FhBYvk",
    "youtube_id": "v7Tf6FhBYvk",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Medium",
    "prep_time": 25,
    "cook_time": 35,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:24.887Z",
    "updatedAt": "2026-01-06T01:34:24.887Z",
    "blogContent": {
      "id": 5,
      "recipe_id": 5,
      "intro_en": "Phulkopir Roast is a legendary dish often served at Bengali weddings. It features large cauliflower florets simmered in a rich, white, and creamy gravy that is both aromatic and slightly sweet. This recipe brings that regal catering taste right into your kitchen.",
      "intro_bn": "ফুলকপি রোস্ট বা ফুলকপির কোরমা বাঙালি বিয়েবাড়ির একটি অত্যন্ত জনপ্রিয় ও আভিজাত্যপূর্ণ পদ। মখমলে সাদা গ্রেভিতে রান্না করা এই পদটি স্বাদে অতুলনীয় এবং সুগন্ধে ভরপুর। এই রেসিপিটি অনুসরণ করলে আপনি ঘরেই পাবেন বিয়েবাড়ির আসল স্বাদ।",
      "what_makes_it_special_en": "What defines this roast is the 'Shada Moshla' or white gravy. The combination of boiled onion paste, cashews, and milk creates a luxurious texture without the heavy use of red chili powder. Shallow frying the florets in butter adds a deep, nutty flavor that is truly celebratory.",
      "what_makes_it_special_bn": "এই রোস্টের বিশেষত্ব হলো এর সাদা গ্রেভি। পেঁয়াজ, কাজু বাদাম এবং চারমগজ সেদ্ধ করে তৈরি করা পেস্ট এবং ঝোলের জন্য জলের বদলে দুধের ব্যবহার একে আভিজাত্য দেয়। মাখনে ফুলকপি ভাজার ফলে এতে একটি রাজকীয় স্বাদ যুক্ত হয়।",
      "cooking_tips_en": "Do not overcook the cauliflower during the initial blanching, or it will break in the gravy. Ensure the heat is very low when adding yogurt and milk to prevent curdling. Using whole green chilies in the paste provides flavor without overwhelming heat.",
      "cooking_tips_bn": "ফুলকপি ভাপানোর সময় খুব বেশি সেদ্ধ করবেন না, নতুবা পরে ভেঙে যেতে পারে। দই এবং দুধ মেশানোর সময় আঁচ একদম কমিয়ে নেবেন যাতে তা ফেটে না যায়। কাঁচা লঙ্কা বাটার সময় আস্ত ব্যবহার করলে ঝাল কম হবে কিন্তু সুন্দর সুগন্ধ পাওয়া যাবে।",
      "serving_en": "Serve this Phulkopir Roast piping hot with Basmati Polao, Ghee Rice, or Saffron rice. It also pairs perfectly with Luchis or Butter Parathas for a festive meal.",
      "serving_bn": "এই ফুলকপি রোস্ট সুগন্ধি বাসমতি পোলাও, ঘি-ভাত বা জাফরান রাইসের সাথে পরিবেশন করুন। এছাড়াও উৎসবের আমেজে এটি লুচি বা বাটার পরোটার সাথেও দারুণ জমে যাবে।",
      "storage_en": "Store leftovers in an airtight container in the fridge for up to 2 days. Reheat gently on a stovetop with a splash of warm milk to restore the creamy consistency.",
      "storage_bn": "বেঁচে যাওয়া অংশ এয়ারটাইট পাত্রে ফ্রিজে ২ দিন পর্যন্ত রাখা যাবে। গরম করার সময় সামান্য ইষদুষ্ণ দুধ মিশিয়ে চুলায় হালকা আঁচে গরম করে নেবেন।",
      "full_blog_en": "If you have ever been to a Bengali wedding, the Phulkopir Roast is a dish that needs no introduction. It is the quintessential vegetarian masterpiece that sits proudly alongside rich meat curries. The beauty of this dish lies in its balance—it is rich yet mild, aromatic but not overly spicy. \n\nThe process begins with selecting a fresh, tight head of cauliflower. Large florets are essential as they hold their shape through the double cooking process of frying and simmering. The secret of the pros is boiling the onions and nuts before grinding; this removes the pungent onion smell and results in a white, silky smooth paste. \n\nInstead of water, we use milk for the gravy, which adds a natural creaminess and a hint of sweetness that defines Bengali roast recipes. Shallow frying the cauliflower in a mix of oil and butter adds a layer of depth that cannot be achieved by boiling alone. This dish is perfect for hosting dinner parties where you want a vegetarian option that feels truly special. Follow this guide to master the art of the perfect Bengali Wedding Roast.",
      "full_blog_bn": "বাঙালি বিয়েবাড়ির নিরামিষ পদের রাজা হলো এই ফুলকপি রোস্ট। মাছ-মাংসের ভিড়েও এই পদটি তার নিজস্ব আভিজাত্যে উজ্জ্বল। এর বিশেষত্ব হলো এর মৃদু স্বাদ এবং রাজকীয় সুগন্ধ। রান্নার আসল কৌশল হলো পেঁয়াজ ও বাদাম সেদ্ধ করে নিয়ে বাটা, যা গ্রেভিকে সাদা ও রেশমি করতে সাহায্য করে। \n\nসাধারণ তরকারিতে আমরা জল ব্যবহার করলেও রোস্টের ক্ষেত্রে দুধ ব্যবহার করা হয়। এটি স্বাদে এক ধরণের মিষ্টতা এবং আভিজাত্য নিয়ে আসে। ফুলকপিগুলো মাখনে ভেজে নেওয়ার ফলে তা গ্রেভিতে দেওয়ার পরও তার আকার বজায় রাখে এবং ভেতর থেকে নরম হয়। \n\nযেকোনো অতিথি আপ্যায়নে বা বিশেষ দিনে বাড়ির লোকেদের জন্য এটি হতে পারে সেরা একটি পদ। রান্নার সময় আঁচ নিয়ন্ত্রণ এবং সঠিক মশলার ব্যবহার করলে আপনিও ঘরে বসে তৈরি করতে পারবেন ক্যাটারার স্টাইল ফুলকপি রোস্ট। আজই ট্রাই করে দেখুন এই ক্লাসিক বাঙালি রেসিপিটি।"
    },
    "ingredients": [
      {
        "id": 41,
        "recipe_id": 5,
        "ingredient_id": 15,
        "quantity": "1",
        "unit_en": "medium size",
        "unit_bn": "মাঝারি সাইজ",
        "notes_en": "cut into large florets",
        "notes_bn": "বড় বড় টুকরো করে কাটা",
        "ingredient": {
          "id": 15,
          "name_en": "Olive Oil",
          "name_bn": "অলিভ অয়েল",
          "img": "https://www.themealdb.com/images/ingredients/Olive%20Oil.png",
          "phonetic": [
            "olive oil",
            "oolive ooil",
            "olivee oil",
            "oleeve oeel"
          ],
          "createdAt": "2026-01-06T01:34:19.345Z",
          "updatedAt": "2026-01-06T01:34:19.345Z"
        }
      },
      {
        "id": 42,
        "recipe_id": 5,
        "ingredient_id": 10,
        "quantity": "200",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "roughly chopped for paste",
        "notes_bn": "বাটার জন্য বড় কুচি করা",
        "ingredient": {
          "id": 10,
          "name_en": "Rice",
          "name_bn": "চাল",
          "img": "https://www.themealdb.com/images/ingredients/Rice.png",
          "phonetic": [
            "chal",
            "chaal",
            "bhat"
          ],
          "createdAt": "2026-01-06T01:34:17.472Z",
          "updatedAt": "2026-01-06T01:34:17.472Z"
        }
      },
      {
        "id": 43,
        "recipe_id": 5,
        "ingredient_id": 32,
        "quantity": "20",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "soaked",
        "notes_bn": "ভিজিয়ে রাখা",
        "ingredient": {
          "id": 32,
          "name_en": "Mutton",
          "name_bn": "খাসির মাংস",
          "img": "/ingredients/32_mutton.jpg",
          "phonetic": [
            "khashir mangsho",
            "khasi",
            "khasir mangso"
          ],
          "createdAt": "2026-01-06T01:34:25.933Z",
          "updatedAt": "2026-01-06T01:34:25.933Z"
        }
      },
      {
        "id": 44,
        "recipe_id": 5,
        "ingredient_id": 33,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "soaked",
        "notes_bn": "ভিজিয়ে রাখা",
        "ingredient": {
          "id": 33,
          "name_en": "Salmon",
          "name_bn": "স্যামন মাছ",
          "img": "https://www.themealdb.com/images/ingredients/Salmon.png",
          "phonetic": [
            "salmon",
            "saalmon",
            "salmoon"
          ],
          "createdAt": "2026-01-06T01:34:26.107Z",
          "updatedAt": "2026-01-06T01:34:26.107Z"
        }
      },
      {
        "id": 45,
        "recipe_id": 5,
        "ingredient_id": 3,
        "quantity": "5",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "slit",
        "notes_bn": "চেরা",
        "ingredient": {
          "id": 3,
          "name_en": "Egg",
          "name_bn": "ডিম",
          "img": "https://www.themealdb.com/images/ingredients/Egg.png",
          "phonetic": [
            "dim",
            "deem",
            "anda"
          ],
          "createdAt": "2026-01-06T01:34:16.250Z",
          "updatedAt": "2026-01-06T01:34:16.250Z"
        }
      },
      {
        "id": 46,
        "recipe_id": 5,
        "ingredient_id": 2,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "freshly prepared",
        "notes_bn": "তাজা বাটা",
        "ingredient": {
          "id": 2,
          "name_en": "Beef",
          "name_bn": "গরুর মাংস",
          "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Raw_beef_steak.jpg/640px-Raw_beef_steak.jpg",
          "phonetic": [
            "gorur mangsho",
            "gorur mangso",
            "mangsho",
            "beef"
          ],
          "createdAt": "2026-01-06T01:34:16.068Z",
          "updatedAt": "2026-01-06T01:34:16.068Z"
        }
      },
      {
        "id": 47,
        "recipe_id": 5,
        "ingredient_id": 7,
        "quantity": "2",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "whisked smoothly",
        "notes_bn": "ভালো করে ফেটানো",
        "ingredient": {
          "id": 7,
          "name_en": "Green Chili",
          "name_bn": "কাঁচা মরিচ",
          "img": "https://www.themealdb.com/images/ingredients/Green%20Chili.png",
          "phonetic": [
            "kacha morich",
            "kachka morich",
            "morich"
          ],
          "createdAt": "2026-01-06T01:34:16.949Z",
          "updatedAt": "2026-01-06T01:34:16.949Z"
        }
      },
      {
        "id": 48,
        "recipe_id": 5,
        "ingredient_id": 34,
        "quantity": "1",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "for gravy",
        "notes_bn": "ঝোল তৈরির জন্য",
        "ingredient": {
          "id": 34,
          "name_en": "Soy Milk",
          "name_bn": "সয়া দুধ",
          "img": "/ingredients/35_soy_milk.jpg",
          "phonetic": [
            "soy milk",
            "sooy milk",
            "soy meelk"
          ],
          "createdAt": "2026-01-06T01:34:26.646Z",
          "updatedAt": "2026-01-06T01:34:26.646Z"
        }
      },
      {
        "id": 49,
        "recipe_id": 5,
        "ingredient_id": 35,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for frying",
        "notes_bn": "ভাজার জন্য",
        "ingredient": {
          "id": 35,
          "name_en": "Tofu",
          "name_bn": "টোফু",
          "img": "https://www.themealdb.com/images/ingredients/Tofu.png",
          "phonetic": [
            "tofu",
            "toofu",
            "tofoo"
          ],
          "createdAt": "2026-01-06T01:34:26.833Z",
          "updatedAt": "2026-01-06T01:34:26.833Z"
        }
      },
      {
        "id": 50,
        "recipe_id": 5,
        "ingredient_id": 36,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for balance",
        "notes_bn": "স্বাদের ভারসাম্যের জন্য",
        "ingredient": {
          "id": 36,
          "name_en": "Bok Choy",
          "name_bn": "বক চয়",
          "img": "/ingredients/37_bok_choy.jpg",
          "phonetic": [
            "bok choy",
            "book chooy"
          ],
          "createdAt": "2026-01-06T01:34:27.029Z",
          "updatedAt": "2026-01-06T01:34:27.029Z"
        }
      }
    ],
    "steps": [
      {
        "id": 34,
        "recipe_id": 5,
        "step_number": 1,
        "instruction_en": "Cut cauliflower into large florets. Blanch them in boiling water with a pinch of salt until 60-70% cooked. Drain and set aside.",
        "instruction_bn": "ফুলকপি বড় বড় টুকরো করে কাটুন। সামান্য নুন মেশানো ফুটন্ত জলে ৬০-৭০ শতাংশ সেদ্ধ করে নিন। জল ঝরিয়ে রাখুন।",
        "timestamp": "0:25"
      },
      {
        "id": 35,
        "recipe_id": 5,
        "step_number": 2,
        "instruction_en": "Sauté roughly chopped onions, soaked cashews, watermelon seeds, and raisins in a little oil until translucent. Add slit green chilies and water, then boil until soft.",
        "instruction_bn": "অল্প তেলে পেঁয়াজ কুচি, ভেজানো কাজু বাদাম, চারমগজ ও কিশমিশ হালকা করে ভাজুন। চেরা কাঁচা লঙ্কা ও জল দিয়ে সেদ্ধ করে নিন।",
        "timestamp": "1:02"
      },
      {
        "id": 36,
        "recipe_id": 5,
        "step_number": 3,
        "instruction_en": "Cool the boiled mixture and grind into a smooth, silky white paste. This forms the base of the roast.",
        "instruction_bn": "সেদ্ধ করা মিশ্রণটি ঠান্ডা করে একটি মসৃণ ও রেশমি সাদা পেস্ট তৈরি করুন। এটিই রোস্টের প্রধান মশলা।",
        "timestamp": "1:55"
      },
      {
        "id": 37,
        "recipe_id": 5,
        "step_number": 4,
        "instruction_en": "Heat oil and butter in a pan. Shallow fry the blanched cauliflower florets on low-medium heat until they turn lightly golden.",
        "instruction_bn": "প্যানে তেল ও মাখন গরম করুন। ভাপানো ফুলকপিগুলো কম আঁচে হালকা সোনালী করে ভেজে তুলে নিন।",
        "timestamp": "2:11"
      },
      {
        "id": 38,
        "recipe_id": 5,
        "step_number": 5,
        "instruction_en": "In the same pan, add whole spices and ginger-garlic paste. Sauté on low flame to remove raw aroma. Add cumin and coriander powders.",
        "instruction_bn": "একই প্যানে গোটা গরম মশলা এবং আদা-রসুন বাটা দিন। কম আঁচে কষান যাতে কাঁচা গন্ধ চলে যায়। জিরে ও ধনে গুঁড়ো মিশিয়ে দিন।",
        "timestamp": "2:57"
      },
      {
        "id": 39,
        "recipe_id": 5,
        "step_number": 6,
        "instruction_en": "Lower the heat and mix in whisked yogurt. Stir continuously until oil begins to separate from the spice mix.",
        "instruction_bn": "আঁচ কমিয়ে ফেটানো টক দই মিশিয়ে দিন। মশলা থেকে তেল ছাড়া শুরু না হওয়া পর্যন্ত নাড়তে থাকুন।",
        "timestamp": "3:09"
      },
      {
        "id": 40,
        "recipe_id": 5,
        "step_number": 7,
        "instruction_en": "Add the prepared white onion-nut paste. Mix well and pour in 1 cup of milk for a creamy texture. Bring to a simmer.",
        "instruction_bn": "তৈরি করা সাদা পেস্টটি মিশিয়ে দিন। গ্রেভির জন্য ১ কাপ দুধ ঢালুন। ঝোল ফুটে ওঠা পর্যন্ত অপেক্ষা করুন।",
        "timestamp": "3:29"
      },
      {
        "id": 41,
        "recipe_id": 5,
        "step_number": 8,
        "instruction_en": "Add the fried cauliflower florets to the gravy. Cover and cook on low heat for 8-10 minutes until tender and flavorful.",
        "instruction_bn": "ভাজা ফুলকপিগুলো ঝোলে দিয়ে দিন। ঢেকে কম আঁচে ৮-১০ মিনিট রান্না করুন যাতে মশলা ভেতরে পৌঁছায়।",
        "timestamp": "3:55"
      },
      {
        "id": 42,
        "recipe_id": 5,
        "step_number": 9,
        "instruction_en": "Finish with a sprinkle of garam masala and a touch of sugar. Let it rest for a few minutes before serving.",
        "instruction_bn": "সবশেষে সামান্য গরম মশলা এবং চিনি ছড়িয়ে নামিয়ে নিন। পরিবেশনের আগে কয়েক মিনিট ঢাকা দিয়ে রাখুন।",
        "timestamp": "4:11"
      }
    ]
  },
  {
    "id": 6,
    "slug": "niramish-phulkopi-rezala",
    "title_en": "Authentic Vegetarian Cauliflower Rezala (Phulkopi Rezala)",
    "title_bn": "সম্পূর্ণ নিরামিষ ফুলকপির রেজালা সঠিক রেসিপি",
    "image": "https://i.ytimg.com/vi/zs4R2w4CAoE/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=zs4R2w4CAoE",
    "youtube_id": "zs4R2w4CAoE",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Medium",
    "prep_time": 25,
    "cook_time": 35,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:27.223Z",
    "updatedAt": "2026-01-06T01:34:27.223Z",
    "blogContent": {
      "id": 6,
      "recipe_id": 6,
      "intro_en": "Experience a touch of Mughal elegance in a completely vegetarian avatar with this Cauliflower Rezala. Known for its distinct white, creamy, and aromatic gravy, this dish replaces meat with succulent cauliflower florets, making it a sophisticated addition to any festive menu.",
      "intro_bn": "নিরামিষ রান্নায় আভিজাত্যের ছোঁয়া আনতে তৈরি করুন এই ফুলকপির রেজালা। সাদা, মখমলে এবং সুগন্ধি গ্রেভির জন্য পরিচিত এই পদটি যেকোনো উৎসবের মেনুতে একটি অনন্য মাত্রা যোগ করে।",
      "what_makes_it_special_en": "Unlike regular curries, Phulkopi Rezala uses a base of milk, cashews, and watermelon seeds, resulting in a silky texture. The addition of dried rose petals and a custom-made spice blend containing mace and nutmeg provides a fragrance that is reminiscent of royal kitchens.",
      "what_makes_it_special_bn": "সাধারণ তরকারির তুলনায় ফুলকপির রেহজালা আলাদা এর দুধ, কাজু এবং চারমগজের রেশমি গ্রেভির কারণে। এতে ব্যবহৃত শুকনো গোলাপের পাপড়ি এবং জৈত্রী-জায়ফলের বিশেষ মশলা রান্নায় এক রাজকীয় সুগন্ধ নিয়ে আসে।",
      "cooking_tips_en": "Always soak the nuts and raisins in warm milk for the smoothest paste. When adding yogurt, ensure the flame is at its lowest to prevent curdling. Constant stirring is essential as the cashew-based gravy tends to stick to the bottom.",
      "cooking_tips_bn": "মসৃণ পেস্টের জন্য বাদাম ও কিশমিশ সবসময় উষ্ণ দুধে ভিজিয়ে রাখবেন। দই মেশানোর সময় আঁচ একদম কমিয়ে দেবেন যাতে দই ফেটে না যায়। কাজু বাটা থাকার কারণে গ্রেভি নিচে লেগে যেতে পারে, তাই অনবরত নাড়াচাড়া করা জরুরি।",
      "serving_en": "Phulkopi Rezala pairs exceptionally well with hot, fluffy Luchis or Butter Parathas. It is also an elegant companion to Saffron Polao or Ghee Rice.",
      "serving_bn": "এই ফুলকপি রেজালা গরম লুচি বা বাটার পরোটার সাথে দারুণ জমে যায়। এছাড়া জাফরান পোলাও বা ঘি-ভাতের সাথেও এটি পরিবেশন করা যেতে পারে।",
      "storage_en": "Store in an airtight container for up to 2 days in the refrigerator. Reheat gently on a stovetop with a splash of warm milk to restore its creamy consistency.",
      "storage_bn": "বেঁচে যাওয়া অংশ ২ দিন পর্যন্ত ফ্রিজে রাখা যাবে। খাওয়ার আগে সামান্য গরম দুধ মিশিয়ে হালকা আঁচে গরম করে নিলে এর মখমলে ভাব ফিরে আসবে।",
      "full_blog_en": "The Rezala is a crowning jewel of Mughlai cuisine, traditionally made with mutton or chicken. However, this 'Phulkopi Rezala' proves that vegetarian versions can be just as decadent. The key to a perfect Rezala lies in its color and aroma—it should be a pristine off-white with a fragrance that fills the room. \n\nThe preparation begins with a luxurious paste of cashews, poppy seeds, and watermelon seeds, soaked in milk rather than water. A unique addition in this recipe is raisins and dried rose petals, which add a subtle sweetness and a floral top note. The spice profile is complex but not 'spicy' in the traditional sense; it uses mace, nutmeg, and shahi jeera to build depth. \n\nOne of the expert techniques used here is the roasting and powdering of whole spices separately, which are added at the very end to preserve their delicate oils. Frying the cauliflower florets until they are just golden ensures they hold their shape in the rich, yogurt-based gravy. Whether you are hosting a dinner party or looking for a special Sunday lunch, this recipe by Chef Atanu will surely earn you rave reviews from your guests.",
      "full_blog_bn": "রেজালা হলো মুঘলাই রান্নার মুকুট, যা সাধারণত খাসি বা মুরগির মাংস দিয়ে তৈরি হয়। কিন্তু এই 'ফুলকপির রেজালা' প্রমাণ করে যে নিরামিষ সংস্করণও ঠিক ততটাই রাজকীয় হতে পারে। একটি নিখুঁত রেজালার প্রধান বৈশিষ্ট্য হলো এর শুভ্র রঙ এবং মনমাতানো সুগন্ধ।\n\nরান্নার শুরুতে জল নয় বরং দুধে কাজু, পোস্ত এবং চারমগজ ভিজিয়ে একটি রাজকীয় পেস্ট তৈরি করা হয়। এই রেসিপিতে কিশমিশ এবং শুকনো গোলাপের পাপড়ির ব্যবহার স্বাদে এক হালকা মিষ্টি ভাব এবং আভিজাত্য যোগ করে। এখানে ঝাল মশলার পরিবর্তে জৈত্রী, জায়ফল এবং শাহজিরে ব্যবহার করা হয় যা স্বাদের গভীরতা বাড়ায়।\n\nএকটি বিশেষ কৌশল হলো গোটা মশলা আলাদাভাবে গুঁড়ো করে একদম শেষে যোগ করা, যাতে সুগন্ধটি অটুট থাকে। ফুলকপিগুলো হালকা সোনালী করে ভেজে নিলে তা গ্রেভিতে গলে যায় না। অতিথি আপ্যায়ন হোক বা বিশেষ কোনো ছুটির দুপুর, শেফ অতনুর এই পদ্ধতি অনুসরণ করলে আপনার রান্না হবে একদম রেস্টুরেন্টের মতো।"
    },
    "ingredients": [
      {
        "id": 51,
        "recipe_id": 6,
        "ingredient_id": 15,
        "quantity": "1",
        "unit_en": "large",
        "unit_bn": "বড়",
        "notes_en": "cut into medium-sized florets",
        "notes_bn": "মাঝারি সাইজের টুকরো করা",
        "ingredient": {
          "id": 15,
          "name_en": "Olive Oil",
          "name_bn": "অলিভ অয়েল",
          "img": "https://www.themealdb.com/images/ingredients/Olive%20Oil.png",
          "phonetic": [
            "olive oil",
            "oolive ooil",
            "olivee oil",
            "oleeve oeel"
          ],
          "createdAt": "2026-01-06T01:34:19.345Z",
          "updatedAt": "2026-01-06T01:34:19.345Z"
        }
      },
      {
        "id": 52,
        "recipe_id": 6,
        "ingredient_id": 34,
        "quantity": "2",
        "unit_en": "cups",
        "unit_bn": "কাপ",
        "notes_en": "warm for soaking nuts",
        "notes_bn": "উষ্ণ গরম",
        "ingredient": {
          "id": 34,
          "name_en": "Soy Milk",
          "name_bn": "সয়া দুধ",
          "img": "/ingredients/35_soy_milk.jpg",
          "phonetic": [
            "soy milk",
            "sooy milk",
            "soy meelk"
          ],
          "createdAt": "2026-01-06T01:34:26.646Z",
          "updatedAt": "2026-01-06T01:34:26.646Z"
        }
      },
      {
        "id": 53,
        "recipe_id": 6,
        "ingredient_id": 32,
        "quantity": "50",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "soaked and ground",
        "notes_bn": "ভিজিয়ে বাটা",
        "ingredient": {
          "id": 32,
          "name_en": "Mutton",
          "name_bn": "খাসির মাংস",
          "img": "/ingredients/32_mutton.jpg",
          "phonetic": [
            "khashir mangsho",
            "khasi",
            "khasir mangso"
          ],
          "createdAt": "2026-01-06T01:34:25.933Z",
          "updatedAt": "2026-01-06T01:34:25.933Z"
        }
      },
      {
        "id": 54,
        "recipe_id": 6,
        "ingredient_id": 33,
        "quantity": "25",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "soaked and ground",
        "notes_bn": "ভিজিয়ে বাটা",
        "ingredient": {
          "id": 33,
          "name_en": "Salmon",
          "name_bn": "স্যামন মাছ",
          "img": "https://www.themealdb.com/images/ingredients/Salmon.png",
          "phonetic": [
            "salmon",
            "saalmon",
            "salmoon"
          ],
          "createdAt": "2026-01-06T01:34:26.107Z",
          "updatedAt": "2026-01-06T01:34:26.107Z"
        }
      },
      {
        "id": 55,
        "recipe_id": 6,
        "ingredient_id": 37,
        "quantity": "15",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "approx. 1.5 tsp",
        "notes_bn": "প্রায় ১.৫ চা চামচ",
        "ingredient": {
          "id": 37,
          "name_en": "Spring Onions",
          "name_bn": "পেঁয়াজ কলি",
          "img": "https://www.themealdb.com/images/ingredients/Spring%20Onions.png",
          "phonetic": [
            "spring onions",
            "spring oonioons",
            "spreeng oneeons"
          ],
          "createdAt": "2026-01-06T01:34:28.665Z",
          "updatedAt": "2026-01-06T01:34:28.665Z"
        }
      },
      {
        "id": 56,
        "recipe_id": 6,
        "ingredient_id": 38,
        "quantity": "100",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "soaked and ground",
        "notes_bn": "ভিজিয়ে বাটা",
        "ingredient": {
          "id": 38,
          "name_en": "Prawns",
          "name_bn": "চিংড়ি মাছ",
          "img": "https://www.themealdb.com/images/ingredients/Prawns.png",
          "phonetic": [
            "prawns",
            "praawns"
          ],
          "createdAt": "2026-01-06T01:34:28.846Z",
          "updatedAt": "2026-01-06T01:34:28.846Z"
        }
      },
      {
        "id": 57,
        "recipe_id": 6,
        "ingredient_id": 7,
        "quantity": "1.5",
        "unit_en": "cups",
        "unit_bn": "কাপ",
        "notes_en": "whisked smoothly",
        "notes_bn": "ভালো করে ফেটানো",
        "ingredient": {
          "id": 7,
          "name_en": "Green Chili",
          "name_bn": "কাঁচা মরিচ",
          "img": "https://www.themealdb.com/images/ingredients/Green%20Chili.png",
          "phonetic": [
            "kacha morich",
            "kachka morich",
            "morich"
          ],
          "createdAt": "2026-01-06T01:34:16.949Z",
          "updatedAt": "2026-01-06T01:34:16.949Z"
        }
      },
      {
        "id": 58,
        "recipe_id": 6,
        "ingredient_id": 11,
        "quantity": "1.5",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for aroma",
        "notes_bn": "সুগন্ধের জন্য",
        "ingredient": {
          "id": 11,
          "name_en": "Flour",
          "name_bn": "ময়দা",
          "img": "https://www.themealdb.com/images/ingredients/Flour.png",
          "phonetic": [
            "atta",
            "moida",
            "maida"
          ],
          "createdAt": "2026-01-06T01:34:17.646Z",
          "updatedAt": "2026-01-06T01:34:17.646Z"
        }
      },
      {
        "id": 59,
        "recipe_id": 6,
        "ingredient_id": 17,
        "quantity": "1.5",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "ground with green chilies",
        "notes_bn": "কাঁচা লঙ্কার সাথে বাটা",
        "ingredient": {
          "id": 17,
          "name_en": "Coriander",
          "name_bn": "ধনেপাতা",
          "img": "https://www.themealdb.com/images/ingredients/Coriander.png",
          "phonetic": [
            "dhoniya",
            "dhonea",
            "dhania"
          ],
          "createdAt": "2026-01-06T01:34:19.802Z",
          "updatedAt": "2026-01-06T01:34:19.802Z"
        }
      },
      {
        "id": 60,
        "recipe_id": 6,
        "ingredient_id": 39,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for authentic aroma",
        "notes_bn": "আসল সুগন্ধের জন্য",
        "ingredient": {
          "id": 39,
          "name_en": "Bell Pepper",
          "name_bn": "ক্যাপসিকাম",
          "img": "/ingredients/39_bell_pepper.jpg",
          "phonetic": [
            "bell pepper",
            "beell peeppeer"
          ],
          "createdAt": "2026-01-06T01:34:29.360Z",
          "updatedAt": "2026-01-06T01:34:29.360Z"
        }
      }
    ],
    "steps": [
      {
        "id": 43,
        "recipe_id": 6,
        "step_number": 1,
        "instruction_en": "Soak 50g cashews, 25g watermelon seeds, 15g poppy seeds, 100g raisins, and 1 tsp dried rose petals in 2 cups of warm milk for 8 minutes. Grind into a silky smooth paste.",
        "instruction_bn": "৫০ গ্রাম কাজু, ২৫ গ্রাম চারমগজ, ১৫ গ্রাম পোস্ত, ১০০ গ্রাম কিশমিশ এবং ১ চা চামচ শুকনো গোলাপের পাপড়ি ২ কাপ উষ্ণ দুধে ৮ মিনিট ভিজিয়ে রেখে একটি মিহি পেস্ট তৈরি করুন।",
        "timestamp": "0:43"
      },
      {
        "id": 44,
        "recipe_id": 6,
        "step_number": 2,
        "instruction_en": "Make a homemade Rezala spice powder by lightly dry-roasting mace, cinnamon, fennel seeds, cardamom, cloves, nutmeg, and shahi jeera for 40 seconds. Grind once cooled.",
        "instruction_bn": "জৈত্রী, দারুচিনি, মৌড়ি, এলাচ, লবঙ্গ, জায়ফল এবং শাহজিরে ৪০ সেকেন্ড ড্রাই রোস্ট করে ঠান্ডা হওয়ার পর গুঁড়ো মশলা তৈরি করুন।",
        "timestamp": "1:52"
      },
      {
        "id": 45,
        "recipe_id": 6,
        "step_number": 3,
        "instruction_en": "Heat oil in a pan and shallow fry the cauliflower florets with a pinch of salt on medium-high heat until 60% cooked and lightly golden. Remove and set aside.",
        "instruction_bn": "প্যানে তেল গরম করে মাঝারি-উচ্চ আঁচে সামান্য নুন দিয়ে ফুলকপিগুলো ৬০% সেদ্ধ হওয়া পর্যন্ত হালকা সোনালী করে ভেজে তুলে নিন।",
        "timestamp": "2:35"
      },
      {
        "id": 46,
        "recipe_id": 6,
        "step_number": 4,
        "instruction_en": "In the same pan, add ghee and temper with whole peppercorns and dry red chilies. Sauté 1.5 tsp ginger-green chili paste until the raw smell disappears.",
        "instruction_bn": "একই প্যানে ঘি দিয়ে গোটা গোলমরিচ ও শুকনো লঙ্কা ফোড়ন দিন। ১.৫ চা চামচ আদা-কাঁচা লঙ্কা বাটা দিয়ে কাঁচা গন্ধ যাওয়া পর্যন্ত কষান।",
        "timestamp": "3:11"
      },
      {
        "id": 47,
        "recipe_id": 6,
        "step_number": 5,
        "instruction_en": "Pour in the silky nut-milk paste. Sauté for 4-5 minutes on medium heat, stirring continuously, until the ghee starts to separate.",
        "instruction_bn": "তৈরি করা পেস্টটি ঢেলে দিন। মাঝারি আঁচে ৪-৫ মিনিট অনবরত নাড়ুন যতক্ষণ না ঘি আলাদা হওয়া শুরু করছে।",
        "timestamp": "3:52"
      },
      {
        "id": 48,
        "recipe_id": 6,
        "step_number": 6,
        "instruction_en": "Add coriander powder, Kashmiri red chili powder, and salt. Mix well, then lower the heat and whisk in 1.5 cups of yogurt. Cook for another 2 minutes.",
        "instruction_bn": "ধনে গুঁড়ো, কাশ্মীরি লঙ্কা গুঁড়ো এবং নুন দিন। আঁচ কমিয়ে ১.৫ কাপ টক দই মিশিয়ে আরও ২ মিনিট কষান।",
        "timestamp": "5:14"
      },
      {
        "id": 49,
        "recipe_id": 6,
        "step_number": 7,
        "instruction_en": "Incorporate the fried cauliflower florets into the gravy. Let them simmer without water for 3 minutes to absorb the flavors.",
        "instruction_bn": "ভাজা ফুলকপিগুলো গ্রেভিতে মিশিয়ে দিন। কোনো জল ছাড়া ৩ মিনিট ফুটতে দিন যাতে মশলা ভেতরে পৌঁছায়।",
        "timestamp": "6:09"
      },
      {
        "id": 50,
        "recipe_id": 6,
        "step_number": 8,
        "instruction_en": "Add a small amount of warm water (as needed) and a pinch of sugar. Cover and cook on medium-low heat for 9 minutes until cauliflower is tender.",
        "instruction_bn": "পরিমাণমতো উষ্ণ জল এবং সামান্য চিনি দিন। ঢেকে মাঝারি-কম আঁচে ৯ মিনিট রান্না করুন যতক্ষণ না ফুলকপি পুরোপুরি নরম হয়।",
        "timestamp": "6:43"
      },
      {
        "id": 51,
        "recipe_id": 6,
        "step_number": 9,
        "instruction_en": "Sprinkle the freshly prepared Rezala spice powder and (optional) a little khoa kheer. Mix gently and simmer for the final 4 minutes.",
        "instruction_bn": "আগে থেকে তৈরি রেজালার গুঁড়ো মশলা এবং সামান্য খোঁয়াখীর (ঐচ্ছিক) ছড়িয়ে দিন। হালকা হাতে মিশিয়ে শেষ ৪ মিনিট দমে রাখুন।",
        "timestamp": "7:04"
      }
    ]
  },
  {
    "id": 7,
    "slug": "gobi-manchurian-and-veg-chowmein",
    "title_en": "Gobi Manchurian & Veg Chowmein Recipe",
    "title_bn": "ফুলকপির মাঞ্চুরিয়ান ও ভেজ চাউমিন রেসিপি",
    "image": "https://i.ytimg.com/vi/AgbyXCmcQKo/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=AgbyXCmcQKo",
    "youtube_id": "AgbyXCmcQKo",
    "cuisine": "Chinese",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Medium",
    "prep_time": 25,
    "cook_time": 35,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:29.540Z",
    "updatedAt": "2026-01-06T01:34:29.540Z",
    "blogContent": {
      "id": 7,
      "recipe_id": 7,
      "intro_en": "Craving restaurant-style Indo-Chinese but want to stay home? This Gobi Manchurian and Veg Chowmein combo is the perfect solution for a complete dinner experience.",
      "intro_bn": "রেস্টুরেন্ট স্টাইল ইন্দো-চাইনিজ খেতে ইচ্ছে করছে? এই ফুলকপির মাঞ্চুরিয়ান এবং ভেজ চাউমিন কম্বোটি আপনার ডিনারের জন্য একদম উপযুক্ত।",
      "what_makes_it_special_en": "The secret to the extra crunch is dusting the battered cauliflower with dry cornstarch before frying, and the 'smoky' chowmein flavour comes from high-heat stir-frying.",
      "what_makes_it_special_bn": "ভাজার আগে শুকনো কর্নফ্লাওয়ারের কোটিং ফুলকপিকে অতিরিক্ত মুচমুচে করে তোলে এবং উচ্চ আঁচে নাড়াচাড়া করায় চাউমিনে চমৎকার স্মোকি ফ্লেভার আসে।",
      "cooking_tips_en": "Never stir noodles immediately after putting them in hot water to avoid breakage. For Manchurian, ensure the cauliflower is completely cool before coating with batter.",
      "cooking_tips_bn": "গরম জলে দেওয়ার সাথে সাথে নুডলস নাড়াচাড়া করবেন না, এতে ভেঙে যাওয়ার ভয় থাকে। মাঞ্চুরিয়ানের জন্য ফুলকপি ব্যাটারে দেওয়ার আগে পুরোপুরি ঠান্ডা করে নিন।",
      "serving_en": "Serve the dry Gobi Manchurian atop a bed of hot Veg Chowmein, garnished with freshly chopped spring onions and coriander.",
      "serving_bn": "গরম গরম ভেজ চাউমিনের সাথে ড্রাই ফুলকপি মাঞ্চুরিয়ান পরিবেশন করুন এবং উপরে কুচনো পেঁয়াজ কলি ও ধনেপাতা ছড়িয়ে দিন।",
      "storage_en": "Consume immediately for best crunch. If storing, keep the fried cauliflower and sauce separate to prevent sogginess.",
      "storage_bn": "মুচমুচে ভাব বজায় রাখতে সাথে সাথেই খেয়ে নিন। যদি পরে খেতে চান, তবে ভাজা ফুলকপি ও সস আলাদা রাখুন যেন নরম না হয়ে যায়।",
      "full_blog_en": "Mastering Indo-Chinese at home is easier than you think. Start by prepping your batter and blanching the cauliflower—remembering only to par-boil it so it retains a bite. The noodles require a delicate touch; just 40 seconds in boiling water ensures they remain long and silky. When stir-frying the vegetables, maintain high heat to replicate that authentic street-style char. For the Manchurian, the double-coating technique (batter + dry cornstarch) is a professional tip that guarantees a lasting crunch even after tossing in the savory, tangy sauce. This duo is a crowd-pleaser for weekend dinners.",
      "full_blog_bn": "বাড়িতেই রেস্টুরেন্টের মতো চাইনিজ রান্না করা এখন অনেক সহজ। প্রথমে ব্যাটার তৈরি করে ফুলকপিগুলো হালকা ভাপিয়ে নিন—খেয়াল রাখবেন যেন পুরোপুরি সেদ্ধ না হয়। নুডলস রান্নার সময় বাড়তি সতর্কতা প্রয়োজন; মাত্র ৪০ সেকেন্ড গরম জলে রাখলেই সেগুলো লম্বা ও ঝরঝরে থাকবে। সবজি ভাজার সময় আগুনের আঁচ বেশি রাখুন যাতে আসল স্মোকি স্বাদ পাওয়া যায়। মাঞ্চুরিয়ানের ক্ষেত্রে ডাবল কোটিং টেকনিক (ব্যাটার এবং শুকনো কর্নফ্লাওয়ার) ব্যবহার করলে সসে মেশানোর পরেও ফুলকপি মুচমুচে থাকে। এই চমৎকার কম্বোটি আপনার ছুটির দিনের ডিনারে ভিন্ন মাত্রা যোগ করবে।"
    },
    "ingredients": [
      {
        "id": 61,
        "recipe_id": 7,
        "ingredient_id": 15,
        "quantity": "2",
        "unit_en": "medium pieces",
        "unit_bn": "মাঝারি পিস",
        "notes_en": "cut into bite-sized florets",
        "notes_bn": "ছোট ছোট টুকরো করে কাটা",
        "ingredient": {
          "id": 15,
          "name_en": "Olive Oil",
          "name_bn": "অলিভ অয়েল",
          "img": "https://www.themealdb.com/images/ingredients/Olive%20Oil.png",
          "phonetic": [
            "olive oil",
            "oolive ooil",
            "olivee oil",
            "oleeve oeel"
          ],
          "createdAt": "2026-01-06T01:34:19.345Z",
          "updatedAt": "2026-01-06T01:34:19.345Z"
        }
      },
      {
        "id": 62,
        "recipe_id": 7,
        "ingredient_id": 40,
        "quantity": "3",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for the batter",
        "notes_bn": "ব্যাটার তৈরির জন্য",
        "ingredient": {
          "id": 40,
          "name_en": "Carrots",
          "name_bn": "গাজর",
          "img": "https://www.themealdb.com/images/ingredients/Carrots.png",
          "phonetic": [
            "carrots",
            "caarrots",
            "carroots"
          ],
          "createdAt": "2026-01-06T01:34:30.380Z",
          "updatedAt": "2026-01-06T01:34:30.380Z"
        }
      },
      {
        "id": 63,
        "recipe_id": 7,
        "ingredient_id": 41,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "plus extra for dusting",
        "notes_bn": "এবং উপর দিয়ে ছড়ানোর জন্য",
        "ingredient": {
          "id": 41,
          "name_en": "Cauliflower",
          "name_bn": "ফুলকপি",
          "img": "/ingredients/43-Cauliflower.png",
          "phonetic": [
            "fulkopi",
            "phulkopi",
            "foolkopi"
          ],
          "createdAt": "2026-01-06T01:34:30.560Z",
          "updatedAt": "2026-01-06T01:34:30.560Z"
        }
      },
      {
        "id": 64,
        "recipe_id": 7,
        "ingredient_id": 42,
        "quantity": "200",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "boiled until al dente",
        "notes_bn": "সেদ্ধ করা",
        "ingredient": {
          "id": 42,
          "name_en": "Spinach",
          "name_bn": "পালং শাক",
          "img": "https://www.themealdb.com/images/ingredients/Spinach.png",
          "phonetic": [
            "palak",
            "paalak",
            "palok",
            "shak"
          ],
          "createdAt": "2026-01-06T01:34:30.729Z",
          "updatedAt": "2026-01-06T01:34:30.729Z"
        }
      },
      {
        "id": 65,
        "recipe_id": 7,
        "ingredient_id": 2,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "freshly ground",
        "notes_bn": "তাজা বাটা",
        "ingredient": {
          "id": 2,
          "name_en": "Beef",
          "name_bn": "গরুর মাংস",
          "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Raw_beef_steak.jpg/640px-Raw_beef_steak.jpg",
          "phonetic": [
            "gorur mangsho",
            "gorur mangso",
            "mangsho",
            "beef"
          ],
          "createdAt": "2026-01-06T01:34:16.068Z",
          "updatedAt": "2026-01-06T01:34:16.068Z"
        }
      },
      {
        "id": 66,
        "recipe_id": 7,
        "ingredient_id": 43,
        "quantity": "2.5",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "dark soy sauce preferred",
        "notes_bn": "ডার্ক সোয়া সস",
        "ingredient": {
          "id": 43,
          "name_en": "Red Amaranth",
          "name_bn": "লাল শাক",
          "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Amaranthus_gangeticus.jpg/640px-Amaranthus_gangeticus.jpg",
          "phonetic": [
            "red amaranth",
            "red aamaaraanth",
            "reed amaranth"
          ],
          "createdAt": "2026-01-06T01:34:31.028Z",
          "updatedAt": "2026-01-06T01:34:31.028Z"
        }
      },
      {
        "id": 67,
        "recipe_id": 7,
        "ingredient_id": 28,
        "quantity": "4",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for manchurian sauce",
        "notes_bn": "মাঞ্চুরিয়ান সসের জন্য",
        "ingredient": {
          "id": 28,
          "name_en": "Shrimp",
          "name_bn": "চিংড়ি",
          "img": "https://www.themealdb.com/images/ingredients/Shrimp.png",
          "phonetic": [
            "chingri",
            "choto chingri"
          ],
          "createdAt": "2026-01-06T01:34:23.976Z",
          "updatedAt": "2026-01-06T01:34:23.976Z"
        }
      }
    ],
    "steps": [
      {
        "id": 52,
        "recipe_id": 7,
        "step_number": 1,
        "instruction_en": "Prepare a thick batter using flour, cornstarch, black pepper, Kashmiri chili powder, ginger-garlic paste, and water. Let it rest for 10-15 minutes.",
        "instruction_bn": "ময়দা, কর্নফ্লাওয়ার, গোলমরিচ গুঁড়ো, কাশ্মীরি লঙ্কা গুঁড়ো, আদা-রসুন বাটা এবং জল দিয়ে একটি ঘন ব্যাটার তৈরি করুন। এটি ১০-১৫ মিনিট রেখে দিন।",
        "timestamp": "0:45"
      },
      {
        "id": 53,
        "recipe_id": 7,
        "step_number": 2,
        "instruction_en": "Blanch the cauliflower florets in boiling salted water until 20-30% cooked, then drain and cool completely.",
        "instruction_bn": "ফুলকপির টুকরোগুলো নুন মেশানো ফুটন্ত জলে ২০-৩০% সেদ্ধ করে নিন, তারপর জল ঝরিয়ে ঠান্ডা হতে দিন।",
        "timestamp": "2:03"
      },
      {
        "id": 54,
        "recipe_id": 7,
        "step_number": 3,
        "instruction_en": "Boil the noodles for 30-40 seconds in salted water, drain, and keep aside to maintain length without breaking.",
        "instruction_bn": "নুন মেশানো গরম জলে ৩০-৪০ সেকেন্ড নুডলস সেদ্ধ করে জল ঝরিয়ে রাখুন যাতে ভেঙে না যায়।",
        "timestamp": "2:31"
      },
      {
        "id": 55,
        "recipe_id": 7,
        "step_number": 4,
        "instruction_en": "Stir-fry vegetables (carrots, beans, onions, capsicum) on high heat with ginger, garlic, and green chilies. Add noodles, soy sauce, and vinegar to finish the Chowmein.",
        "instruction_bn": "আদা, রসুন ও কাঁচা লঙ্কা দিয়ে গাজর, বিনস, পেঁয়াজ ও ক্যাপসিকাম উচ্চ আঁচে ভাজুন। এরপর নুডলস, সোয়া সস ও ভিনেগার মিশিয়ে চাউমিন তৈরি করুন।",
        "timestamp": "3:27"
      },
      {
        "id": 56,
        "recipe_id": 7,
        "step_number": 5,
        "instruction_en": "Coat the cooled cauliflower in the batter, dust with dry cornstarch for extra crunch, and deep fry until golden brown.",
        "instruction_bn": "ঠান্ডা ফুলকপিগুলো ব্যাটারে ডুবিয়ে উপরে শুকনো কর্নফ্লাওয়ার ছড়িয়ে দিন এবং লালচে করে ডুবো তেলে ভাজুন।",
        "timestamp": "5:08"
      },
      {
        "id": 57,
        "recipe_id": 7,
        "step_number": 6,
        "instruction_en": "Prepare the Manchurian sauce with soy sauce, chili sauce, ketchup, and vinegar. Sauté aromatics, add the sauce mixture, then toss in the fried cauliflower.",
        "instruction_bn": "সয়া সস, চিলি সস, কেচাপ ও ভিনেগার দিয়ে সস তৈরি করুন। কড়াইতে আদা-রসুন ভেজে সস দিন এবং ভাজা ফুলকপি মিশিয়ে পরিবেশন করুন।",
        "timestamp": "6:12"
      }
    ]
  },
  {
    "id": 8,
    "slug": "katla-macher-jhol-cauliflower-potato",
    "title_en": "Katla Fish Curry with Cauliflower and Potato",
    "title_bn": "ফুলকপি ও আলু দিয়ে কাতলা মাছের ঝোল",
    "image": "https://i.ytimg.com/vi/6irbfE89jPk/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=6irbfE89jPk",
    "youtube_id": "6irbfE89jPk",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 20,
    "cook_time": 30,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:31.345Z",
    "updatedAt": "2026-01-06T01:34:31.345Z",
    "blogContent": {
      "id": 8,
      "recipe_id": 8,
      "intro_en": "Nothing beats the comfort of a light and flavorful Katla Macher Jhol with seasonal winter vegetables. This recipe pairs succulent Katla fish with cauliflower and potatoes in a fragrant, traditional Bengali gravy.",
      "intro_bn": "শীতের তাজা ফুলকপি আর আলু দিয়ে কাতলা মাছের পাতলা ঝোলের স্বাদই আলাদা। এটি একটি অত্যন্ত পুষ্টিকর এবং সুস্বাদু বাঙালি পদ যা দুপুরের খাবারে দারুণ জমে যায়।",
      "what_makes_it_special_en": "This recipe stands out due to its use of freshly ground spices and the traditional tempering of black cumin (Kalonji), which gives the gravy a distinct aroma without being overly spicy.",
      "what_makes_it_special_bn": "এই রেসিপিটির বিশেষত্ব হলো শিল-পাটায় বাটা মশলার ব্যবহার এবং কালোজিরে ফোঁড়ন, যা ঝোলটিকে হালকা অথচ অসাধারণ সুগন্ধি করে তোলে।",
      "cooking_tips_en": "To prevent fish from sticking or oil from splashing, add a pinch of salt and turmeric to the hot oil before frying the fish. Also, sauté the cauliflower on high heat to retain its texture.",
      "cooking_tips_bn": "মাছ ভাজার সময় তেল ছিটকানো বন্ধ করতে তেলের মধ্যে সামান্য নুন ও হলুদ দিন। ফুলকপি রান্নার সময় উচ্চ আঁচে ভাজলে এর গঠন ঠিক থাকে এবং স্বাদ ভালো হয়।",
      "serving_en": "Serve this steaming hot Katla Macher Jhol with a plate of plain white Basmati or Atap rice for an authentic Bengali meal.",
      "serving_bn": "ধোঁয়া ওঠা গরম ভাতের সাথে এই কাতলা মাছের ঝোল পরিবেশন করুন একটি তৃপ্তিদায়ক বাঙালি ভোজের জন্য।",
      "storage_en": "The curry can be stored in an airtight container in the refrigerator for up to 2 days. Reheat gently on the stovetop before serving.",
      "storage_bn": "এই মাছের ঝোল ফ্রিজে এয়ারটাইট কন্টেনারে ২ দিন পর্যন্ত ভালো থাকে। খাওয়ার আগে হালকা আঁচে গরম করে নিন।",
      "full_blog_en": "Katla Macher Jhol with Alur and Fulkopi is a quintessential winter dish in Bengali households. The secret to a perfect fish curry lies in the quality of the fish and the freshness of the cauliflower. In this version, we focus on a light but deeply flavorful gravy. By using mustard oil, we ensure that authentic pungency, while the fresh ginger-garlic-cumin paste provides a soul-warming base. The cauliflower is lightly fried to seal in its sweetness before being simmered with the fish. It’s a low-oil, spice-balanced recipe that highlights the natural flavors of the ingredients. Whether it's a regular weekday or a special Sunday lunch, this dish is sure to win hearts at the dining table.",
      "full_blog_bn": "শীতের দুপুরে ফুলকপি আর আলু দিয়ে কাতলা মাছের ঝোল বাঙালির পরম তৃপ্তির খাবার। এই ঝোলটি যেমন হালকা তেমনি সুস্বাদু। সরষের তেলে মাছ ভেজে সেই তেলেই রান্না করায় ঝোলে সুন্দর একটা গন্ধ আসে। মশলা কষানোর সময় টমেটো বাটা ব্যবহারের ফলে ঝোলের রঙ এবং ঘনত্ব উভয়ই চমৎকার হয়। এই রেসিপিতে মশলার পরিমিত ব্যবহার করা হয়েছে যাতে মাছ এবং সবজির নিজস্ব স্বাদ বজায় থাকে। খুব কম সময়ে এবং সাধারণ ঘরোয়া উপকরণ দিয়ে এই রাজকীয় স্বাদের রান্নাটি আপনিও ট্রাই করতে পারেন। গরম ভাতের সাথে এই ঝোল থাকলে আর কিছুই লাগে না।"
    },
    "ingredients": [
      {
        "id": 68,
        "recipe_id": 8,
        "ingredient_id": 44,
        "quantity": "6",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "approx. 1 kg, cleaned",
        "notes_bn": "প্রায় ১ কেজি, পরিষ্কার করা",
        "ingredient": {
          "id": 44,
          "name_en": "Pasta",
          "name_bn": "পাস্তা",
          "img": "/ingredients/48-Pasta.png",
          "phonetic": [
            "pasta",
            "paastaa"
          ],
          "createdAt": "2026-01-06T01:34:32.148Z",
          "updatedAt": "2026-01-06T01:34:32.148Z"
        }
      },
      {
        "id": 69,
        "recipe_id": 8,
        "ingredient_id": 15,
        "quantity": "1",
        "unit_en": "medium",
        "unit_bn": "মাঝারি",
        "notes_en": "cut into large florets",
        "notes_bn": "বড় টুকরো করে কাটা",
        "ingredient": {
          "id": 15,
          "name_en": "Olive Oil",
          "name_bn": "অলিভ অয়েল",
          "img": "https://www.themealdb.com/images/ingredients/Olive%20Oil.png",
          "phonetic": [
            "olive oil",
            "oolive ooil",
            "olivee oil",
            "oleeve oeel"
          ],
          "createdAt": "2026-01-06T01:34:19.345Z",
          "updatedAt": "2026-01-06T01:34:19.345Z"
        }
      },
      {
        "id": 70,
        "recipe_id": 8,
        "ingredient_id": 14,
        "quantity": "2",
        "unit_en": "medium",
        "unit_bn": "মাঝারি",
        "notes_en": "peeled and wedged",
        "notes_bn": "খোসা ছাড়িয়ে লম্বা করে কাটা",
        "ingredient": {
          "id": 14,
          "name_en": "Soy Sauce",
          "name_bn": "সয়া সস",
          "img": "https://www.themealdb.com/images/ingredients/Soy%20Sauce.png",
          "phonetic": [
            "soy sauce",
            "soy saauce",
            "sooy sauce",
            "soy saucee"
          ],
          "createdAt": "2026-01-06T01:34:19.175Z",
          "updatedAt": "2026-01-06T01:34:19.175Z"
        }
      },
      {
        "id": 71,
        "recipe_id": 8,
        "ingredient_id": 22,
        "quantity": "150",
        "unit_en": "ml",
        "unit_bn": "মিলি",
        "notes_en": "for frying and cooking",
        "notes_bn": "ভাজা ও রান্নার জন্য",
        "ingredient": {
          "id": 22,
          "name_en": "Sugar",
          "name_bn": "চিনি",
          "img": "https://www.themealdb.com/images/ingredients/Sugar.png",
          "phonetic": [
            "chini",
            "cheeni",
            "chinee"
          ],
          "createdAt": "2026-01-06T01:34:20.659Z",
          "updatedAt": "2026-01-06T01:34:20.659Z"
        }
      },
      {
        "id": 72,
        "recipe_id": 8,
        "ingredient_id": 10,
        "quantity": "2",
        "unit_en": "medium",
        "unit_bn": "মাঝারি",
        "notes_en": "finely chopped",
        "notes_bn": "মিহি করে কুচানো",
        "ingredient": {
          "id": 10,
          "name_en": "Rice",
          "name_bn": "চাল",
          "img": "https://www.themealdb.com/images/ingredients/Rice.png",
          "phonetic": [
            "chal",
            "chaal",
            "bhat"
          ],
          "createdAt": "2026-01-06T01:34:17.472Z",
          "updatedAt": "2026-01-06T01:34:17.472Z"
        }
      },
      {
        "id": 73,
        "recipe_id": 8,
        "ingredient_id": 16,
        "quantity": "4",
        "unit_en": "small",
        "unit_bn": "ছোট",
        "notes_en": "pureed/pasted",
        "notes_bn": "বাটা",
        "ingredient": {
          "id": 16,
          "name_en": "Turmeric",
          "name_bn": "হলুদ",
          "img": "https://www.themealdb.com/images/ingredients/Turmeric.png",
          "phonetic": [
            "haldi",
            "holdi",
            "holdee",
            "halud"
          ],
          "createdAt": "2026-01-06T01:34:19.635Z",
          "updatedAt": "2026-01-06T01:34:19.635Z"
        }
      },
      {
        "id": 74,
        "recipe_id": 8,
        "ingredient_id": 20,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "ground into paste",
        "notes_bn": "বেটে নেওয়ার জন্য",
        "ingredient": {
          "id": 20,
          "name_en": "Cardamom",
          "name_bn": "এলাচ",
          "img": "https://www.themealdb.com/images/ingredients/Cardamom.png",
          "phonetic": [
            "elach",
            "elaach",
            "elaichi"
          ],
          "createdAt": "2026-01-06T01:34:20.321Z",
          "updatedAt": "2026-01-06T01:34:20.321Z"
        }
      },
      {
        "id": 75,
        "recipe_id": 8,
        "ingredient_id": 17,
        "quantity": "1",
        "unit_en": "inch",
        "unit_bn": "ইঞ্চি",
        "notes_en": "sliced for paste",
        "notes_bn": "বাটার জন্য স্লাইস করা",
        "ingredient": {
          "id": 17,
          "name_en": "Coriander",
          "name_bn": "ধনেপাতা",
          "img": "https://www.themealdb.com/images/ingredients/Coriander.png",
          "phonetic": [
            "dhoniya",
            "dhonea",
            "dhania"
          ],
          "createdAt": "2026-01-06T01:34:19.802Z",
          "updatedAt": "2026-01-06T01:34:19.802Z"
        }
      },
      {
        "id": 76,
        "recipe_id": 8,
        "ingredient_id": 18,
        "quantity": "12-15",
        "unit_en": "cloves",
        "unit_bn": "কোয়া",
        "notes_en": "for paste",
        "notes_bn": "বাটার জন্য",
        "ingredient": {
          "id": 18,
          "name_en": "Cumin",
          "name_bn": "জিরা",
          "img": "https://www.themealdb.com/images/ingredients/Cumin.png",
          "phonetic": [
            "jeera",
            "jira",
            "zira"
          ],
          "createdAt": "2026-01-06T01:34:19.973Z",
          "updatedAt": "2026-01-06T01:34:19.973Z"
        }
      },
      {
        "id": 77,
        "recipe_id": 8,
        "ingredient_id": 45,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for tempering",
        "notes_bn": "ফোড়নের জন্য",
        "ingredient": {
          "id": 45,
          "name_en": "Cabbage",
          "name_bn": "বাঁধাকপি",
          "img": "https://www.themealdb.com/images/ingredients/Cabbage.png",
          "phonetic": [
            "badha kopi",
            "badha-kopi",
            "bandha kopi"
          ],
          "createdAt": "2026-01-06T01:34:33.269Z",
          "updatedAt": "2026-01-06T01:34:33.269Z"
        }
      }
    ],
    "steps": [
      {
        "id": 58,
        "recipe_id": 8,
        "step_number": 1,
        "instruction_en": "Marinate the fish pieces with salt, turmeric powder, and a little mustard oil. Let it sit for 5-10 minutes.",
        "instruction_bn": "মাছের পিসগুলো নুন, হলুদ গুঁড়ো এবং সামান্য সরষের তেল দিয়ে মাখিয়ে ৫-১০ মিনিট রাখুন।",
        "timestamp": "0:57"
      },
      {
        "id": 59,
        "recipe_id": 8,
        "step_number": 2,
        "instruction_en": "Heat mustard oil in a pan. Add a pinch of salt and turmeric to the oil to prevent splashing. Fry the fish pieces until golden brown and set aside.",
        "instruction_bn": "কড়াইতে সরষের তেল গরম করুন। তেল ছিটকানো বন্ধ করতে সামান্য নুন ও হলুদ দিন। মাছের পিসগুলো লালচে করে ভেজে তুলে রাখুন।",
        "timestamp": "2:02"
      },
      {
        "id": 60,
        "recipe_id": 8,
        "step_number": 3,
        "instruction_en": "In the same oil, fry the cauliflower florets on high heat until the raw smell is gone. Then fry the potato wedges until they develop a light color. Remove and keep aside.",
        "instruction_bn": "একই তেলে ফুলকপিগুলো উচ্চ আঁচে ভেজে নিন যতক্ষণ না কাঁচা গন্ধ যাচ্ছে। এরপর আলুগুলো হালকা রঙ আসা পর্যন্ত ভেজে তুলে রাখুন।",
        "timestamp": "3:27"
      },
      {
        "id": 61,
        "recipe_id": 8,
        "step_number": 4,
        "instruction_en": "Prepare a smooth paste by grinding together cumin seeds, dry red chilies, ginger, garlic, and green chilies with a little water.",
        "instruction_bn": "গোটা জিরে, শুকনো লঙ্কা, আদা, রসুন এবং কাঁচা লঙ্কা সামান্য জল দিয়ে বেটে একটি মিহি পেস্ট তৈরি করুন।",
        "timestamp": "4:31"
      },
      {
        "id": 62,
        "recipe_id": 8,
        "step_number": 5,
        "instruction_en": "Temper the remaining oil with black cumin. Sauté the chopped onions until golden brown. Add the prepared spice paste and cook for 3-4 minutes until the raw smell of ginger-garlic disappears.",
        "instruction_bn": "অবশিষ্ট তেলে কালোজিরে ফোঁড়ন দিন। পেঁয়াজ কুচি লালচে করে ভাজুন। এরপর মশলা বাটা দিয়ে ৩-৪ মিনিট কষান যাতে আদা-রসুনের কাঁচা গন্ধ চলে যায়।",
        "timestamp": "4:57"
      },
      {
        "id": 63,
        "recipe_id": 8,
        "step_number": 6,
        "instruction_en": "Add turmeric powder, Kashmiri red chili powder, tomato puree, and salt. Cook until the oil separates from the masala.",
        "instruction_bn": "হলুদ গুঁড়ো, কাশ্মীরি লঙ্কা গুঁড়ো, টমেটো বাটা এবং নুন দিন। মশলা থেকে তেল ছাড়া পর্যন্ত কষাতে থাকুন।",
        "timestamp": "5:56"
      },
      {
        "id": 64,
        "recipe_id": 8,
        "step_number": 7,
        "instruction_en": "Add the fried cauliflower and potatoes. Mix well with the masala for 2 minutes. Pour in enough water for the gravy and bring to a boil.",
        "instruction_bn": "ভাজা ফুলকপি ও আলু দিয়ে মশলার সাথে ২ মিনিট কষান। এরপর ঝোলের জন্য পর্যাপ্ত জল দিন এবং ফুটতে দিন।",
        "timestamp": "7:03"
      },
      {
        "id": 65,
        "recipe_id": 8,
        "step_number": 8,
        "instruction_en": "Add the fried fish pieces to the boiling gravy. Simmer on low heat for 2-3 minutes. Garnish with fresh coriander leaves before serving.",
        "instruction_bn": "ফুটন্ত ঝোলে ভাজা মাছগুলো দিয়ে দিন। কম আঁচে ২-৩ মিনিট ফুটতে দিন। শেষে ধনেপাতা কুচি ছড়িয়ে নামিয়ে নিন।",
        "timestamp": "7:57"
      }
    ]
  },
  {
    "id": 9,
    "slug": "restaurant-style-aloo-kulcha-without-tandoor",
    "title_en": "Restaurant Style Aloo Kulcha without Tandoor",
    "title_bn": "তন্দুর ছাড়াই দোকানের মতো নরম তুলতুলে আলু কুলচা",
    "image": "https://i.ytimg.com/vi/HXf_c5es2eU/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=HXf_c5es2eU",
    "youtube_id": "HXf_c5es2eU",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Medium",
    "prep_time": 45,
    "cook_time": 20,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:33.485Z",
    "updatedAt": "2026-01-06T01:34:33.485Z",
    "blogContent": {
      "id": 9,
      "recipe_id": 9,
      "intro_en": "Craving authentic Amritsari Aloo Kulcha but don't have a tandoor at home? This unique recipe uses steam and a simple frying pan to create incredibly soft and fluffy stuffed bread that rivals any restaurant.",
      "intro_bn": "অমৃতসরি আলু কুলচা খেতে ইচ্ছে করছে কিন্তু বাড়িতে তন্দুর নেই? এই বিশেষ রেসিপিতে ফ্রাইং প্যান এবং জলের ভাপ ব্যবহার করে তৈরি করুন দোকানের মতো নরম তুলতুলে আলুর পুরভরা কুলচা।",
      "what_makes_it_special_en": "The secret lies in the 'water-steam' method which mimics the humid heat of a clay oven. Combined with an instant fermentation using yogurt and baking leaveners, the dough becomes airy and light.",
      "what_makes_it_special_bn": "এর বিশেষত্ব হলো রান্নায় জলের ছিটা দিয়ে ভাপ তৈরি করা, যা মাটির তন্দুরের আর্দ্র তাপের কাজ করে। দই ও বেকিং পাউডারের ব্যবহারে ডো-টি খুব দ্রুত ফুলে ওঠে এবং নরম হয়।",
      "cooking_tips_en": "Do not add too much oil to the dough as it will make the kulcha crispy/flaky like a paratha instead of soft like a kulcha. Always use an iron or thick-bottomed pan.",
      "cooking_tips_bn": "ডো তৈরির সময় বেশি তেল দেবেন না, কারণ এতে কুলচা নরম হওয়ার বদলে পরোটার মতো খাস্তা হয়ে যাবে। সবসময় লোহা বা ভারী তলার প্যান ব্যবহার করার চেষ্টা করুন।",
      "serving_en": "Serve hot with a dollop of butter, alongside spicy chole (chickpeas), raita, or a fresh onion salad.",
      "serving_bn": "ওপরে এক টুকরো মাখন দিয়ে গরম গরম ছোলে মাসালা, রায়তা অথবা পেঁয়াজের সালাদের সাথে পরিবেশন করুন।",
      "storage_en": "Wrap in aluminum foil or a clean kitchen towel to keep them soft for several hours. Reheat on a tawa with a little butter.",
      "storage_bn": "অ্যালুমিনিয়াম ফয়েল বা পরিষ্কার তোয়ালেতে মুড়িয়ে রাখলে কয়েক ঘণ্টা পর্যন্ত নরম থাকবে। খাওয়ার আগে সামান্য মাখন দিয়ে চাটুতে গরম করে নিন।",
      "full_blog_en": "Making Aloo Kulcha at home often feels intimidating because we lack the high-heat tandoor used in restaurants. However, professional chef Atanu shows us a brilliant workaround using a standard kitchen frying pan. By adding a small amount of water to the hot pan and covering it instantly, we create a steam-chamber that allows the dough to rise perfectly without drying out. The dough itself is a mix of maida, yogurt, and a touch of sugar, kneaded until soft and gluten-rich. For the filling, boiled potatoes are mixed with aromatic Indian spices like roasted cumin and black salt. This method ensures that the crust stays soft while the inside remains moist and flavorful. It's a healthier alternative as it requires very little oil during the initial cooking phase. Try this for your next weekend brunch and impress your family with professional results!",
      "full_blog_bn": "বাড়িতে আলু কুলচা বানানো অনেকের কাছেই কঠিন মনে হয় কারণ আমাদের কাছে রেস্টুরেন্টের মতো তন্দুর থাকে না। কিন্তু শেফ অতনু আমাদের শিখিয়েছেন সাধারণ ফ্রাইং প্যানে কীভাবে দারুণ কুলচা বানানো যায়। গরম প্যানে সামান্য জল দিয়ে সাথে সাথে ঢেকে দিলে যে বাষ্প তৈরি হয়, তা কুলচাকে শুকিয়ে যেতে না দিয়ে সুন্দরভাবে ফুলিয়ে তোলে। ময়দা, দই ও সামান্য চিনির মিশ্রণে তৈরি এই ডো খুব নরম হয়। পুরের জন্য সেদ্ধ আলুর সাথে ভাজা জিরে ও বিট নুনের মতো সুগন্ধি মশলা মেশানো হয় যা স্বাদ বহুগুণ বাড়িয়ে দেয়। এই পদ্ধতিতে রান্না করলে কুলচার বাইরের অংশ নরম থাকে এবং ভেতরটা হয় অত্যন্ত সুস্বাদু। এটি স্বাস্থ্যকরও বটে কারণ প্রথম পর্যায়ে খুব কম তেলের প্রয়োজন হয়। আগামী ছুটির দিনে এটি অবশ্যই ট্রাই করুন!"
    },
    "ingredients": [
      {
        "id": 78,
        "recipe_id": 9,
        "ingredient_id": 46,
        "quantity": "500",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "sifted",
        "notes_bn": "চেলে নেওয়া",
        "ingredient": {
          "id": 46,
          "name_en": "Ghee",
          "name_bn": "ঘি",
          "img": "https://images.unsplash.com/photo-1627308595229-7830a5ca91f3?auto=format&fit=crop&w=600&q=80",
          "phonetic": [
            "ghee",
            "ghi"
          ],
          "createdAt": "2026-01-06T01:34:34.249Z",
          "updatedAt": "2026-01-06T01:34:34.249Z"
        }
      },
      {
        "id": 79,
        "recipe_id": 9,
        "ingredient_id": 7,
        "quantity": "150",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "whisked, for instant fermentation",
        "notes_bn": "ফেটানো, ইন্সট্যান্ট ফার্মেন্টেশনের জন্য",
        "ingredient": {
          "id": 7,
          "name_en": "Green Chili",
          "name_bn": "কাঁচা মরিচ",
          "img": "https://www.themealdb.com/images/ingredients/Green%20Chili.png",
          "phonetic": [
            "kacha morich",
            "kachka morich",
            "morich"
          ],
          "createdAt": "2026-01-06T01:34:16.949Z",
          "updatedAt": "2026-01-06T01:34:16.949Z"
        }
      },
      {
        "id": 80,
        "recipe_id": 9,
        "ingredient_id": 14,
        "quantity": "2",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "boiled and grated",
        "notes_bn": "সেদ্ধ করা এবং গ্রেট করা",
        "ingredient": {
          "id": 14,
          "name_en": "Soy Sauce",
          "name_bn": "সয়া সস",
          "img": "https://www.themealdb.com/images/ingredients/Soy%20Sauce.png",
          "phonetic": [
            "soy sauce",
            "soy saauce",
            "sooy sauce",
            "soy saucee"
          ],
          "createdAt": "2026-01-06T01:34:19.175Z",
          "updatedAt": "2026-01-06T01:34:19.175Z"
        }
      },
      {
        "id": 81,
        "recipe_id": 9,
        "ingredient_id": 10,
        "quantity": "1",
        "unit_en": "piece",
        "unit_bn": "টি",
        "notes_en": "finely chopped",
        "notes_bn": "মিহি কুচি করা",
        "ingredient": {
          "id": 10,
          "name_en": "Rice",
          "name_bn": "চাল",
          "img": "https://www.themealdb.com/images/ingredients/Rice.png",
          "phonetic": [
            "chal",
            "chaal",
            "bhat"
          ],
          "createdAt": "2026-01-06T01:34:17.472Z",
          "updatedAt": "2026-01-06T01:34:17.472Z"
        }
      },
      {
        "id": 82,
        "recipe_id": 9,
        "ingredient_id": 47,
        "quantity": "1/2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "helps in fluffiness",
        "notes_bn": "ফুলকো হতে সাহায্য করে",
        "ingredient": {
          "id": 47,
          "name_en": "Fish Sauce",
          "name_bn": "ফিশ সস",
          "img": "https://www.themealdb.com/images/ingredients/Fish%20Sauce.png",
          "phonetic": [
            "fish sauce",
            "fish saauce",
            "fish saucee",
            "feesh sauce"
          ],
          "createdAt": "2026-01-06T01:34:34.786Z",
          "updatedAt": "2026-01-06T01:34:34.786Z"
        }
      },
      {
        "id": 83,
        "recipe_id": 9,
        "ingredient_id": 48,
        "quantity": "1.5",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "aids fermentation",
        "notes_bn": "ফার্মেন্টেশনে সাহায্য করে",
        "ingredient": {
          "id": 48,
          "name_en": "Sesame Oil",
          "name_bn": "তিল তেল",
          "img": "/ingredients/61_sesame_oil.png",
          "phonetic": [
            "sesame oil",
            "sesaame oil",
            "sesame ooil",
            "seesamee oil"
          ],
          "createdAt": "2026-01-06T01:34:34.968Z",
          "updatedAt": "2026-01-06T01:34:34.968Z"
        }
      },
      {
        "id": 84,
        "recipe_id": 9,
        "ingredient_id": 49,
        "quantity": "2",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "for frying and brushing",
        "notes_bn": "ভাজা এবং ব্রাশ করার জন্য",
        "ingredient": {
          "id": 49,
          "name_en": "Black Pepper",
          "name_bn": "গোল মরিচ",
          "img": "https://www.themealdb.com/images/ingredients/Black%20Pepper.png",
          "phonetic": [
            "gol morich",
            "golmorich",
            "kali mirch"
          ],
          "createdAt": "2026-01-06T01:34:35.149Z",
          "updatedAt": "2026-01-06T01:34:35.149Z"
        }
      },
      {
        "id": 85,
        "recipe_id": 9,
        "ingredient_id": 17,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "finely chopped or paste",
        "notes_bn": "মিহি কুচি বা বাটা",
        "ingredient": {
          "id": 17,
          "name_en": "Coriander",
          "name_bn": "ধনেপাতা",
          "img": "https://www.themealdb.com/images/ingredients/Coriander.png",
          "phonetic": [
            "dhoniya",
            "dhonea",
            "dhania"
          ],
          "createdAt": "2026-01-06T01:34:19.802Z",
          "updatedAt": "2026-01-06T01:34:19.802Z"
        }
      },
      {
        "id": 86,
        "recipe_id": 9,
        "ingredient_id": 3,
        "quantity": "2",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 3,
          "name_en": "Egg",
          "name_bn": "ডিম",
          "img": "https://www.themealdb.com/images/ingredients/Egg.png",
          "phonetic": [
            "dim",
            "deem",
            "anda"
          ],
          "createdAt": "2026-01-06T01:34:16.250Z",
          "updatedAt": "2026-01-06T01:34:16.250Z"
        }
      },
      {
        "id": 87,
        "recipe_id": 9,
        "ingredient_id": 50,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "black and white, for topping",
        "notes_bn": "সাদা ও কালো তিল, ওপরে দেওয়ার জন্য",
        "ingredient": {
          "id": 50,
          "name_en": "Cloves",
          "name_bn": "লবঙ্গ",
          "img": "https://www.themealdb.com/images/ingredients/Cloves.png",
          "phonetic": [
            "lalbog",
            "labong",
            "lobongo"
          ],
          "createdAt": "2026-01-06T01:34:35.568Z",
          "updatedAt": "2026-01-06T01:34:35.568Z"
        }
      }
    ],
    "steps": [
      {
        "id": 66,
        "recipe_id": 9,
        "step_number": 1,
        "instruction_en": "Mix flour, salt, and powdered sugar. Create a well in the center and add whisked yogurt, baking soda, and baking powder. Let it rest for 2-3 minutes until bubbly.",
        "instruction_bn": "ময়দা, নুন ও গুঁড়ো চিনি মিশিয়ে মাঝখানে গর্ত করে ফেটানো টক দই, বেকিং সোডা ও বেকিং পাউডার দিন। বুদবুদ ওঠা পর্যন্ত ২-৩ মিনিট রেখে দিন।",
        "timestamp": "0:01:23"
      },
      {
        "id": 67,
        "recipe_id": 9,
        "step_number": 2,
        "instruction_en": "Add 1 tsp oil and knead with warm water for 7-8 minutes to form a soft, sticky dough. Rest for 30-40 minutes covered with a damp cloth or cling wrap.",
        "instruction_bn": "১ চামচ তেল দিন এবং কুসুম গরম জল দিয়ে ৭-৮ মিনিট ঠেসে একটি নরম ডো তৈরি করুন। ভিজে কাপড় বা প্লাস্টিক র‍্যাপ দিয়ে ৩০-৪০ মিনিট ঢেকে রাখুন।",
        "timestamp": "0:03:03"
      },
      {
        "id": 68,
        "recipe_id": 9,
        "step_number": 3,
        "instruction_en": "For stuffing: Grate boiled potatoes and mix with chopped onion, ginger, green chilies, coriander, roasted cumin powder, black salt, and chili powder.",
        "instruction_bn": "পুরের জন্য: সেদ্ধ আলু গ্রেট করে তাতে পেঁয়াজ কুচি, আদা, কাঁচা লঙ্কা, ধনেপাতা, ভাজা জিরে গুঁড়ো, বিট নুন ও লঙ্কার গুঁড়ো মিশিয়ে নিন।",
        "timestamp": "0:04:18"
      },
      {
        "id": 69,
        "recipe_id": 9,
        "step_number": 4,
        "instruction_en": "Divide the rested dough into medium-sized balls. Let the balls rest for another 1-2 minutes under a damp cloth.",
        "instruction_bn": "রেস্ট দেওয়া ডো থেকে মাঝারি মাপের লেচি কেটে নিন। লেচিগুলোকে ভিজে কাপড়ের নিচে আরও ১-২ মিনিট রেস্ট দিন।",
        "timestamp": "0:05:43"
      },
      {
        "id": 70,
        "recipe_id": 9,
        "step_number": 5,
        "instruction_en": "Flatten a ball into a bowl shape, fill with potato stuffing, and seal the edges tightly. Gently roll into an oval shape using dry flour.",
        "instruction_bn": "একটি লেচি হাতের সাহায্যে বাটির মতো করে তাতে আলুর পুর দিন এবং মুখ ভালো করে বন্ধ করুন। শুকনো ময়দা দিয়ে হালকাভাবে লম্বাটে করে বেলে নিন।",
        "timestamp": "0:06:13"
      },
      {
        "id": 71,
        "recipe_id": 9,
        "step_number": 6,
        "instruction_en": "Sprinkle sesame seeds and coriander on top. Press lightly with a rolling pin so they stick.",
        "instruction_bn": "ওপরে তিল ও ধনেপাতা কুচি ছিটিয়ে দিন। বেলুন দিয়ে হালকা চাপ দিন যাতে এগুলো আটকে যায়।",
        "timestamp": "0:06:45"
      },
      {
        "id": 72,
        "recipe_id": 9,
        "step_number": 7,
        "instruction_en": "Heat a frying pan. Add a splash of water, place the kulcha, and cover immediately to cook with steam. Cook for 2.5 minutes until puffed.",
        "instruction_bn": "ফ্রাইং প্যান গরম করে সামান্য জলের ছিটা দিন এবং কুলচা দিয়ে সাথে সাথে ঢেকে দিন যাতে ভাপে সেদ্ধ হয়। ফুলে ওঠা পর্যন্ত ২.৫ মিনিট রান্না করুন।",
        "timestamp": "0:07:15"
      },
      {
        "id": 73,
        "recipe_id": 9,
        "step_number": 8,
        "instruction_en": "Flip the kulcha, apply ghee or butter on both sides, and fry until golden brown spots appear and it becomes fluffy.",
        "instruction_bn": "কুলচা উল্টে দুই পিঠে ঘি বা মাখন লাগিয়ে সোনালী দাগ পড়া পর্যন্ত এবং পুরোপুরি ফুলে ওঠা পর্যন্ত ভাজুন।",
        "timestamp": "0:07:54"
      }
    ]
  },
  {
    "id": 10,
    "slug": "gobi-paratha-bengali-style",
    "title_en": "Authentic Gobi Paratha (Cauliflower Stuffed Flatbread)",
    "title_bn": "সেরা স্বাদের ফুলকপির পরোটা",
    "image": "https://i.ytimg.com/vi/JuKkjEAQlUk/maxresdefault.jpg",
    "youtube_url": "[https://www.youtube.com/watch?v=JuKkjEAQlUk](https://www.youtube.com/watch?v=JuKkjEAQlUk)",
    "youtube_id": "JuKkjEAQlUk",
    "cuisine": "Indian",
    "category": "Breakfast",
    "foodCategory": "Savory",
    "difficulty": "Medium",
    "prep_time": 25,
    "cook_time": 20,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:35.760Z",
    "updatedAt": "2026-01-06T01:34:35.760Z",
    "blogContent": {
      "id": 10,
      "recipe_id": 10,
      "intro_en": "Winter is incomplete without the warmth of freshly made Gobi Parathas. This recipe ensures a crispy exterior and a flavorful, non-soggy stuffing that will make you crave more.",
      "intro_bn": "শীতের সকাল মানেই গরম গরম ফুলকপির পরোটা। এই রেসিপিটি অনুসরণ করলে পরোটা হবে মুচমুচে আর ভেতরের পুর হবে একদম ঝরঝরে ও সুস্বাদু।",
      "what_makes_it_special_en": "The secret lies in using the salted cauliflower water to knead the dough, ensuring the flavor is infused in every bite, and squeezing the moisture out to prevent tearing.",
      "what_makes_it_special_bn": "এই রেসিপির বিশেষত্ব হলো ফুলকপির চিপে রাখা জল দিয়ে আটা মাখা, যা পরোটার স্বাদে এক নতুন মাত্রা যোগ করে।",
      "cooking_tips_en": "Always cook the stuffing on high heat and cool it completely before filling. Knead the dough very softly to ensure the parathas don't burst while rolling.",
      "cooking_tips_bn": "পুরটি সবসময় উচ্চ আঁচে রান্না করবেন এবং ঠান্ডা করে ব্যবহার করবেন। আটা খুব নরম করে মাখলে বেলার সময় পরোটা ফেটে যাবে না।",
      "serving_en": "Serve hot with a dollop of white butter, thick yogurt, and a spicy pickle for the ultimate breakfast experience.",
      "serving_bn": "ওপরে মাখন দিয়ে দই এবং আচারের সাথে গরম গরম পরিবেশন করুন দারুণ স্বাদের এই পরোটা।",
      "storage_en": "Best enjoyed fresh, but can be kept in an insulated container for a few hours. Reheat on a dry pan if needed.",
      "storage_bn": "তাজা অবস্থায় খাওয়া সবচেয়ে ভালো, তবে হটপটে রাখলে কয়েক ঘণ্টা নরম থাকে। প্রয়োজনে শুকনো তাওয়ায় গরম করে নিন।",
      "full_blog_en": "Gobi Paratha is a beloved classic, but many struggle with the stuffing becoming watery and breaking the dough. Chef Atanu shares a masterclass on how to fix this by salting the cauliflower first to draw out moisture. This not only makes the stuffing easy to handle but also provides a flavored liquid to knead the dough with, maximizing the cauliflower essence. By sautéing the ginger and chilies, the aromatics elevate the simple vegetable to a gourmet level. The technique of rolling involves keeping the edges thin and the center slightly thick to hold the spices. Frying with ghee until it puffs up like a balloon ensures that restaurant-quality texture right in your kitchen. Perfect for a cozy weekend brunch or a hearty winter lunch.",
      "full_blog_bn": "ফুলকপির পরোটা অনেকেরই পছন্দের, তবে অনেকের অভিযোগ থাকে যে পুর জলজলে হয়ে পরোটা ফেটে যায়। অতনু রান্নাঘরের এই রেসিপিতে দেখানো হয়েছে কীভাবে প্রথমে নুন মাখিয়ে জল ঝরিয়ে নিলে পুর হবে একদম ঝরঝরে। সেই জল ফেলবেন না, আটা মাখলে স্বাদ হবে অতুলনীয়। স্টাফিং তৈরির সময় আদা ও কাঁচা লঙ্কার সঠিক ব্যবহার এর সুগন্ধ বহুগুণ বাড়িয়ে দেয়। পরোটা বেলার সময় চারপাশ পাতলা রাখা এবং মাঝখানে পুর রেখে সিল করাটা জরুরি। ঘি দিয়ে ভাজার সময় প্রতিটি পরোটা যখন লুচির মতো ফুলে উঠবে, তখনই বুঝবেন আপনার রান্না সার্থক। দই, আচার কিংবা শুধু মাখন দিয়ে এই পরোটা আপনার শীতের সকালকে আনন্দদায়ক করে তুলবে।"
    },
    "ingredients": [
      {
        "id": 88,
        "recipe_id": 10,
        "ingredient_id": 15,
        "quantity": "1",
        "unit_en": "medium",
        "unit_bn": "মাঝারি",
        "notes_en": "grated, florets only",
        "notes_bn": "গ্রেট করা, শুধু ফুলগুলো",
        "ingredient": {
          "id": 15,
          "name_en": "Olive Oil",
          "name_bn": "অলিভ অয়েল",
          "img": "https://www.themealdb.com/images/ingredients/Olive%20Oil.png",
          "phonetic": [
            "olive oil",
            "oolive ooil",
            "olivee oil",
            "oleeve oeel"
          ],
          "createdAt": "2026-01-06T01:34:19.345Z",
          "updatedAt": "2026-01-06T01:34:19.345Z"
        }
      },
      {
        "id": 89,
        "recipe_id": 10,
        "ingredient_id": 51,
        "quantity": "300",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "extra for dusting if needed",
        "notes_bn": "মাখার জন্য",
        "ingredient": {
          "id": 51,
          "name_en": "Basmati Rice",
          "name_bn": "বাসমতি চাল",
          "img": "https://www.themealdb.com/images/ingredients/Basmati%20Rice.png",
          "phonetic": [
            "basmati rice",
            "baasmaati rice",
            "basmati ricee",
            "basmatee reece"
          ],
          "createdAt": "2026-01-06T01:34:36.537Z",
          "updatedAt": "2026-01-06T01:34:36.537Z"
        }
      },
      {
        "id": 90,
        "recipe_id": 10,
        "ingredient_id": 11,
        "quantity": "3",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "for dough and frying",
        "notes_bn": "ময়ান ও ভাজার জন্য",
        "ingredient": {
          "id": 11,
          "name_en": "Flour",
          "name_bn": "ময়দা",
          "img": "https://www.themealdb.com/images/ingredients/Flour.png",
          "phonetic": [
            "atta",
            "moida",
            "maida"
          ],
          "createdAt": "2026-01-06T01:34:17.646Z",
          "updatedAt": "2026-01-06T01:34:17.646Z"
        }
      },
      {
        "id": 91,
        "recipe_id": 10,
        "ingredient_id": 20,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for tempering",
        "notes_bn": "ফোড়নের জন্য",
        "ingredient": {
          "id": 20,
          "name_en": "Cardamom",
          "name_bn": "এলাচ",
          "img": "https://www.themealdb.com/images/ingredients/Cardamom.png",
          "phonetic": [
            "elach",
            "elaach",
            "elaichi"
          ],
          "createdAt": "2026-01-06T01:34:20.321Z",
          "updatedAt": "2026-01-06T01:34:20.321Z"
        }
      },
      {
        "id": 92,
        "recipe_id": 10,
        "ingredient_id": 17,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "finely chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 17,
          "name_en": "Coriander",
          "name_bn": "ধনেপাতা",
          "img": "https://www.themealdb.com/images/ingredients/Coriander.png",
          "phonetic": [
            "dhoniya",
            "dhonea",
            "dhania"
          ],
          "createdAt": "2026-01-06T01:34:19.802Z",
          "updatedAt": "2026-01-06T01:34:19.802Z"
        }
      },
      {
        "id": 93,
        "recipe_id": 10,
        "ingredient_id": 3,
        "quantity": "3",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "chopped, adjust to taste",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 3,
          "name_en": "Egg",
          "name_bn": "ডিম",
          "img": "https://www.themealdb.com/images/ingredients/Egg.png",
          "phonetic": [
            "dim",
            "deem",
            "anda"
          ],
          "createdAt": "2026-01-06T01:34:16.250Z",
          "updatedAt": "2026-01-06T01:34:16.250Z"
        }
      },
      {
        "id": 94,
        "recipe_id": 10,
        "ingredient_id": 5,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for color",
        "notes_bn": "রঙের জন্য",
        "ingredient": {
          "id": 5,
          "name_en": "Garlic",
          "name_bn": "রসুন",
          "img": "https://www.themealdb.com/images/ingredients/Garlic.png",
          "phonetic": [
            "rosun",
            "roshun",
            "rasun"
          ],
          "createdAt": "2026-01-06T01:34:16.608Z",
          "updatedAt": "2026-01-06T01:34:16.608Z"
        }
      },
      {
        "id": 95,
        "recipe_id": 10,
        "ingredient_id": 52,
        "quantity": "1/2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "final seasoning",
        "notes_bn": "শেষে ছড়ানোর জন্য",
        "ingredient": {
          "id": 52,
          "name_en": "Brown Rice",
          "name_bn": "লাল চাল",
          "img": "https://www.themealdb.com/images/ingredients/Brown%20Rice.png",
          "phonetic": [
            "brown rice",
            "broown rice",
            "brown ricee",
            "brown reece"
          ],
          "createdAt": "2026-01-06T01:34:37.305Z",
          "updatedAt": "2026-01-06T01:34:37.305Z"
        }
      },
      {
        "id": 96,
        "recipe_id": 10,
        "ingredient_id": 4,
        "quantity": "1/2",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "freshly chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 4,
          "name_en": "Onion",
          "name_bn": "পেঁয়াজ",
          "img": "https://www.themealdb.com/images/ingredients/Onion.png",
          "phonetic": [
            "piaz",
            "piyaz",
            "peaj",
            "peyaj"
          ],
          "createdAt": "2026-01-06T01:34:16.425Z",
          "updatedAt": "2026-01-06T01:34:16.425Z"
        }
      }
    ],
    "steps": [
      {
        "id": 74,
        "recipe_id": 10,
        "step_number": 1,
        "instruction_en": "Grate the cauliflower florets. Mix with salt and let sit for 5-7 minutes. Squeeze out all the excess water and reserve the liquid.",
        "instruction_bn": "ফুলকপি গ্রেট করে তাতে নুন মাখিয়ে ৫-৭ মিনিট রেখে দিন। তারপর চিপে সব জল বের করে নিন এবং জলটি আলাদা করে রাখুন।",
        "timestamp": "0:02:02"
      },
      {
        "id": 75,
        "recipe_id": 10,
        "step_number": 2,
        "instruction_en": "Knead the wheat flour using the reserved cauliflower water, a teaspoon of ghee, and additional water as needed to form a soft, smooth dough. Coat with oil and rest for 7 minutes.",
        "instruction_bn": "3:04",
        "timestamp": "0:03:04"
      },
      {
        "id": 76,
        "recipe_id": 10,
        "step_number": 3,
        "instruction_en": "For the stuffing, sauté cumin seeds, chopped ginger, and green chilies in oil. Add turmeric and the grated cauliflower. Cook on high heat to prevent moisture release.",
        "instruction_bn": "পুর তৈরির জন্য তেলে জিরে, আদা কুচি ও কাঁচা লঙ্কা ফোঁড়ন দিন। হলুদ ও গ্রেট করা ফুলকপি দিয়ে উচ্চ আঁচে রান্না করুন যাতে জল না বের হয়।",
        "timestamp": "0:05:54"
      },
      {
        "id": 77,
        "recipe_id": 10,
        "step_number": 4,
        "instruction_en": "Finish the stuffing with garam masala and fresh coriander leaves. Let it cool completely before stuffing.",
        "instruction_bn": "শেষে গরম মশলা ও ধনেপাতা কুচি মিশিয়ে নিন। পুরটি পুরোপুরি ঠান্ডা হতে দিন।",
        "timestamp": "0:07:24"
      },
      {
        "id": 78,
        "recipe_id": 10,
        "step_number": 5,
        "instruction_en": "Divide the dough into large balls. Flatten the edges, place a generous portion of stuffing in the center, seal properly, and roll out into parathas.",
        "instruction_bn": "লেচি কেটে নিয়ে চারপাশ পাতলা করে মাঝখানে পর্যাপ্ত পুর দিন। মুখ বন্ধ করে আলতো হাতে পরোটা বেলে নিন।",
        "timestamp": "0:07:47"
      },
      {
        "id": 79,
        "recipe_id": 10,
        "step_number": 6,
        "instruction_en": "Cook on a hot tawa, flipping until brown spots appear on both sides. Apply ghee and fry until golden and puffed.",
        "instruction_bn": "গরম তাওয়ায় দুপিঠ হালকা করে শেকে নিন। এরপর ঘি দিয়ে লালচে করে এবং ফুলিয়ে ভেজে নিন।",
        "timestamp": "0:09:26"
      }
    ]
  },
  {
    "id": 11,
    "slug": "frothy-beaten-instant-coffee-cappuccino",
    "title_en": "Frothy Beaten Instant Coffee (Cafe-Style Cappuccino)",
    "title_bn": "ফ্রদি বিটেন ইনস্ট্যান্ট কফি (ক্যাফে-স্টাইল ক্যাপুচিনো)",
    "image": "https://i.ytimg.com/vi/d1wa_1OdKpA/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=d1wa_1OdKpA",
    "youtube_id": "d1wa_1OdKpA",
    "cuisine": "Continental",
    "category": "Beverage",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 5,
    "cook_time": 5,
    "servings": 1,
    "createdAt": "2026-01-06T01:34:37.616Z",
    "updatedAt": "2026-01-06T01:34:37.616Z",
    "blogContent": {
      "id": 11,
      "recipe_id": 11,
      "intro_en": "Most people think instant coffee is just a weak, bitter substitute for the real thing, but the secret is all in the technique. This recipe shows you how to transform basic granules into a thick, frothy cappuccino using the 'beaten coffee' method.",
      "intro_bn": "অনেকেই মনে করেন ইনস্ট্যান্ট কফি মানেই তিতকুটে বা পানসে স্বাদ, কিন্তু আসল রহস্য লুকিয়ে আছে তৈরির কৌশলে। এই রেসিপিটি আপনাকে দেখাবে কীভাবে সাধারণ কফি দানা থেকে 'বিটেন কফি' পদ্ধতিতে ঘন ও ফেনাযুক্ত ক্যাপুচিনো তৈরি করা যায়।",
      "what_makes_it_special_en": "Unlike standard coffee where you just stir, this method uses aeration. By whipping a concentrated coffee paste, you create a stable micro-foam that gives the drink a luxurious mouthfeel similar to expensive espresso machines.",
      "what_makes_it_special_bn": "সাধারণ কফির মতো শুধু নেড়ে নেওয়ার বদলে এই পদ্ধতিতে বাতাস প্রবেশ করানো হয়। কফির একটি ঘন পেস্ট ফেটানোর মাধ্যমে একটি স্থায়ী মাইক্রো-ফেনা তৈরি হয় যা দামী এসপ্রেসো মেশিনের মতো চমৎকার স্বাদ দেয়।",
      "cooking_tips_en": "Crucial tip: Use a 6oz cup instead of 8oz to maintain flavor strength. Also, always dissolve your coffee crystals with a bit of room temperature water or tempered milk before adding boiling liquid to prevent a 'burnt' taste.",
      "cooking_tips_bn": "জরুরি টিপস: কফির কড়া স্বাদ বজায় রাখতে ৮ আউন্সের বদলে ৬ আউন্সের কাপ ব্যবহার করুন। এছাড়াও, কফি পুড়ে যাওয়ার স্বাদ এড়াতে সরাসরি ফুটন্ত পানি না দিয়ে প্রথমে সামান্য সাধারণ তাপমাত্রার পানি বা হালকা গরম দুধ দিয়ে কফি গুলে নিন।",
      "serving_en": "Serve immediately while the foam is stiff. For an extra touch of elegance, sprinkle a tiny bit of dry coffee powder or cocoa on the froth.",
      "serving_bn": "ফেনা ঘন থাকা অবস্থায় দ্রুত পরিবেশন করুন। বাড়তি সৌন্দর্যের জন্য উপরে সামান্য কফি পাউডার বা কোকো পাউডার ছিটিয়ে দিতে পারেন।",
      "storage_en": "The whipped coffee paste can be made in bulk and stored in the refrigerator for up to 2 days, making your morning routine even faster.",
      "storage_bn": "ফেটানো কফির পেস্টটি বেশি করে তৈরি করে ফ্রিজে ২ দিন পর্যন্ত রাখা যায়, যা আপনার সকালের কফি তৈরির সময় বাঁচাবে।",
      "full_blog_en": "Instant coffee is often misunderstood because of poor preparation habits. As shown by Ethan Rode, the key to a great cup starts with the measurements. Switching from an 8oz mug to a 6oz cup immediately improves the body of the coffee. Furthermore, pouring boiling water directly onto the coffee crystals is a common mistake that causes them to scorch, creating that unpleasant bitter taste we all want to avoid.\n\nThe 'Beaten Coffee' technique (referred to in the video as an Indian Cappuccino) is a game-changer for home baristas. By taking the time to vigorously mix coffee, sugar, and a splash of liquid, you create a chemical reaction that results in a thick, meringue-like foam. This foam doesn't just sit on top; it incorporates into the hot milk to create a creamy, unified beverage.\n\nTemperature control is the final piece of the puzzle. Using the microwave at 50% power ensures the milk is heated evenly without forming a skin or burning the sugars in the milk. Whether you are using a spoon or an electric frother, the result is a high-quality drink that costs pennies but tastes like a premium cafe order.",
      "full_blog_bn": "ভুল পদ্ধতিতে তৈরির কারণে ইনস্ট্যান্ট কফি নিয়ে অনেকের মাঝেই ভুল ধারণা থাকে। ইথান রোড দেখিয়েছেন যে, এক কাপ দারুণ কফি তৈরির মূল ভিত্তি হলো সঠিক মাপ। ৮ আউন্সের মগের বদলে ৬ আউন্সের কাপ ব্যবহার করলে কফির স্বাদ অনেক বেশি ভারসাম্যপূর্ণ হয়। এছাড়া সরাসরি কফি দানার ওপর ফুটন্ত পানি ঢালা একটি বড় ভুল, যার ফলে কফি পুড়ে যায় এবং অপ্রীতিকর তেতো স্বাদ তৈরি হয়।\n\n'বিটেন কফি' কৌশলটি (ভিডিওতে যাকে ইন্ডিয়ান ক্যাপুচিনো বলা হয়েছে) ঘরে কফি তৈরির ক্ষেত্রে এক বৈপ্লবিক পরিবর্তন। কফি, চিনি এবং সামান্য পানি খুব জোরে মিশিয়ে নিলে একটি ঘন ফেনা তৈরি হয়। এই ফেনাটি শুধু উপরেই থাকে না, বরং গরম দুধের সাথে মিশে একটি ক্রিমি স্বাদ তৈরি করে।\n\nতাপমাত্রা নিয়ন্ত্রণ করাও অত্যন্ত জরুরি। মাইক্রোওয়েভে কম পাওয়ারে দুধ গরম করলে এটি সমানভাবে গরম হয় এবং দুধের প্রাকৃতিক মিষ্টি ভাব বজায় থাকে। আপনি চামচ দিয়ে ফেটান বা ইলেকট্রিক ফ্রদার ব্যবহার করুন—ফলাফল হবে ক্যাফের মতো দামী স্বাদের কফি যা আপনি খুব সহজেই ঘরে তৈরি করতে পারবেন।"
    },
    "ingredients": [
      {
        "id": 97,
        "recipe_id": 11,
        "ingredient_id": 53,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "Use high-quality crystals for best results",
        "notes_bn": "ভালো ফলাফলের জন্য উন্নত মানের কফি ব্যবহার করুন",
        "ingredient": {
          "id": 53,
          "name_en": "Spaghetti",
          "name_bn": "স্প্যাগেটি",
          "img": "https://www.themealdb.com/images/ingredients/Spaghetti.png",
          "phonetic": [
            "spaghetti",
            "spaaghetti",
            "spagheetti",
            "spaghettee"
          ],
          "createdAt": "2026-01-06T01:34:38.210Z",
          "updatedAt": "2026-01-06T01:34:38.210Z"
        }
      },
      {
        "id": 98,
        "recipe_id": 11,
        "ingredient_id": 36,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "White granulated sugar works best for froth",
        "notes_bn": "ফেনার জন্য সাদা চিনি সবচেয়ে ভালো কাজ করে",
        "ingredient": {
          "id": 36,
          "name_en": "Bok Choy",
          "name_bn": "বক চয়",
          "img": "/ingredients/37_bok_choy.jpg",
          "phonetic": [
            "bok choy",
            "book chooy"
          ],
          "createdAt": "2026-01-06T01:34:27.029Z",
          "updatedAt": "2026-01-06T01:34:27.029Z"
        }
      },
      {
        "id": 99,
        "recipe_id": 11,
        "ingredient_id": 34,
        "quantity": "6",
        "unit_en": "oz",
        "unit_bn": "আউন্স",
        "notes_en": "Whole milk creates a creamier texture",
        "notes_bn": "ফুল ক্রিম দুধ ব্যবহার করলে কফি বেশি ক্রিমি হবে",
        "ingredient": {
          "id": 34,
          "name_en": "Soy Milk",
          "name_bn": "সয়া দুধ",
          "img": "/ingredients/35_soy_milk.jpg",
          "phonetic": [
            "soy milk",
            "sooy milk",
            "soy meelk"
          ],
          "createdAt": "2026-01-06T01:34:26.646Z",
          "updatedAt": "2026-01-06T01:34:26.646Z"
        }
      },
      {
        "id": 100,
        "recipe_id": 11,
        "ingredient_id": 54,
        "quantity": "1",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "Room temperature to dissolve crystals",
        "notes_bn": "কফি দানা গোলানোর জন্য সাধারণ তাপমাত্রার পানি",
        "ingredient": {
          "id": 54,
          "name_en": "Baking Powder",
          "name_bn": "বেকিং পাউডার",
          "img": "https://www.themealdb.com/images/ingredients/Baking%20Powder.png",
          "phonetic": [
            "baking powder",
            "baaking powder",
            "baking poowder",
            "baking powdeer"
          ],
          "createdAt": "2026-01-06T01:34:38.651Z",
          "updatedAt": "2026-01-06T01:34:38.651Z"
        }
      }
    ],
    "steps": [
      {
        "id": 80,
        "recipe_id": 11,
        "step_number": 1,
        "instruction_en": "Measure exactly 6 ounces of milk. Heat it in the microwave for 1 minute at 50% power to get it hot without scorching the top.",
        "instruction_bn": "ঠিক ৬ আউন্স দুধ মেপে নিন। মাইক্রোওয়েভে ৫০% পাওয়ারে ১ মিনিট গরম করুন যাতে দুধের ওপরের অংশ পুড়ে না যায়।",
        "timestamp": "2:07"
      },
      {
        "id": 81,
        "recipe_id": 11,
        "step_number": 2,
        "instruction_en": "In your serving cup, add 1 teaspoon of instant coffee and 1 teaspoon of sugar.",
        "instruction_bn": "আপনার পরিবেশন কাপে ১ চা চামচ ইনস্ট্যান্ট কফি এবং ১ চা চামচ চিনি নিন।",
        "timestamp": "2:00"
      },
      {
        "id": 82,
        "recipe_id": 11,
        "step_number": 3,
        "instruction_en": "Add about 1 ounce of the heated milk (or room temperature water) to the coffee and sugar.",
        "instruction_bn": "কফি ও চিনির মিশ্রণে প্রায় ১ আউন্স গরম দুধ (অথবা সাধারণ তাপমাত্রার পানি) যোগ করুন।",
        "timestamp": "2:16"
      },
      {
        "id": 83,
        "recipe_id": 11,
        "step_number": 4,
        "instruction_en": "Mix aggressively with a spoon or an electric hand mixer until the mixture turns into a light, thick, and velvety foam.",
        "instruction_bn": "চামচ বা ইলেকট্রিক হ্যান্ড মিক্সার দিয়ে খুব জোরে ফেটাতে থাকুন যতক্ষণ না মিশ্রণটি হালকা রঙের ঘন ও মখমলের মতো ফেনায় পরিণত হয়।",
        "timestamp": "2:22"
      },
      {
        "id": 84,
        "recipe_id": 11,
        "step_number": 5,
        "instruction_en": "Pour the rest of the hot milk into the cup. The foam will naturally rise to the top for a perfect cappuccino finish.",
        "instruction_bn": "বাকি গরম দুধটুকু কাপে ঢেলে দিন। ফেনাটি আপনাআপনি ওপরে উঠে আসবে এবং চমৎকার একটি ক্যাপুচিনো তৈরি হবে।",
        "timestamp": "2:32"
      }
    ]
  },
  {
    "id": 12,
    "slug": "niramish-aloor-dum-bengali-style",
    "title_en": "Niramish Aloo'r Dum (Bengali Style)",
    "title_bn": "নিরামিষ আলুর দম",
    "image": "https://i.ytimg.com/vi/lgKT3avl8j0/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=lgKT3avl8j0",
    "youtube_id": "lgKT3avl8j0",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 20,
    "cook_time": 60,
    "servings": 6,
    "createdAt": "2026-01-06T01:34:38.877Z",
    "updatedAt": "2026-01-06T01:34:38.877Z",
    "blogContent": {
      "id": 12,
      "recipe_id": 12,
      "intro_en": "Niramish Aloo'r Dum is a quintessential Bengali comfort food, especially popular during festivals and as a side dish for Luchi or Kochuri. This version is prepared without onion and garlic, making it a perfect 'Bhog' style dish.",
      "intro_bn": "নিরামিষ আলুর দম একটি চিরাচরিত বাঙালি খাবার, যা লুচি বা কচুরির সাথে উৎসবের দিনগুলোতে বা পুজোর ভোগ হিসেবে অত্যন্ত জনপ্রিয়। পেঁয়াজ-রসুন ছাড়া তৈরি এই আলুর দম স্বাদে অতুলনীয়।",
      "what_makes_it_special_en": "What sets this recipe apart is the slow-cooking process and the specific use of 'Notun Alu' (new potatoes). The tangy amchur, creamy cashew powder, and aromatic ghee create a rich, multi-layered gravy without needing onion or garlic.",
      "what_makes_it_special_bn": "এই রেসিপির বিশেষত্ব হলো ধিমে আঁচে রান্না এবং নতুন ছোট আলুর ব্যবহার। আমচুর, কাজু বাদাম গুঁড়ো এবং ঘিয়ের সুগন্ধ পেঁয়াজ-রসুন ছাড়াই একটি ঘন ও সুস্বাদু গ্রেভি তৈরি করে।",
      "cooking_tips_en": "Boil the potatoes in highly salted water (brine method) to ensure they are seasoned to the core. Always peel them while hot to maintain the best texture. Use hot water for the gravy to keep the cooking process steady.",
      "cooking_tips_bn": "আলু সেদ্ধ করার সময় বেশি করে নুন দিন যাতে আলুর ভেতর পর্যন্ত নুন ঢোকে। টেক্সচার ঠিক রাখতে গরম থাকতেই খোসা ছাড়িয়ে নিন। রান্নায় সবসময় গরম জল ব্যবহার করুন।",
      "serving_en": "Serve steaming hot with Luchi, Koraishuti'r Kochuri, or even Bengali-style fried rice for a complete meal.",
      "serving_bn": "গরম গরম লুচি, কড়াইশুঁটির কচুরি অথবা বাসন্তী পোলাওয়ের সাথে পরিবেশন করুন।",
      "storage_en": "This curry tastes even better the next day. Store in an airtight container in the refrigerator for up to 2 days. Reheat gently with a splash of water.",
      "storage_bn": "এই তরকারি পরদিন আরও সুস্বাদু লাগে। এয়ারটাইট বক্সে ফ্রিজে ২ দিন পর্যন্ত রাখা যায়। সামান্য জল দিয়ে হালকা আঁচে গরম করে নিন।",
      "full_blog_en": "The beauty of Bengali vegetarian cuisine lies in its ability to create complex flavors from humble ingredients. This Niramish Aloo'r Dum is a testament to that tradition. By excluding onion and garlic, we allow the earthy flavor of the new baby potatoes and the pungency of mustard oil to shine. The spice base is a careful balance of coriander, cumin, and the heat of green chillies, rounded off with the creaminess of ground cashews. It's a dish that evokes nostalgia, reminding one of the 'Bhoj' (feasts) served during Durga Puja. Whether you're making it for a special occasion or a simple Sunday breakfast with Luchi, this recipe ensures a thick, coat-the-spoon gravy that is undeniably satisfying.",
      "full_blog_bn": "বাঙালি নিরামিষ রান্নার মাধুর্য হলো সাধারণ উপকরণ দিয়ে অসাধারণ স্বাদ তৈরি করা। এই পেঁয়াজ-রসুন ছাড়া নিরামিষ আলুর দম সেই ঐতিহ্যেরই বহিঃপ্রকাশ। নতুন ছোট আলুর সোঁদা গন্ধ এবং সরষের তেলের ঝাঁঝ এই রান্নার মূল প্রাণ। ধনে, জিরে এবং কাঁচা লঙ্কার ঝালের সাথে কাজু বাদাম গুঁড়োর মাখোমাখো ভাব এক অপূর্ব স্বাদ তৈরি করে। দুর্গাপূজার অষ্টমীর ভোগের আলুর দমের স্বাদ যেন ফিরে আসে এই রেসিপিতে। ছুটির সকালে বাড়ির তৈরি ধোঁয়া ওঠা লুচি বা কচুরির সাথে এই আলুর দম আপনার ভোজকে পূর্ণতা দেবে।"
    },
    "ingredients": [
      {
        "id": 101,
        "recipe_id": 12,
        "ingredient_id": 55,
        "quantity": "700",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "peeled",
        "notes_bn": "খোসা ছাড়ানো",
        "ingredient": {
          "id": 55,
          "name_en": "Bay Leaf",
          "name_bn": "তেজপাতা",
          "img": "https://www.themealdb.com/images/ingredients/Bay%20Leaf.png",
          "phonetic": [
            "tejpata",
            "tezpata",
            "tej-pata"
          ],
          "createdAt": "2026-01-06T01:34:39.718Z",
          "updatedAt": "2026-01-06T01:34:39.718Z"
        }
      },
      {
        "id": 102,
        "recipe_id": 12,
        "ingredient_id": 22,
        "quantity": "30",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "for authentic flavor",
        "notes_bn": "আসল স্বাদের জন্য",
        "ingredient": {
          "id": 22,
          "name_en": "Sugar",
          "name_bn": "চিনি",
          "img": "https://www.themealdb.com/images/ingredients/Sugar.png",
          "phonetic": [
            "chini",
            "cheeni",
            "chinee"
          ],
          "createdAt": "2026-01-06T01:34:20.659Z",
          "updatedAt": "2026-01-06T01:34:20.659Z"
        }
      },
      {
        "id": 103,
        "recipe_id": 12,
        "ingredient_id": 23,
        "quantity": "50",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "blanched",
        "notes_bn": "ভাপানো",
        "ingredient": {
          "id": 23,
          "name_en": "Butter",
          "name_bn": "মাখন",
          "img": "https://www.themealdb.com/images/ingredients/Butter.png",
          "phonetic": [
            "makhon",
            "makhan"
          ],
          "createdAt": "2026-01-06T01:34:22.164Z",
          "updatedAt": "2026-01-06T01:34:22.164Z"
        }
      },
      {
        "id": 104,
        "recipe_id": 12,
        "ingredient_id": 56,
        "quantity": "15",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "freshly ground",
        "notes_bn": "তাজা বাটা",
        "ingredient": {
          "id": 56,
          "name_en": "Fenugreek",
          "name_bn": "মেথি",
          "img": "https://www.themealdb.com/images/ingredients/Fenugreek.png",
          "phonetic": [
            "methi",
            "methee"
          ],
          "createdAt": "2026-01-06T01:34:40.129Z",
          "updatedAt": "2026-01-06T01:34:40.129Z"
        }
      },
      {
        "id": 105,
        "recipe_id": 12,
        "ingredient_id": 57,
        "quantity": "4",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "adjust to spice level",
        "notes_bn": "ঝাল অনুযায়ী ব্যবহার করুন",
        "ingredient": {
          "id": 57,
          "name_en": "Nigella Seed",
          "name_bn": "কালোজিরা",
          "img": "/ingredients/66_nigella_seed.jpg",
          "phonetic": [
            "nigella seed",
            "nigellaa seed",
            "nigeella seeeed",
            "neegella seed"
          ],
          "createdAt": "2026-01-06T01:34:40.300Z",
          "updatedAt": "2026-01-06T01:34:40.300Z"
        }
      },
      {
        "id": 106,
        "recipe_id": 12,
        "ingredient_id": 7,
        "quantity": "50",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "beaten until smooth",
        "notes_bn": "মসৃণ করে ফেটানো",
        "ingredient": {
          "id": 7,
          "name_en": "Green Chili",
          "name_bn": "কাঁচা মরিচ",
          "img": "https://www.themealdb.com/images/ingredients/Green%20Chili.png",
          "phonetic": [
            "kacha morich",
            "kachka morich",
            "morich"
          ],
          "createdAt": "2026-01-06T01:34:16.949Z",
          "updatedAt": "2026-01-06T01:34:16.949Z"
        }
      },
      {
        "id": 107,
        "recipe_id": 12,
        "ingredient_id": 32,
        "quantity": "20",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "ground into powder",
        "notes_bn": "গুঁড়ো করা",
        "ingredient": {
          "id": 32,
          "name_en": "Mutton",
          "name_bn": "খাসির মাংস",
          "img": "/ingredients/32_mutton.jpg",
          "phonetic": [
            "khashir mangsho",
            "khasi",
            "khasir mangso"
          ],
          "createdAt": "2026-01-06T01:34:25.933Z",
          "updatedAt": "2026-01-06T01:34:25.933Z"
        }
      },
      {
        "id": 108,
        "recipe_id": 12,
        "ingredient_id": 28,
        "quantity": "20",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "for balance",
        "notes_bn": "স্বাদের ভারসাম্যের জন্য",
        "ingredient": {
          "id": 28,
          "name_en": "Shrimp",
          "name_bn": "চিংড়ি",
          "img": "https://www.themealdb.com/images/ingredients/Shrimp.png",
          "phonetic": [
            "chingri",
            "choto chingri"
          ],
          "createdAt": "2026-01-06T01:34:23.976Z",
          "updatedAt": "2026-01-06T01:34:23.976Z"
        }
      },
      {
        "id": 109,
        "recipe_id": 12,
        "ingredient_id": 36,
        "quantity": "18",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "bengali curries are slightly sweet",
        "notes_bn": "বাঙালি তরকারি সামান্য মিষ্টি হয়",
        "ingredient": {
          "id": 36,
          "name_en": "Bok Choy",
          "name_bn": "বক চয়",
          "img": "/ingredients/37_bok_choy.jpg",
          "phonetic": [
            "bok choy",
            "book chooy"
          ],
          "createdAt": "2026-01-06T01:34:27.029Z",
          "updatedAt": "2026-01-06T01:34:27.029Z"
        }
      },
      {
        "id": 110,
        "recipe_id": 12,
        "ingredient_id": 11,
        "quantity": "10",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "finishing touch",
        "notes_bn": "রান্নার শেষে ব্যবহারের জন্য",
        "ingredient": {
          "id": 11,
          "name_en": "Flour",
          "name_bn": "ময়দা",
          "img": "https://www.themealdb.com/images/ingredients/Flour.png",
          "phonetic": [
            "atta",
            "moida",
            "maida"
          ],
          "createdAt": "2026-01-06T01:34:17.646Z",
          "updatedAt": "2026-01-06T01:34:17.646Z"
        }
      }
    ],
    "steps": [
      {
        "id": 87,
        "recipe_id": 12,
        "step_number": 3,
        "instruction_en": "Prepare a spice paste by mixing cumin powder, coriander powder, amchur, black salt, ginger paste, and water.",
        "instruction_bn": "জিরে গুঁড়ো, ধনে গুঁড়ো, আমচুর, বিট নুন, আদা বাটা এবং জল মিশিয়ে একটি মশলার পেস্ট তৈরি করুন।",
        "timestamp": "0:02:20"
      },
      {
        "id": 85,
        "recipe_id": 12,
        "step_number": 1,
        "instruction_en": "Boil 700g baby potatoes in 1 liter of water with 30g salt for about 30 minutes until fully tender.",
        "instruction_bn": "১ লিটার জলে ৩০ গ্রাম নুন দিয়ে ৭০০ গ্রাম ছোট আলু প্রায় ৩০ মিনিট সেদ্ধ করুন যতক্ষণ না নরম হয়।",
        "timestamp": "0:01:31"
      },
      {
        "id": 86,
        "recipe_id": 12,
        "step_number": 2,
        "instruction_en": "Peel the potatoes immediately while hot and toss them with an additional 10g of salt for better absorption.",
        "instruction_bn": "গরম থাকতেই আলুর খোসা ছাড়িয়ে নিন এবং আরও ১০ গ্রাম নুন দিয়ে ভালো করে মিশিয়ে নিন।",
        "timestamp": "0:02:00"
      },
      {
        "id": 88,
        "recipe_id": 12,
        "step_number": 4,
        "instruction_en": "Heat mustard oil in a pan. Temper with dried red chillies, bay leaves, cardamom, cinnamon, cloves, cumin seeds, and hing.",
        "instruction_bn": "কড়াইতে সরষের তেল গরম করুন। শুকনো লঙ্কা, তেজপাতা, এলাচ, দারুচিনি, লবঙ্গ, জিরে এবং হিং ফোড়ন দিন।",
        "timestamp": "0:02:34"
      },
      {
        "id": 89,
        "recipe_id": 12,
        "step_number": 5,
        "instruction_en": "Add turmeric and red chilli powder to the oil, then quickly pour in the prepared spice paste and sauté for 6 minutes.",
        "instruction_bn": "তেলে হলুদ এবং লঙ্কা গুঁড়ো দিন, তারপর দ্রুত তৈরি করা মশলার পেস্টটি দিয়ে ৬ মিনিট কষান।",
        "timestamp": "0:03:04"
      },
      {
        "id": 90,
        "recipe_id": 12,
        "step_number": 6,
        "instruction_en": "Stir in green chilli paste and beaten yoghurt on low heat vigorously to prevent splitting.",
        "instruction_bn": "আঁচ কমিয়ে কাঁচা লঙ্কা বাটা এবং ফেটানো টক দই দিয়ে দ্রুত নাড়তে থাকুন যাতে দই ফেটে না যায়।",
        "timestamp": "0:03:37"
      },
      {
        "id": 91,
        "recipe_id": 12,
        "step_number": 7,
        "instruction_en": "Add the boiled potatoes to the masala and sauté for 4 minutes to let the spices penetrate the potatoes.",
        "instruction_bn": "সেদ্ধ আলুগুলো মশলায় দিয়ে ৪ মিনিট কষিয়ে নিন যাতে মশলা আলুর ভেতরে ভালো করে ঢোকে।",
        "timestamp": "0:04:19"
      },
      {
        "id": 92,
        "recipe_id": 12,
        "step_number": 8,
        "instruction_en": "Add remaining sugar, salt, and 400g hot water. Sprinkle kasuri methi and simmer covered for 20 minutes.",
        "instruction_bn": "বাকি চিনি, নুন এবং ৪০০ গ্রাম গরম জল দিন। কসুরি মেথি ছড়িয়ে ঢাকা দিয়ে ২০ মিনিট অল্প আঁচে রান্না করুন।",
        "timestamp": "0:04:38"
      },
      {
        "id": 93,
        "recipe_id": 12,
        "step_number": 9,
        "instruction_en": "Finish by adding ground cashews, blanched peas, garam masala, and ghee. Let it rest for 2 minutes before serving.",
        "instruction_bn": "শেষে কাজু বাদাম গুঁড়ো, ভাপানো কড়াইশুঁটি, গরম মশলা এবং ঘি দিন। পরিবেশনের আগে ২ মিনিট ঢেকে রাখুন।",
        "timestamp": "0:05:26"
      }
    ]
  },
  {
    "id": 13,
    "slug": "restaurant-style-chicken-soup",
    "title_en": "Restaurant Style Chicken Soup",
    "title_bn": "রেস্টুরেন্ট স্টাইল চিকেন সুপ",
    "image": "https://i.ytimg.com/vi/2jC2nmDalIg/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=2jC2nmDalIg",
    "youtube_id": "2jC2nmDalIg",
    "cuisine": "Continental",
    "category": "Appetizer",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 15,
    "cook_time": 25,
    "servings": 2,
    "createdAt": "2026-01-06T01:34:41.087Z",
    "updatedAt": "2026-01-06T01:34:41.087Z",
    "blogContent": {
      "id": 13,
      "recipe_id": 13,
      "intro_en": "Warm your soul with this classic Restaurant Style Chicken Soup. It's healthy, comforting, and perfect for chilly evenings or when you're feeling under the weather.",
      "intro_bn": "রেস্টুরেন্ট স্টাইল চিকেন সুপের এই রেসিপিটি আপনার মন ও শরীর দুইই চনমনে করে তুলবে। এটি স্বাস্থ্যকর এবং যেকোনো ঠান্ডা সন্ধ্যায় বা অসুস্থতায় অত্যন্ত আরামদায়ক।",
      "what_makes_it_special_en": "This recipe balances the richness of butter with the freshness of vegetables and tender chicken, creating a velvety texture without heavy cream.",
      "what_makes_it_special_bn": "এই রেসিপিটিতে মাখনের স্বাদ, টাটকা সবজি এবং নরম চিকেনের পারফেক্ট ব্যালেন্স রয়েছে, যা কোনো ক্রিম ছাড়াই সুপটিকে ঘন ও সুস্বাদু করে তোলে।",
      "cooking_tips_en": "Do not boil the egg vigorously; a slow drizzle while stirring gently is key to getting those perfect restaurant-like egg ribbons.",
      "cooking_tips_bn": "ডিম দেওয়ার সময় খুব জোরে নাড়বেন না; ধীরে ধীরে ঢালুন এবং হালকা করে নাড়ুন যাতে রেস্টুরেন্টের মতো সুন্দর টেক্সচার পাওয়া যায়।",
      "serving_en": "Serve hot in deep bowls with a side of garlic bread or breadsticks. Add a dash of lemon juice for extra tang.",
      "serving_bn": "গরম গরম সুপ বোলে ঢেলে গার্লিক ব্রেড বা ব্রেডস্টিকের সাথে পরিবেশন করুন। বাড়তি স্বাদের জন্য সামান্য লেবুর রস মিশিয়ে নিতে পারেন।",
      "storage_en": "Best consumed fresh. If storing, keep in an airtight container in the fridge for up to 24 hours and reheat thoroughly.",
      "storage_bn": "টাটকা অবস্থায় খাওয়া সবচেয়ে ভালো। তবে সংরক্ষণ করতে চাইলে এয়ারটাইট পাত্রে ফ্রিজে ২৪ ঘণ্টা পর্যন্ত রাখতে পারেন এবং খাওয়ার আগে ভালো করে গরম করে নিন।",
      "full_blog_en": "Chicken soup is globally recognized as the ultimate comfort food. This specific version brings the professional restaurant-style experience into your home kitchen with simple ingredients. The process begins with aromatics like ginger and garlic sautéed in butter, which forms a deep flavor base. Using fresh carrots and beans adds a nice crunch and nutritional value. The secret to the silky consistency lies in the cornstarch slurry and the technique of adding the beaten egg. It’s a versatile dish that can be adjusted to your spice preference with more or less black pepper. Whether you are hosting a dinner or looking for a quick healthy meal, this chicken soup is a winner.",
      "full_blog_bn": "চিকেন সুপ সারাবিশ্বেই একটি জনপ্রিয় আরামদায়ক খাবার। এই রেসিপিটির মাধ্যমে আপনি খুব সাধারণ উপকরণ দিয়ে ঘরেই রেস্টুরেন্টের স্বাদ আনতে পারবেন। মাখনে আদা ও রসুন কুচি ভেজে নেওয়ার ফলে এতে একটি চমৎকার সুগন্ধ তৈরি হয়। টাটকা গাজর ও বিনস এর পুষ্টিগুণ ও স্বাদ বাড়িয়ে দেয়। সুপটিকে সিল্কি এবং ঘন করার রহস্য হলো কর্নফ্লাওয়ার এবং ডিম দেওয়ার সঠিক পদ্ধতি। এটি এমন একটি খাবার যা আপনি আপনার পছন্দমতো গোলমরিচ দিয়ে ঝাল কমিয়ে বা বাড়িয়ে নিতে পারেন। ডিনার হোক বা চটজলদি স্বাস্থ্যকর খাবার, এই চিকেন সুপ সব সময়ের জন্য সেরা।"
    },
    "ingredients": [
      {
        "id": 111,
        "recipe_id": 13,
        "ingredient_id": 1,
        "quantity": "250",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "boneless, cut into small cubes",
        "notes_bn": "হাড়ছাড়া, ছোট কিউব করে কাটা",
        "ingredient": {
          "id": 1,
          "name_en": "Chicken",
          "name_bn": "চিকেন",
          "img": "https://www.themealdb.com/images/ingredients/Chicken.png",
          "phonetic": [
            "murgi",
            "murgee",
            "murghi",
            "chicken"
          ],
          "createdAt": "2026-01-06T01:34:15.775Z",
          "updatedAt": "2026-01-06T01:34:15.775Z"
        }
      },
      {
        "id": 112,
        "recipe_id": 13,
        "ingredient_id": 58,
        "quantity": "1/2",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "finely chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 58,
          "name_en": "Yeast",
          "name_bn": "ইস্ট",
          "img": "https://www.themealdb.com/images/ingredients/Yeast.png",
          "phonetic": [
            "yeast",
            "yeaast",
            "yeeast"
          ],
          "createdAt": "2026-01-06T01:34:41.866Z",
          "updatedAt": "2026-01-06T01:34:41.866Z"
        }
      },
      {
        "id": 113,
        "recipe_id": 13,
        "ingredient_id": 59,
        "quantity": "1/4",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "finely chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 59,
          "name_en": "Vinegar",
          "name_bn": "ভিনেগার/সিরকা",
          "img": "https://www.themealdb.com/images/ingredients/Vinegar.png",
          "phonetic": [
            "sirka",
            "siraka"
          ],
          "createdAt": "2026-01-06T01:34:42.047Z",
          "updatedAt": "2026-01-06T01:34:42.047Z"
        }
      },
      {
        "id": 114,
        "recipe_id": 13,
        "ingredient_id": 18,
        "quantity": "1",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "finely chopped",
        "notes_bn": "মিহি কুচি",
        "ingredient": {
          "id": 18,
          "name_en": "Cumin",
          "name_bn": "জিরা",
          "img": "https://www.themealdb.com/images/ingredients/Cumin.png",
          "phonetic": [
            "jeera",
            "jira",
            "zira"
          ],
          "createdAt": "2026-01-06T01:34:19.973Z",
          "updatedAt": "2026-01-06T01:34:19.973Z"
        }
      },
      {
        "id": 115,
        "recipe_id": 13,
        "ingredient_id": 17,
        "quantity": "1/2",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "finely chopped",
        "notes_bn": "মিহি কুচি",
        "ingredient": {
          "id": 17,
          "name_en": "Coriander",
          "name_bn": "ধনেপাতা",
          "img": "https://www.themealdb.com/images/ingredients/Coriander.png",
          "phonetic": [
            "dhoniya",
            "dhonea",
            "dhania"
          ],
          "createdAt": "2026-01-06T01:34:19.802Z",
          "updatedAt": "2026-01-06T01:34:19.802Z"
        }
      },
      {
        "id": 116,
        "recipe_id": 13,
        "ingredient_id": 13,
        "quantity": "1",
        "unit_en": "piece",
        "unit_bn": "টি",
        "notes_en": "beaten",
        "notes_bn": "ফেটিয়ে নেওয়া",
        "ingredient": {
          "id": 13,
          "name_en": "Coconut Oil",
          "name_bn": "নারকেল তেল",
          "img": "/ingredients/13_coconut_oil.jpg",
          "phonetic": [
            "coconut oil",
            "coocoonut ooil",
            "coconut oeel",
            "coconoot oil"
          ],
          "createdAt": "2026-01-06T01:34:18.989Z",
          "updatedAt": "2026-01-06T01:34:18.989Z"
        }
      },
      {
        "id": 117,
        "recipe_id": 13,
        "ingredient_id": 41,
        "quantity": "2",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "mixed with water",
        "notes_bn": "জলে গোলানো",
        "ingredient": {
          "id": 41,
          "name_en": "Cauliflower",
          "name_bn": "ফুলকপি",
          "img": "/ingredients/43-Cauliflower.png",
          "phonetic": [
            "fulkopi",
            "phulkopi",
            "foolkopi"
          ],
          "createdAt": "2026-01-06T01:34:30.560Z",
          "updatedAt": "2026-01-06T01:34:30.560Z"
        }
      },
      {
        "id": 118,
        "recipe_id": 13,
        "ingredient_id": 60,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "crushed",
        "notes_bn": "গুঁড়ো করা",
        "ingredient": {
          "id": 60,
          "name_en": "Honey",
          "name_bn": "মধু",
          "img": "https://www.themealdb.com/images/ingredients/Honey.png",
          "phonetic": [
            "honey",
            "hooney",
            "honeey"
          ],
          "createdAt": "2026-01-06T01:34:42.689Z",
          "updatedAt": "2026-01-06T01:34:42.689Z"
        }
      },
      {
        "id": 119,
        "recipe_id": 13,
        "ingredient_id": 35,
        "quantity": "1",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "unsalted",
        "notes_bn": "লবণ ছাড়া",
        "ingredient": {
          "id": 35,
          "name_en": "Tofu",
          "name_bn": "টোফু",
          "img": "https://www.themealdb.com/images/ingredients/Tofu.png",
          "phonetic": [
            "tofu",
            "toofu",
            "tofoo"
          ],
          "createdAt": "2026-01-06T01:34:26.833Z",
          "updatedAt": "2026-01-06T01:34:26.833Z"
        }
      }
    ],
    "steps": [
      {
        "id": 94,
        "recipe_id": 13,
        "step_number": 1,
        "instruction_en": "Heat butter in a pot and sauté chopped ginger and garlic until aromatic for about 1-2 minutes.",
        "instruction_bn": "একটি পাত্রে মাখন গরম করে তাতে আদা ও রসুন কুচি দিয়ে ১-২ মিনিট ভাজুন যতক্ষণ না সুগন্ধ বের হয়।",
        "timestamp": "0:45"
      },
      {
        "id": 95,
        "recipe_id": 13,
        "step_number": 2,
        "instruction_en": "Add the chicken pieces and sauté until they turn white and slightly tender.",
        "instruction_bn": "চিকেনের টুকরোগুলো দিয়ে দিন এবং হালকা সাদাটে রঙ না হওয়া পর্যন্ত ভাজুন।",
        "timestamp": "1:20"
      },
      {
        "id": 96,
        "recipe_id": 13,
        "step_number": 3,
        "instruction_en": "Add chopped carrots and beans, then pour in 3-4 cups of water. Bring to a boil and simmer for 10-12 minutes.",
        "instruction_bn": "গাজর ও বিনস কুচি দিয়ে ৩-৪ কাপ জল দিন। ফুটে উঠলে ১০-১২ মিনিট হালকা আঁচে রান্না হতে দিন।",
        "timestamp": "2:15"
      },
      {
        "id": 97,
        "recipe_id": 13,
        "step_number": 4,
        "instruction_en": "Add salt, sugar, and black pepper powder. Stir well to combine.",
        "instruction_bn": "লবণ, চিনি এবং গোলমরিচ গুঁড়ো দিয়ে ভালো করে নাড়ুন।",
        "timestamp": "3:30"
      },
      {
        "id": 98,
        "recipe_id": 13,
        "step_number": 5,
        "instruction_en": "Slowly pour in the cornstarch slurry while stirring continuously to thicken the soup.",
        "instruction_bn": "অনবরত নাড়তে নাড়তে জলে গোলানো কর্নফ্লাওয়ার ধীরে ধীরে ঢেলে দিন যাতে সুপটি ঘন হয়।",
        "timestamp": "4:10"
      },
      {
        "id": 99,
        "recipe_id": 13,
        "step_number": 6,
        "instruction_en": "Gently drizzle in the beaten egg in a thin stream, stirring lightly to create egg ribbons. Simmer for 1 more minute and serve hot.",
        "instruction_bn": "ফেটিয়ে রাখা ডিমটি ওপর থেকে ধীরে ধীরে ঢালুন এবং হালকা করে নাড়ুন যাতে ডিমের রিবন তৈরি হয়। আরও ১ মিনিট ফুটিয়ে গরম গরম পরিবেশন করুন।",
        "timestamp": "5:05"
      }
    ]
  },
  {
    "id": 14,
    "slug": "peyajkoli-besan-masala",
    "title_en": "Onion Stalks with Gram Flour (Peyajkoli Besan Masala)",
    "title_bn": "বেসন দিয়ে পেঁয়াজকলির নতুন রেসিপি",
    "image": "https://i.ytimg.com/vi/kJoFxYhplmY/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=kJoFxYhplmY",
    "youtube_id": "kJoFxYhplmY",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 10,
    "cook_time": 25,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:42.997Z",
    "updatedAt": "2026-01-06T01:34:42.997Z",
    "blogContent": {
      "id": 14,
      "recipe_id": 14,
      "intro_en": "Upgrade your winter meals with this unique Onion Stalks (Peyajkoli) recipe. Unlike traditional stir-fries, this version uses gram flour and curd to create a rich, masala-coated texture.",
      "intro_bn": "শীতের স্পেশাল পেঁয়াজকলি দিয়ে তৈরি করুন এক ভিন্ন স্বাদের রেসিপি। সাধারণ ভাজির বদলে বেসন ও টক দইয়ের এই যুগলবন্দি আপনার ভাতের পাতের স্বাদ বদলে দেবে কয়েক গুণ।",
      "what_makes_it_special_en": "The addition of roasted gram flour (besan) provides a nutty depth, while the curd balances the spices, making it a perfect 'dry-curry' for roti or steaming hot rice.",
      "what_makes_it_special_bn": "ভাজা বেসনের সুগন্ধ এবং টক দইয়ের টক-ঝাল মিশ্রণ এই পদটিকে অনন্য করে তোলে। এটি রুটি বা গরম ভাতের সাথে খাওয়ার জন্য একদম সেরা।",
      "cooking_tips_en": "Always roast the besan on low flame to prevent it from burning. Also, add ginger and garlic after the onions are 80% fried to retain their aroma.",
      "cooking_tips_bn": "বেসন ভাজার সময় সব সময় আঁচ কমিয়ে রাখবেন যাতে পুড়ে না যায়। পেঁয়াজ ৮০% ভাজা হওয়ার পর আদা-রসুন দিলে রান্নার স্বাদ ও গন্ধ দুইই ভালো থাকে।",
      "serving_en": "Serve hot with plain rice, paratha, or roti. It works excellently as a side dish in a traditional Bengali lunch.",
      "serving_bn": "গরম ভাত, পরোটা বা রুটির সাথে পরিবেশন করুন। ডাল-ভাতের পাশে সাইড ডিশ হিসেবে এটি দারুণ লাগে।",
      "storage_en": "Store in an airtight container in the refrigerator for up to 2 days. Reheat in a pan with a splash of water before serving.",
      "storage_bn": "এয়ারটাইট পাত্রে ভরে ফ্রিজে ২ দিন পর্যন্ত রাখা যায়। খাওয়ার আগে সামান্য জল দিয়ে কড়াইতে গরম করে নিন।",
      "full_blog_en": "Peyajkoli or Onion Stalks are a quintessential part of the Bengali winter pantry. While most households stick to the classic potato-onion stalk stir fry, this Masala Peyajkoli brings a restaurant-like richness to your home. The secret lies in the 'bhuna' masala technique where gram flour is roasted with spices to create a thick coating around the stalks. The use of mustard oil and a variety of whole seeds (panch-phoron style elements) adds an unmistakable rustic charm. This dish is not just about taste but also about textures—the softness of the stalks against the grainy texture of roasted besan. It is a quick yet sophisticated way to enjoy seasonal greens.",
      "full_blog_bn": "পেঁয়াজকলি শীতকালীন বাঙালিদের অত্যন্ত প্রিয় একটি সবজি। সাধারণত আমরা আলু দিয়ে পেঁয়াজকলি ভাজা খেয়েই অভ্যস্ত, কিন্তু বেসন দিয়ে তৈরি এই নতুন পদ্ধতিটি আপনার রান্নায় আনবে আভিজাত্যের ছোঁয়া। এই রান্নার বিশেষত্ব হলো মশলার কষানো এবং বেসনের ব্যবহার, যা সবজির গায়ে একটি ঘন আস্তরণ তৈরি করে। সরষের তেলের ঝাঁঝ এবং মৌড়ি-কালোজিরে-জিরের ফোড়ন এতে যোগ করে এক গ্রাম্য স্বাদ। এই পদটি শুধু সুস্বাদু নয়, বরং এতে থাকা বিভিন্ন মশলা ও সবজি একে পুষ্টিকরও করে তোলে। শীতের দুপুরে বা রাতের খাবারে একঘেয়েমি কাটাতে এই রেসিপিটি অবশ্যই ট্রাই করবেন।"
    },
    "ingredients": [
      {
        "id": 120,
        "recipe_id": 14,
        "ingredient_id": 61,
        "quantity": "200",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "finely chopped",
        "notes_bn": "ছোট করে কাটা",
        "ingredient": {
          "id": 61,
          "name_en": "Cashews",
          "name_bn": "কাজুবাদাম",
          "img": "https://www.themealdb.com/images/ingredients/Cashews.png",
          "phonetic": [
            "cashews",
            "caashews",
            "casheews"
          ],
          "createdAt": "2026-01-06T01:34:43.778Z",
          "updatedAt": "2026-01-06T01:34:43.778Z"
        }
      },
      {
        "id": 121,
        "recipe_id": 14,
        "ingredient_id": 22,
        "quantity": "4",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for authentic flavor",
        "notes_bn": "রান্নার জন্য",
        "ingredient": {
          "id": 22,
          "name_en": "Sugar",
          "name_bn": "চিনি",
          "img": "https://www.themealdb.com/images/ingredients/Sugar.png",
          "phonetic": [
            "chini",
            "cheeni",
            "chinee"
          ],
          "createdAt": "2026-01-06T01:34:20.659Z",
          "updatedAt": "2026-01-06T01:34:20.659Z"
        }
      },
      {
        "id": 122,
        "recipe_id": 14,
        "ingredient_id": 10,
        "quantity": "1",
        "unit_en": "piece",
        "unit_bn": "টি",
        "notes_en": "finely chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 10,
          "name_en": "Rice",
          "name_bn": "চাল",
          "img": "https://www.themealdb.com/images/ingredients/Rice.png",
          "phonetic": [
            "chal",
            "chaal",
            "bhat"
          ],
          "createdAt": "2026-01-06T01:34:17.472Z",
          "updatedAt": "2026-01-06T01:34:17.472Z"
        }
      },
      {
        "id": 123,
        "recipe_id": 14,
        "ingredient_id": 26,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "sifted",
        "notes_bn": "চেলে নেওয়া",
        "ingredient": {
          "id": 26,
          "name_en": "Lentils",
          "name_bn": "মসুর ডাল",
          "img": "https://www.themealdb.com/images/ingredients/Lentils.png",
          "phonetic": [
            "dal",
            "daal",
            "dhal"
          ],
          "createdAt": "2026-01-06T01:34:23.627Z",
          "updatedAt": "2026-01-06T01:34:23.627Z"
        }
      },
      {
        "id": 124,
        "recipe_id": 14,
        "ingredient_id": 7,
        "quantity": "2.5",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "whisked",
        "notes_bn": "ফেটিয়ে নেওয়া",
        "ingredient": {
          "id": 7,
          "name_en": "Green Chili",
          "name_bn": "কাঁচা মরিচ",
          "img": "https://www.themealdb.com/images/ingredients/Green%20Chili.png",
          "phonetic": [
            "kacha morich",
            "kachka morich",
            "morich"
          ],
          "createdAt": "2026-01-06T01:34:16.949Z",
          "updatedAt": "2026-01-06T01:34:16.949Z"
        }
      },
      {
        "id": 125,
        "recipe_id": 14,
        "ingredient_id": 17,
        "quantity": "1.5",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "finely chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 17,
          "name_en": "Coriander",
          "name_bn": "ধনেপাতা",
          "img": "https://www.themealdb.com/images/ingredients/Coriander.png",
          "phonetic": [
            "dhoniya",
            "dhonea",
            "dhania"
          ],
          "createdAt": "2026-01-06T01:34:19.802Z",
          "updatedAt": "2026-01-06T01:34:19.802Z"
        }
      },
      {
        "id": 126,
        "recipe_id": 14,
        "ingredient_id": 18,
        "quantity": "2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "finely chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 18,
          "name_en": "Cumin",
          "name_bn": "জিরা",
          "img": "https://www.themealdb.com/images/ingredients/Cumin.png",
          "phonetic": [
            "jeera",
            "jira",
            "zira"
          ],
          "createdAt": "2026-01-06T01:34:19.973Z",
          "updatedAt": "2026-01-06T01:34:19.973Z"
        }
      },
      {
        "id": 127,
        "recipe_id": 14,
        "ingredient_id": 20,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for tempering",
        "notes_bn": "ফোড়নের জন্য",
        "ingredient": {
          "id": 20,
          "name_en": "Cardamom",
          "name_bn": "এলাচ",
          "img": "https://www.themealdb.com/images/ingredients/Cardamom.png",
          "phonetic": [
            "elach",
            "elaach",
            "elaichi"
          ],
          "createdAt": "2026-01-06T01:34:20.321Z",
          "updatedAt": "2026-01-06T01:34:20.321Z"
        }
      },
      {
        "id": 128,
        "recipe_id": 14,
        "ingredient_id": 62,
        "quantity": "0.5",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "whole",
        "notes_bn": "আস্ত",
        "ingredient": {
          "id": 62,
          "name_en": "Almonds",
          "name_bn": "কাঠবাদাম",
          "img": "https://www.themealdb.com/images/ingredients/Almonds.png",
          "phonetic": [
            "almonds",
            "aalmonds",
            "almoonds"
          ],
          "createdAt": "2026-01-06T01:34:44.761Z",
          "updatedAt": "2026-01-06T01:34:44.761Z"
        }
      },
      {
        "id": 129,
        "recipe_id": 14,
        "ingredient_id": 45,
        "quantity": "1/3",
        "unit_en": "tsp",
        "unit_bn": "চামচ",
        "notes_en": "whole",
        "notes_bn": "আস্ত",
        "ingredient": {
          "id": 45,
          "name_en": "Cabbage",
          "name_bn": "বাঁধাকপি",
          "img": "https://www.themealdb.com/images/ingredients/Cabbage.png",
          "phonetic": [
            "badha kopi",
            "badha-kopi",
            "bandha kopi"
          ],
          "createdAt": "2026-01-06T01:34:33.269Z",
          "updatedAt": "2026-01-06T01:34:33.269Z"
        }
      }
    ],
    "steps": [
      {
        "id": 100,
        "recipe_id": 14,
        "step_number": 1,
        "instruction_en": "Cut 200g of onion stalks into small pieces after arranging them uniformly.",
        "instruction_bn": "২০০ গ্রাম পেঁয়াজকলি ভালোভাবে সাজিয়ে নিয়ে ছোট ছোট টুকরো করে কেটে নিন।",
        "timestamp": "0:54"
      },
      {
        "id": 101,
        "recipe_id": 14,
        "step_number": 2,
        "instruction_en": "Heat 3-4 tsp mustard oil in a pan. Temper with dry red chilies, cumin, fennel, and nigella seeds.",
        "instruction_bn": "কড়াইতে ৩-৪ চা চামচ সরষের তেল গরম করে শুকনো লঙ্কা, গোটা জিরে, মৌড়ি ও কালোজিরে ফোড়ন দিন।",
        "timestamp": "2:04"
      },
      {
        "id": 102,
        "recipe_id": 14,
        "step_number": 3,
        "instruction_en": "Add chopped onions and fry until golden brown. Then add chopped ginger, garlic, and green chilies, frying until fragrant.",
        "instruction_bn": "কুচানো পেঁয়াজ দিয়ে লাল করে ভাজুন। এরপর আদা কুচি, রসুন কুচি ও কাঁচালঙ্কা দিয়ে সুগন্ধ বের হওয়া পর্যন্ত ভাজুন।",
        "timestamp": "2:45"
      },
      {
        "id": 103,
        "recipe_id": 14,
        "step_number": 4,
        "instruction_en": "Lower the flame and add 2 tsp gram flour (besan). Roast for 3-4 minutes until it smells nutty.",
        "instruction_bn": "আঁচ কমিয়ে ২ চা চামচ বেসন দিন। ৩-৪ মিনিট ধরে ভালো করে ভাজুন যতক্ষণ না বেসনের সুন্দর গন্ধ বেরোচ্ছে।",
        "timestamp": "3:23"
      },
      {
        "id": 104,
        "recipe_id": 14,
        "step_number": 5,
        "instruction_en": "Add turmeric, Kashmiri red chili powder, coriander powder, black pepper, garam masala, and salt. Mix well on low flame.",
        "instruction_bn": "হলুদ, কাশ্মীরি লঙ্কা গুঁড়ো, ধনে গুঁড়ো, গোলমরিচ গুঁড়ো, গরম মসলা ও স্বাদমতো নুন দিয়ে কম আঁচে মেশান।",
        "timestamp": "3:48"
      },
      {
        "id": 105,
        "recipe_id": 14,
        "step_number": 6,
        "instruction_en": "Whisk 2.5 tsp curd and add it to the spices. Cook until oil starts to separate.",
        "instruction_bn": "২.৫ চা চামচ ফেটানো টক দই দিয়ে মসলাটি কষান যতক্ষণ না তেল ছাড়তে শুরু করে।",
        "timestamp": "4:17"
      },
      {
        "id": 106,
        "recipe_id": 14,
        "step_number": 7,
        "instruction_en": "Add the chopped onion stalks. Cover and cook for 2-3 minutes until they soften naturally.",
        "instruction_bn": "কেটে রাখা পেঁয়াজকলিগুলো দিয়ে দিন। ঢাকা দিয়ে ২-৩ মিনিট রান্না করুন যাতে সেগুলো নরম হয়ে যায়।",
        "timestamp": "5:10"
      },
      {
        "id": 107,
        "recipe_id": 14,
        "step_number": 8,
        "instruction_en": "Add a splash of water, increase heat, and cook for another 2-3 minutes until the gravy coats the stalks perfectly.",
        "instruction_bn": "সামান্য জল দিয়ে আঁচ বাড়িয়ে ২-৩ মিনিট রান্না করুন যাতে মসলা পেঁয়াজকলির সাথে ভালোভাবে মিশে যায়।",
        "timestamp": "5:45"
      }
    ]
  },
  {
    "id": 15,
    "slug": "badhakopi-vorta-two-ways",
    "title_en": "Cabbage Vorta (Mashed Cabbage) in 2 Simple Ways",
    "title_bn": "২ রকম সহজ পদ্ধতিতে বাঁধাকপি ভর্তা রেসিপি",
    "image": "https://i.ytimg.com/vi/TQSZ56ZiCZ0/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=TQSZ56ZiCZ0",
    "youtube_id": "TQSZ56ZiCZ0",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 20,
    "cook_time": 30,
    "servings": 6,
    "createdAt": "2026-01-06T01:34:45.108Z",
    "updatedAt": "2026-01-06T01:34:45.108Z",
    "blogContent": {
      "id": 15,
      "recipe_id": 15,
      "intro_en": "Forget regular cabbage curries! Cabbage Vorta (Mashed Cabbage) is the ultimate soul-warming side dish for steamed rice. In this recipe, we explore two distinct styles: a rich, sautéed bhuna version and a traditional, rustic hand-mashed version.",
      "intro_bn": "বাঁধাকপির একঘেয়ে তরকারি বাদ দিয়ে এবার ট্রাই করুন জিভে জল আনা বাঁধাকপির ভর্তা। এই রেসিপিতে আমরা দুই ধরণের ভর্তা দেখাবো: একটি মশলাদার ভুনা পদ্ধতি এবং অন্যটি চিরচেনা মাখা পদ্ধতি যা গরম ভাতের সাথে অমৃত লাগে।",
      "what_makes_it_special_en": "The dual-method approach makes this recipe unique. One uses a blended cabbage paste for a smooth, creamy texture, while the other maintains the crunch and freshness of the vegetable, enhanced by smoky fried garlic and tangy lemon.",
      "what_makes_it_special_bn": "এই রেসিপির বিশেষত্ব হলো এর দুই ধরণের স্বাদ। একটি পদ্ধতিতে বাঁধাকপি পেস্ট করে ক্রিম টেক্সচার আনা হয়, অন্যটিতে হাতে মাখা পদ্ধতিতে সবজির আসল স্বাদ ও ভাজা রসুনের সুন্দর ঘ্রাণ বজায় থাকে।",
      "cooking_tips_en": "To save time, always shred the cabbage very thinly; it steams faster and absorbs seasonings better. For the best flavor, never skip the final drizzle of raw mustard oil—it's the heart of any authentic Bengali vorta.",
      "cooking_tips_bn": "সময় বাঁচাতে বাঁধাকপি সবসময় খুব পাতলা করে কাটবেন, এতে ভাপানো সহজ হয়। ভর্তার আসল স্বাদ পেতে শেষে কাঁচা সরষের তেল দিতে ভুলবেন না—এটিই যেকোনো ভর্তার প্রাণ।",
      "serving_en": "Serve both types of vorta with steaming hot white rice. A side of thick dal and a wedge of lime will complete this classic Bengali meal.",
      "serving_bn": "গরম গরম ধোঁয়া ওঠা সাদা ভাতের সাথে দুই ধরণের ভর্তাই পরিবেশন করুন। সাথে ঘন ডাল আর এক টুকরো লেবু হলে আর কিছুই লাগবে না।",
      "storage_en": "The cooked version stays fresh in the fridge for 2 days in an airtight container. The hand-mashed version is best enjoyed immediately due to the presence of raw onions.",
      "storage_bn": "ভাজা ভর্তাটি এয়ারটাইট বক্সে ফ্রিজে ২ দিন পর্যন্ত ভালো থাকে। তবে মাখা ভর্তাটি কাঁচা পেঁয়াজ থাকায় সাথে সাথেই খেয়ে নেওয়া ভালো।",
      "full_blog_en": "Cabbage is often considered a humble vegetable, but when turned into a Vorta, it transforms into a gourmet experience. The first method, which involves blending and sautéing, is rich and spicy, perfect for those who love a 'Bhuna' texture. The slow-cooked tomatoes provide a beautiful tang that balances the sweetness of the cabbage. On the other hand, the traditional hand-mashed method is all about the aromatics. Frying the garlic cloves until they are buttery soft inside adds a layer of depth that raw garlic cannot provide. Crushing the fried red chillies by hand releases oils that give a smoky heat. Both recipes prioritize the use of mustard oil to provide that quintessential Bengali pungency. Whether you are looking for a quick lunch or a special addition to a feast, these two vortas offer versatility and immense satisfaction in every bite.",
      "full_blog_bn": "বাঁধাকপি খুব সাধারণ সবজি হলেও ভর্তা হিসেবে এটি অসাধারণ। প্রথম পদ্ধতিতে বাঁধাকপি পেস্ট করে মশলায় কষানো হয় বলে এটি বেশ রিচ ও সুস্বাদু হয়। টমেটোর টক ভাব বাঁধাকপির মিষ্টি স্বাদের সাথে দারুণ ভারসাম্য তৈরি করে। অন্যদিকে, দ্বিতীয় পদ্ধতিতে ভাজা রসুনের ব্যবহার এক অনন্য মাত্রা যোগ করে। শুকনো লঙ্কা হাতে ডলে মাখলে যে সুন্দর ঘ্রাণ বের হয়, তাতেই অর্ধেক তৃপ্তি চলে আসে। দুই ধরণের ভর্তাতেই সরষের তেলের ঝাঁঝালো স্বাদ বজায় রাখা হয়েছে। যারা ভর্তা প্রেমী, তাদের জন্য এই দুটি রেসিপিই হবে তুরুপের তাস। দুপুরবেলার খাবারে এক থালা ভাত নিমেষেই শেষ করে দেওয়ার জন্য এই বাঁধাকপির ভর্তার কোনো বিকল্প নেই।"
    },
    "ingredients": [
      {
        "id": 130,
        "recipe_id": 15,
        "ingredient_id": 63,
        "quantity": "2",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "finely shredded/sliced",
        "notes_bn": "ঝিরিঝিরি করে কাটা",
        "ingredient": {
          "id": 63,
          "name_en": "Tamarind",
          "name_bn": "তেঁতুল",
          "img": "/ingredients/67-Tamarind.png",
          "phonetic": [
            "tetul",
            "tentul",
            "imli"
          ],
          "createdAt": "2026-01-06T01:34:45.928Z",
          "updatedAt": "2026-01-06T01:34:45.928Z"
        }
      },
      {
        "id": 131,
        "recipe_id": 15,
        "ingredient_id": 22,
        "quantity": "5",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "used for frying and raw finishing",
        "notes_bn": "ভাজা ও কাঁচা মাখার জন্য",
        "ingredient": {
          "id": 22,
          "name_en": "Sugar",
          "name_bn": "চিনি",
          "img": "https://www.themealdb.com/images/ingredients/Sugar.png",
          "phonetic": [
            "chini",
            "cheeni",
            "chinee"
          ],
          "createdAt": "2026-01-06T01:34:20.659Z",
          "updatedAt": "2026-01-06T01:34:20.659Z"
        }
      },
      {
        "id": 132,
        "recipe_id": 15,
        "ingredient_id": 19,
        "quantity": "15",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "fried until crispy",
        "notes_bn": "মচমচে করে ভাজা",
        "ingredient": {
          "id": 19,
          "name_en": "Cinnamon",
          "name_bn": "দারুচিনি",
          "img": "https://images.unsplash.com/photo-1589733429478-43017351acc8?auto=format&fit=crop&w=600&q=80",
          "phonetic": [
            "dalchini",
            "daalchini"
          ],
          "createdAt": "2026-01-06T01:34:20.141Z",
          "updatedAt": "2026-01-06T01:34:20.141Z"
        }
      },
      {
        "id": 133,
        "recipe_id": 15,
        "ingredient_id": 18,
        "quantity": "15",
        "unit_en": "cloves",
        "unit_bn": "কোয়া",
        "notes_en": "some chopped, some whole",
        "notes_bn": "কিছু কুচি, কিছু আস্ত",
        "ingredient": {
          "id": 18,
          "name_en": "Cumin",
          "name_bn": "জিরা",
          "img": "https://www.themealdb.com/images/ingredients/Cumin.png",
          "phonetic": [
            "jeera",
            "jira",
            "zira"
          ],
          "createdAt": "2026-01-06T01:34:19.973Z",
          "updatedAt": "2026-01-06T01:34:19.973Z"
        }
      },
      {
        "id": 134,
        "recipe_id": 15,
        "ingredient_id": 10,
        "quantity": "3",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "sliced/chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 10,
          "name_en": "Rice",
          "name_bn": "চাল",
          "img": "https://www.themealdb.com/images/ingredients/Rice.png",
          "phonetic": [
            "chal",
            "chaal",
            "bhat"
          ],
          "createdAt": "2026-01-06T01:34:17.472Z",
          "updatedAt": "2026-01-06T01:34:17.472Z"
        }
      },
      {
        "id": 135,
        "recipe_id": 15,
        "ingredient_id": 16,
        "quantity": "5",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "sliced/mashed",
        "notes_bn": "ফালি করা",
        "ingredient": {
          "id": 16,
          "name_en": "Turmeric",
          "name_bn": "হলুদ",
          "img": "https://www.themealdb.com/images/ingredients/Turmeric.png",
          "phonetic": [
            "haldi",
            "holdi",
            "holdee",
            "halud"
          ],
          "createdAt": "2026-01-06T01:34:19.635Z",
          "updatedAt": "2026-01-06T01:34:19.635Z"
        }
      },
      {
        "id": 136,
        "recipe_id": 15,
        "ingredient_id": 4,
        "quantity": "1/2",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 4,
          "name_en": "Onion",
          "name_bn": "পেঁয়াজ",
          "img": "https://www.themealdb.com/images/ingredients/Onion.png",
          "phonetic": [
            "piaz",
            "piyaz",
            "peaj",
            "peyaj"
          ],
          "createdAt": "2026-01-06T01:34:16.425Z",
          "updatedAt": "2026-01-06T01:34:16.425Z"
        }
      },
      {
        "id": 137,
        "recipe_id": 15,
        "ingredient_id": 3,
        "quantity": "6",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "chopped/whole",
        "notes_bn": "আস্ত বা কুচি",
        "ingredient": {
          "id": 3,
          "name_en": "Egg",
          "name_bn": "ডিম",
          "img": "https://www.themealdb.com/images/ingredients/Egg.png",
          "phonetic": [
            "dim",
            "deem",
            "anda"
          ],
          "createdAt": "2026-01-06T01:34:16.250Z",
          "updatedAt": "2026-01-06T01:34:16.250Z"
        }
      },
      {
        "id": 138,
        "recipe_id": 15,
        "ingredient_id": 64,
        "quantity": "1/2",
        "unit_en": "piece",
        "unit_bn": "টি",
        "notes_en": "juice for finishing",
        "notes_bn": "রস ব্যবহারের জন্য",
        "ingredient": {
          "id": 64,
          "name_en": "Curry Leaves",
          "name_bn": "কারিপাতা",
          "img": "/ingredients/68_curry_leaves.jpg",
          "phonetic": [
            "curry pata",
            "karipatta"
          ],
          "createdAt": "2026-01-06T01:34:46.946Z",
          "updatedAt": "2026-01-06T01:34:46.946Z"
        }
      }
    ],
    "steps": [
      {
        "id": 108,
        "recipe_id": 15,
        "step_number": 1,
        "instruction_en": "Finely shred the cabbage, removing the hard stem. Place it in a pan with a little salt (no oil/water) and steam covered for 4-5 minutes until tender. Drain the excess water through a strainer.",
        "instruction_bn": "বাঁধাকপি ঝিরিঝিরি করে কেটে শক্ত ডাঁটা বাদ দিন। কড়াইতে সামান্য নুন দিয়ে তেল বা জল ছাড়া ঢাকা দিয়ে ৪-৫ মিনিট ভাপিয়ে নিন। সেদ্ধ হলে জল ঝরিয়ে নিন।",
        "timestamp": "0:01:08"
      },
      {
        "id": 109,
        "recipe_id": 15,
        "step_number": 2,
        "instruction_en": "Heat mustard oil and fry about 15 dried red chillies on low-medium heat for 4-5 minutes until crispy. Set aside to cool.",
        "instruction_bn": "সরষের তেল গরম করে ১৫-১৬টি শুকনো লঙ্কা ৪-৫ মিনিট ধরে লো-মিডিয়াম আঁচে মচমচে করে ভেজে নিন।",
        "timestamp": "0:03:42"
      },
      {
        "id": 110,
        "recipe_id": 15,
        "step_number": 3,
        "instruction_en": "For the Cooked Vorta (Method 1): Sauté nigella seeds, cumin seeds, and chopped garlic in oil. Add onions and green chillies, frying until golden brown.",
        "instruction_bn": "প্রথম পদ্ধতি (ভাজা ভর্তা): তেলে কালোজিরে, জিরে ও রসুন কুচি ফোড়ন দিয়ে পেঁয়াজ ও কাঁচা লঙ্কা দিন। পেঁয়াজ লালচে হওয়া পর্যন্ত ভাজুন।",
        "timestamp": "0:04:45"
      },
      {
        "id": 111,
        "recipe_id": 15,
        "step_number": 4,
        "instruction_en": "Add turmeric, Kashmiri red chili powder, coriander powder, and sliced tomatoes with salt. Cook until tomatoes are completely soft and mushy.",
        "instruction_bn": "হলুদ, লঙ্কা গুঁড়ো, ধনে গুঁড়ো ও টমেটো ফালি নুনসহ দিয়ে কষান। টমেটো পুরোপুরি গলে যাওয়া পর্যন্ত রান্না করুন।",
        "timestamp": "0:05:45"
      },
      {
        "id": 112,
        "recipe_id": 15,
        "step_number": 5,
        "instruction_en": "Blend half of the steamed cabbage into a paste (no water). Add it to the tomato masala and cook until the mixture leaves the sides of the pan.",
        "instruction_bn": "ভাপানো বাঁধাকপির অর্ধেকটা জল ছাড়া পেস্ট করে টমেটোর মশলায় দিন। কড়াইয়ের গা থেকে ছেড়ে না আসা পর্যন্ত নাড়তে থাকুন।",
        "timestamp": "0:07:25"
      },
      {
        "id": 113,
        "recipe_id": 15,
        "step_number": 6,
        "instruction_en": "Finish with crushed fried dry chillies, coriander leaves, fresh green chillies, and a drizzle of raw mustard oil.",
        "instruction_bn": "মেশানো হলে ওপর থেকে গুঁড়ো করা ভাজা শুকনো লঙ্কা, ধনেপাতা, কাঁচা লঙ্কা ও কাঁচা সরষের তেল ছড়িয়ে নামিয়ে নিন।",
        "timestamp": "0:08:04"
      },
      {
        "id": 114,
        "recipe_id": 15,
        "step_number": 7,
        "instruction_en": "For the Traditional Mashed Vorta (Method 2): Fry garlic cloves in a little oil until soft inside. Add whole green chillies at the end to soften them. In the same pan, cook sliced tomatoes until they can be easily mashed.",
        "instruction_bn": "দ্বিতীয় পদ্ধতি (মাখা ভর্তা): অল্প তেলে রসুনের কোয়া নরম করে ভাজুন। শেষে কাঁচা লঙ্কা দিয়ে নরম করুন। একই প্যানে টমেটো ফালি দিয়ে ম্যাশ হওয়া পর্যন্ত সেঁকে নিন।",
        "timestamp": "0:09:14"
      },
      {
        "id": 115,
        "recipe_id": 15,
        "step_number": 8,
        "instruction_en": "In a bowl, mash the fried dry chillies with salt, then mash in the fried garlic and green chillies. Add raw onions, coriander leaves, bit salt (black salt), and plenty of mustard oil.",
        "instruction_bn": "একটি পাত্রে ভাজা শুকনো লঙ্কা নুন দিয়ে মাখুন, এরপর ভাজা রসুন ও কাঁচা লঙ্কা চটকে নিন। সাথে কাঁচা পেঁয়াজ, ধনেপাতা, বিট নুন ও সরষের তেল দিন।",
        "timestamp": "0:11:23"
      },
      {
        "id": 116,
        "recipe_id": 15,
        "step_number": 9,
        "instruction_en": "Add the mashed tomatoes and the remaining steamed cabbage. Mix everything thoroughly and finish with a squeeze of fresh lemon juice.",
        "instruction_bn": "ম্যাশ করা টমেটো ও বাকি ভাপানো বাঁধাকপি দিয়ে ভালো করে মেখে নিন। শেষে লেবুর রস দিয়ে পরিবেশন করুন।",
        "timestamp": "0:12:21"
      }
    ]
  },
  {
    "id": 16,
    "slug": "chilli-chicken-and-egg-fried-rice",
    "title_en": "Chilli Chicken with Egg Fried Rice",
    "title_bn": "চিলি চিকেন এবং এগ ফ্রাইড রাইস",
    "image": "https://img.youtube.com/vi/aMa8TacRlkU/maxresdefault.jpg",
    "youtube_url": "[https://www.youtube.com/watch?v=aMa8TacRlkU](https://www.youtube.com/watch?v=aMa8TacRlkU)",
    "youtube_id": "aMa8TacRlkU",
    "cuisine": "Chinese",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Medium",
    "prep_time": 45,
    "cook_time": 40,
    "servings": 3,
    "createdAt": "2026-01-06T01:34:47.147Z",
    "updatedAt": "2026-01-06T01:34:47.147Z",
    "blogContent": {
      "id": 16,
      "recipe_id": 16,
      "intro_en": "Craving a restaurant-style Indo-Chinese dinner? This Chilli Chicken and Egg Fried Rice combo is the perfect way to bring the flavors of a Dhaba to your home kitchen.",
      "intro_bn": "রেস্টুরেন্ট স্টাইল ইন্দো-চাইনিজ ডিনারের কথা ভাবছেন? এই চিলি চিকেন এবং এগ ফ্রাইড রাইস কম্বোটি আপনার রান্নাঘরেই ধাবার স্বাদ নিয়ে আসার জন্য উপযুক্ত।",
      "what_makes_it_special_en": "The secret lies in the double cooking of the chicken—marinated to tenderness and fried for crunch—paired with aromatically tossed fried rice.",
      "what_makes_it_special_bn": "এর আসল রহস্য হলো মাংসের দ্বিগুণ রান্না—নরম হওয়ার জন্য ম্যারিনেশন এবং মুচমুচে হওয়ার জন্য ভাজা—সাথে চমৎকার সুগন্ধযুক্ত ফ্রাইড রাইস।",
      "cooking_tips_en": "For the perfect fried rice, use day-old cold rice or ensure the freshly boiled rice is completely cool to prevent it from getting mushy.",
      "cooking_tips_bn": "নিখুঁত ফ্রাইড রাইসের জন্য আগের দিনের ঠান্ডা ভাত ব্যবহার করুন অথবা সদ্য সেদ্ধ করা ভাতটি পুরোপুরি ঠান্ডা করে নিন যাতে এটি গলে না যায়।",
      "serving_en": "Serve steaming hot Chilli Chicken alongside the Egg Fried Rice, garnished with spring onion greens.",
      "serving_bn": "স্প্রিং অনিয়ন কুচি দিয়ে সাজিয়ে গরম গরম চিলি চিকেন এবং এগ ফ্রাইড রাইস একসাথে পরিবেশন করুন।",
      "storage_en": "Store in airtight containers. Chilli chicken keeps well for 2 days, but fried rice is best enjoyed fresh.",
      "storage_bn": "এয়ারটাইট পাত্রে সংরক্ষণ করুন। চিলি চিকেন ২ দিন ভালো থাকে, তবে ফ্রাইড রাইস টাটকা খাওয়াই সবচেয়ে ভালো।",
      "full_blog_en": "Indo-Chinese cuisine is a beloved staple in many households, and nothing beats the classic pairing of Chilli Chicken with Egg Fried Rice. In this recipe, we take a deep dive into achieving that elusive restaurant-style texture and flavor. The chicken is marinated with spices and cornstarch to ensure a juicy interior and a crispy exterior upon frying. For the gravy, we use a balance of soy sauce, vinegar, and hot chilli sauce to hit all the right notes of salty, sour, and spicy. The fried rice is kept simple yet flavorful, focusing on high-heat tossing to give it that authentic 'wok hei' or breath of the wok. Whether it's a weekend treat or a special dinner for guests, this meal is guaranteed to impress.",
      "full_blog_bn": "ইন্দো-চাইনিজ খাবার অনেকেরই প্রিয়, আর চিলি চিকেন ও এগ ফ্রাইড রাইসের ক্লাসিক জুটির কোনো তুলনা নেই। এই রেসিপিতে আমরা রেস্টুরেন্ট স্টাইল টেক্সচার এবং স্বাদ পাওয়ার উপায়গুলো বিস্তারিত দেখাব। মাংস মশলা ও কর্নফ্লাওয়ার দিয়ে ম্যারিনেট করা হয় যাতে ভাজার পর এটি ভেতরে নরম ও বাইরে মুচমুচে থাকে। গ্রেভির জন্য সয়া সস, ভিনেগার এবং ঝাল চিলি সসের একটি সঠিক ভারসাম্য ব্যবহার করা হয়। ফ্রাইড রাইস সহজ অথচ সুস্বাদু রাখা হয়েছে, যেখানে উচ্চ তাপে নাড়াচাড়ার ওপর গুরুত্ব দেওয়া হয়েছে। ছুটির দিনের খাবার হোক বা অতিথিদের জন্য স্পেশাল ডিনার, এই মিলটি সবাইকে মুগ্ধ করবেই।"
    },
    "ingredients": [
      {
        "id": 139,
        "recipe_id": 16,
        "ingredient_id": 1,
        "quantity": "500",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "boneless, cut into cubes",
        "notes_bn": "হাড়ছাড়া, কিউব করে কাটা",
        "ingredient": {
          "id": 1,
          "name_en": "Chicken",
          "name_bn": "চিকেন",
          "img": "https://www.themealdb.com/images/ingredients/Chicken.png",
          "phonetic": [
            "murgi",
            "murgee",
            "murghi",
            "chicken"
          ],
          "createdAt": "2026-01-06T01:34:15.775Z",
          "updatedAt": "2026-01-06T01:34:15.775Z"
        }
      },
      {
        "id": 140,
        "recipe_id": 16,
        "ingredient_id": 13,
        "quantity": "3",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "for marination and rice",
        "notes_bn": "ম্যারিনেশন এবং ভাতের জন্য",
        "ingredient": {
          "id": 13,
          "name_en": "Coconut Oil",
          "name_bn": "নারকেল তেল",
          "img": "/ingredients/13_coconut_oil.jpg",
          "phonetic": [
            "coconut oil",
            "coocoonut ooil",
            "coconut oeel",
            "coconoot oil"
          ],
          "createdAt": "2026-01-06T01:34:18.989Z",
          "updatedAt": "2026-01-06T01:34:18.989Z"
        }
      },
      {
        "id": 141,
        "recipe_id": 16,
        "ingredient_id": 41,
        "quantity": "4",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "for coating and sauce",
        "notes_bn": "কোটিং এবং সসের জন্য",
        "ingredient": {
          "id": 41,
          "name_en": "Cauliflower",
          "name_bn": "ফুলকপি",
          "img": "/ingredients/43-Cauliflower.png",
          "phonetic": [
            "fulkopi",
            "phulkopi",
            "foolkopi"
          ],
          "createdAt": "2026-01-06T01:34:30.560Z",
          "updatedAt": "2026-01-06T01:34:30.560Z"
        }
      },
      {
        "id": 142,
        "recipe_id": 16,
        "ingredient_id": 43,
        "quantity": "3",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "dark soy sauce preferred",
        "notes_bn": "ডার্ক সয়া সস হলে ভালো",
        "ingredient": {
          "id": 43,
          "name_en": "Red Amaranth",
          "name_bn": "লাল শাক",
          "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Amaranthus_gangeticus.jpg/640px-Amaranthus_gangeticus.jpg",
          "phonetic": [
            "red amaranth",
            "red aamaaraanth",
            "reed amaranth"
          ],
          "createdAt": "2026-01-06T01:34:31.028Z",
          "updatedAt": "2026-01-06T01:34:31.028Z"
        }
      },
      {
        "id": 143,
        "recipe_id": 16,
        "ingredient_id": 30,
        "quantity": "1",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "white vinegar",
        "notes_bn": "সাদা ভিনেগার",
        "ingredient": {
          "id": 30,
          "name_en": "Yogurt",
          "name_bn": "দই",
          "img": "https://www.themealdb.com/images/ingredients/Yogurt.png",
          "phonetic": [
            "doi",
            "dohi",
            "dahi"
          ],
          "createdAt": "2026-01-06T01:34:24.322Z",
          "updatedAt": "2026-01-06T01:34:24.322Z"
        }
      },
      {
        "id": 144,
        "recipe_id": 16,
        "ingredient_id": 3,
        "quantity": "6",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "slit length-wise",
        "notes_bn": "লম্বা করে চেরা",
        "ingredient": {
          "id": 3,
          "name_en": "Egg",
          "name_bn": "ডিম",
          "img": "https://www.themealdb.com/images/ingredients/Egg.png",
          "phonetic": [
            "dim",
            "deem",
            "anda"
          ],
          "createdAt": "2026-01-06T01:34:16.250Z",
          "updatedAt": "2026-01-06T01:34:16.250Z"
        }
      },
      {
        "id": 145,
        "recipe_id": 16,
        "ingredient_id": 2,
        "quantity": "2",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "freshly ground",
        "notes_bn": "তাজা বাটা",
        "ingredient": {
          "id": 2,
          "name_en": "Beef",
          "name_bn": "গরুর মাংস",
          "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Raw_beef_steak.jpg/640px-Raw_beef_steak.jpg",
          "phonetic": [
            "gorur mangsho",
            "gorur mangso",
            "mangsho",
            "beef"
          ],
          "createdAt": "2026-01-06T01:34:16.068Z",
          "updatedAt": "2026-01-06T01:34:16.068Z"
        }
      },
      {
        "id": 146,
        "recipe_id": 16,
        "ingredient_id": 65,
        "quantity": "2",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "Long grain Basmati or Jasmine",
        "notes_bn": "লম্বা দানার বাসমতি চাল",
        "ingredient": {
          "id": 65,
          "name_en": "Walnuts",
          "name_bn": "আখরোট",
          "img": "https://www.themealdb.com/images/ingredients/Walnuts.png",
          "phonetic": [
            "walnuts",
            "waalnuts",
            "walnoots"
          ],
          "createdAt": "2026-01-06T01:34:48.635Z",
          "updatedAt": "2026-01-06T01:34:48.635Z"
        }
      },
      {
        "id": 147,
        "recipe_id": 16,
        "ingredient_id": 66,
        "quantity": "1",
        "unit_en": "piece",
        "unit_bn": "টি",
        "notes_en": "diced",
        "notes_bn": "কিউব করে কাটা",
        "ingredient": {
          "id": 66,
          "name_en": "Peanuts",
          "name_bn": "চীনাবাদাম",
          "img": "https://www.themealdb.com/images/ingredients/Peanuts.png",
          "phonetic": [
            "peanuts",
            "peaanuts",
            "peeanuts",
            "peanoots"
          ],
          "createdAt": "2026-01-06T01:34:48.808Z",
          "updatedAt": "2026-01-06T01:34:48.808Z"
        }
      }
    ],
    "steps": [
      {
        "id": 117,
        "recipe_id": 16,
        "step_number": 1,
        "instruction_en": "Marinate the chicken cubes with egg, cornstarch, ginger-garlic paste, soy sauce, and black pepper. Let it rest for 30 minutes.",
        "instruction_bn": "মুরগির মাংসের কিউবগুলো ডিম, কর্নফ্লাওয়ার, আদা-রসুন বাটা, সয়া সস এবং গোলমরিচ দিয়ে ম্যারিনেট করে ৩০ মিনিট রেখে দিন।",
        "timestamp": "0:01:21"
      },
      {
        "id": 118,
        "recipe_id": 16,
        "step_number": 2,
        "instruction_en": "Deep fry the marinated chicken pieces until golden brown and crispy. Set aside.",
        "instruction_bn": "ম্যারিনেট করা মুরগির টুকরোগুলো সোনালি এবং মুচমুচে না হওয়া পর্যন্ত ডুবো তেলে ভাজুন। তুলে সরিয়ে রাখুন।",
        "timestamp": "0:02:10"
      },
      {
        "id": 119,
        "recipe_id": 16,
        "step_number": 3,
        "instruction_en": "In a separate pan, boil water with salt and oil to cook the rice until it's 80% done. Drain and cool.",
        "instruction_bn": "অন্য একটি পাত্রে নুন এবং তেল দিয়ে জল ফুটিয়ে চাল ৮০% সেদ্ধ হওয়া পর্যন্ত রান্না করুন। জল ঝরিয়ে ঠান্ডা হতে দিন।",
        "timestamp": "0:04:51"
      },
      {
        "id": 120,
        "recipe_id": 16,
        "step_number": 4,
        "instruction_en": "Sauté garlic, green chillies, onions, and capsicum in high heat. Add soy sauce, chilli sauce, and vinegar to create the gravy base.",
        "instruction_bn": "উচ্চ তাপে রসুন, কাঁচা লঙ্কা, পেঁয়াজ এবং ক্যাপসিকাম ভাজুন। গ্রেভির জন্য সয়া সস, চিলি সস এবং ভিনেগার দিন।",
        "timestamp": "0:03:43"
      },
      {
        "id": 121,
        "recipe_id": 16,
        "step_number": 5,
        "instruction_en": "Add the fried chicken to the sauce. Thicken with a cornstarch slurry and cook for 5 minutes.",
        "instruction_bn": "ভাজা মুরগি সসে দিয়ে দিন। কর্নফ্লাওয়ার গোলা জল দিয়ে গ্রেভি ঘন করুন এবং ৫ মিনিট রান্না করুন।",
        "timestamp": "0:04:15"
      },
      {
        "id": 122,
        "recipe_id": 16,
        "step_number": 6,
        "instruction_en": "For the fried rice, scramble eggs in a wok, add cooked vegetables, rice, and soy sauce. Toss on high flame for 3-4 minutes.",
        "instruction_bn": "ফ্রাইড রাইসের জন্য কড়াইতে ডিম ঝুরি করুন, সেদ্ধ সবজি, ভাত এবং সয়া সস দিন। উচ্চ আঁচে ৩-৪ মিনিট নাড়াচাড়া করুন।",
        "timestamp": "0:06:07"
      }
    ]
  },
  {
    "id": 17,
    "slug": "butter-garlic-naan-without-yeast-egg",
    "title_en": "Butter & Garlic Naan without Yeast or Egg",
    "title_bn": "ইস্ট ও ডিম ছাড়া বাটার এবং গার্লিক নান",
    "image": "https://i.ytimg.com/vi/mYEjb9KYlNE/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=mYEjb9KYlNE",
    "youtube_id": "mYEjb9KYlNE",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Medium",
    "prep_time": 45,
    "cook_time": 15,
    "servings": 8,
    "createdAt": "2026-01-06T01:34:49.004Z",
    "updatedAt": "2026-01-06T01:34:49.004Z",
    "blogContent": {
      "id": 17,
      "recipe_id": 17,
      "intro_en": "Learn how to make restaurant-style Butter and Garlic Naan at home without using yeast or eggs. This foolproof method ensures soft, fluffy, and delicious bread using a regular iron tawa on a gas stove.",
      "intro_bn": "ইস্ট বা ডিম ছাড়াই বাড়িতে রেস্টুরেন্ট স্টাইল বাটার এবং গার্লিক নান তৈরির সহজ পদ্ধতি শিখুন। গ্যাসের চুলায় সাধারণ লোহার চাটু ব্যবহার করে তৈরি হবে একদম নরম ও তুলতুলে নান।",
      "what_makes_it_special_en": "The combination of baking soda for crispness and baking powder for fluffiness creates the perfect texture. Using a mix of wheat flour and all-purpose flour prevents the naan from becoming too rubbery.",
      "what_makes_it_special_bn": "মুচমুচে ভাবের জন্য বেকিং সোডা এবং ফুলকো হওয়ার জন্য বেকিং পাউডারের সঠিক ব্যবহার এই রেসিপিকে অনন্য করে তোলে। আটা ও ময়দার মিশ্রণ নানকে অতিরিক্ত রাবারি হতে দেয় না।",
      "cooking_tips_en": "Always use an iron tawa with a handle for best results. Applying enough water to the back of the naan is crucial for it to stick while flipping the tawa over the flame.",
      "cooking_tips_bn": "সবচেয়ে ভালো ফলাফলের জন্য হাতলওয়ালা লোহার চাটু ব্যবহার করুন। নানের পেছনের পিঠে পর্যাপ্ত জল লাগানো জরুরি যাতে আগুনের ওপর উপুড় করার সময় নানটি পড়ে না যায়।",
      "serving_en": "Serve hot brushed with melted butter alongside Paneer Butter Masala, Chicken Curry, or Dal Makhani.",
      "serving_bn": "গরম গরম নানের ওপর মাখন ব্রাশ করে পনির বাটার মাসালা, চিকেন কারি বা ডাল মাখানির সাথে পরিবেশন করুন।",
      "storage_en": "Store in an airtight container wrapped in a clean cloth to keep them soft for a few hours.",
      "storage_bn": "পরিষ্কার কাপড়ে মুড়িয়ে এয়ারটাইট বক্সে রাখুন, এতে কয়েক ঘণ্টা পর্যন্ত নান নরম থাকবে।",
      "full_blog_en": "Craving restaurant-style naan but don't want to use yeast or eggs? This recipe is a game-changer for home cooks. By using a clever combination of yogurt, milk, and leavening agents, you can achieve that signature charred look and soft texture right on your gas stove. The addition of a small portion of whole wheat flour ensures the bread stays soft even after cooling. Whether you prefer the classic butter naan or the aromatic garlic version, the technique remains simple and accessible. The secret lies in the resting period and the use of water to mimic a traditional tandoor's sticking effect on an iron tawa. Perfect for weekend dinners or special guests!",
      "full_blog_bn": "রেস্টুরেন্টের মতো নান খেতে ইচ্ছে করছে কিন্তু ইস্ট বা ডিম ব্যবহার করতে চান না? এই রেসিপিটি আপনার জন্য সেরা সমাধান। দই, দুধ এবং বেকিং পাউডারের সঠিক সংমিশ্রণে আপনি আপনার গ্যাসের চুলাতেই তন্দুরি স্বাদ পাবেন। অল্প পরিমাণ আটা মেশানোর ফলে নানগুলো ঠান্ডা হওয়ার পরও শক্ত হয়ে যায় না। আপনি চাইলে সাধারণ বাটার নান বা সুগন্ধি গার্লিক নান—উভয়ই এই পদ্ধতিতে তৈরি করতে পারেন। মূল ট্রিকটি হলো ডো-কে পর্যাপ্ত সময় রেস্ট দেওয়া এবং লোহার চাটুতে জল ব্যবহার করে সেঁকা। ছুটির দিনের ডিনারে পনির বা মাংসের ঝোলের সাথে এটি দারুণ জমবে।"
    },
    "ingredients": [
      {
        "id": 148,
        "recipe_id": 17,
        "ingredient_id": 46,
        "quantity": "500",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "sifted",
        "notes_bn": "চেলে নেওয়া",
        "ingredient": {
          "id": 46,
          "name_en": "Ghee",
          "name_bn": "ঘি",
          "img": "https://images.unsplash.com/photo-1627308595229-7830a5ca91f3?auto=format&fit=crop&w=600&q=80",
          "phonetic": [
            "ghee",
            "ghi"
          ],
          "createdAt": "2026-01-06T01:34:34.249Z",
          "updatedAt": "2026-01-06T01:34:34.249Z"
        }
      },
      {
        "id": 149,
        "recipe_id": 17,
        "ingredient_id": 51,
        "quantity": "200",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "added to prevent rubbery texture",
        "notes_bn": "রাবারি টেক্সচার রোধ করতে",
        "ingredient": {
          "id": 51,
          "name_en": "Basmati Rice",
          "name_bn": "বাসমতি চাল",
          "img": "https://www.themealdb.com/images/ingredients/Basmati%20Rice.png",
          "phonetic": [
            "basmati rice",
            "baasmaati rice",
            "basmati ricee",
            "basmatee reece"
          ],
          "createdAt": "2026-01-06T01:34:36.537Z",
          "updatedAt": "2026-01-06T01:34:36.537Z"
        }
      },
      {
        "id": 150,
        "recipe_id": 17,
        "ingredient_id": 34,
        "quantity": "1",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "room temperature",
        "notes_bn": "স্বাভাবিক তাপমাত্রার",
        "ingredient": {
          "id": 34,
          "name_en": "Soy Milk",
          "name_bn": "সয়া দুধ",
          "img": "/ingredients/35_soy_milk.jpg",
          "phonetic": [
            "soy milk",
            "sooy milk",
            "soy meelk"
          ],
          "createdAt": "2026-01-06T01:34:26.646Z",
          "updatedAt": "2026-01-06T01:34:26.646Z"
        }
      },
      {
        "id": 151,
        "recipe_id": 17,
        "ingredient_id": 7,
        "quantity": "100",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "whisked",
        "notes_bn": "ফেটানো",
        "ingredient": {
          "id": 7,
          "name_en": "Green Chili",
          "name_bn": "কাঁচা মরিচ",
          "img": "https://www.themealdb.com/images/ingredients/Green%20Chili.png",
          "phonetic": [
            "kacha morich",
            "kachka morich",
            "morich"
          ],
          "createdAt": "2026-01-06T01:34:16.949Z",
          "updatedAt": "2026-01-06T01:34:16.949Z"
        }
      },
      {
        "id": 152,
        "recipe_id": 17,
        "ingredient_id": 67,
        "quantity": "1.5",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "dissolves easily",
        "notes_bn": "সহজে মিশে যায়",
        "ingredient": {
          "id": 67,
          "name_en": "Oyster Sauce",
          "name_bn": "অয়েস্টার সস",
          "img": "https://www.themealdb.com/images/ingredients/Oyster%20Sauce.png",
          "phonetic": [
            "oyster sauce",
            "oyster saauce",
            "ooyster sauce",
            "oysteer saucee"
          ],
          "createdAt": "2026-01-06T01:34:50.268Z",
          "updatedAt": "2026-01-06T01:34:50.268Z"
        }
      },
      {
        "id": 153,
        "recipe_id": 17,
        "ingredient_id": 47,
        "quantity": "1/2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for crispness",
        "notes_bn": "মুচমুচে ভাব আনার জন্য",
        "ingredient": {
          "id": 47,
          "name_en": "Fish Sauce",
          "name_bn": "ফিশ সস",
          "img": "https://www.themealdb.com/images/ingredients/Fish%20Sauce.png",
          "phonetic": [
            "fish sauce",
            "fish saauce",
            "fish saucee",
            "feesh sauce"
          ],
          "createdAt": "2026-01-06T01:34:34.786Z",
          "updatedAt": "2026-01-06T01:34:34.786Z"
        }
      },
      {
        "id": 154,
        "recipe_id": 17,
        "ingredient_id": 48,
        "quantity": "1/2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "for fluffiness",
        "notes_bn": "ফুলকো করার জন্য",
        "ingredient": {
          "id": 48,
          "name_en": "Sesame Oil",
          "name_bn": "তিল তেল",
          "img": "/ingredients/61_sesame_oil.png",
          "phonetic": [
            "sesame oil",
            "sesaame oil",
            "sesame ooil",
            "seesamee oil"
          ],
          "createdAt": "2026-01-06T01:34:34.968Z",
          "updatedAt": "2026-01-06T01:34:34.968Z"
        }
      },
      {
        "id": 155,
        "recipe_id": 17,
        "ingredient_id": 8,
        "quantity": "2.5",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "for the dough",
        "notes_bn": "ডো তৈরির জন্য",
        "ingredient": {
          "id": 8,
          "name_en": "Tomato",
          "name_bn": "টমেটো",
          "img": "https://www.themealdb.com/images/ingredients/Tomato.png",
          "phonetic": [
            "tomato",
            "tamato",
            "tometo"
          ],
          "createdAt": "2026-01-06T01:34:17.123Z",
          "updatedAt": "2026-01-06T01:34:17.123Z"
        }
      },
      {
        "id": 156,
        "recipe_id": 17,
        "ingredient_id": 18,
        "quantity": "2",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "finely chopped",
        "notes_bn": "মিহি কুচি করা",
        "ingredient": {
          "id": 18,
          "name_en": "Cumin",
          "name_bn": "জিরা",
          "img": "https://www.themealdb.com/images/ingredients/Cumin.png",
          "phonetic": [
            "jeera",
            "jira",
            "zira"
          ],
          "createdAt": "2026-01-06T01:34:19.973Z",
          "updatedAt": "2026-01-06T01:34:19.973Z"
        }
      },
      {
        "id": 157,
        "recipe_id": 17,
        "ingredient_id": 35,
        "quantity": "50",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "melted for brushing",
        "notes_bn": "ব্রাশ করার জন্য গলানো",
        "ingredient": {
          "id": 35,
          "name_en": "Tofu",
          "name_bn": "টোফু",
          "img": "https://www.themealdb.com/images/ingredients/Tofu.png",
          "phonetic": [
            "tofu",
            "toofu",
            "tofoo"
          ],
          "createdAt": "2026-01-06T01:34:26.833Z",
          "updatedAt": "2026-01-06T01:34:26.833Z"
        }
      }
    ],
    "steps": [
      {
        "id": 125,
        "recipe_id": 17,
        "step_number": 3,
        "instruction_en": "Knead the dough for 10-12 minutes until it becomes smooth and stops sticking to your hands. Apply a little oil, cover, and rest for 15 minutes.",
        "instruction_bn": "ডোটিকে ১০-১২ মিনিট ধরে ঠাসুন যতক্ষণ না এটি মসৃণ হয়। সামান্য তেল মাখিয়ে ১৫ মিনিট ঢেকে রাখুন।",
        "timestamp": "0:02:35"
      },
      {
        "id": 123,
        "recipe_id": 17,
        "step_number": 1,
        "instruction_en": "In a large bowl, mix milk, yogurt, powdered sugar, salt, water, and oil thoroughly before adding dry ingredients.",
        "instruction_bn": "একটি বড় বোলে দুধ, টক দই, গুঁড়ো চিনি, নুন, জল এবং তেল দিয়ে ভালো করে মিশিয়ে নিন।",
        "timestamp": "0:01:10"
      },
      {
        "id": 124,
        "recipe_id": 17,
        "step_number": 2,
        "instruction_en": "Sift the maida, atta, baking soda, and baking powder into the liquid mixture. Mix with a spatula until a rough dough forms.",
        "instruction_bn": "তরল মিশ্রণের ওপর ময়দা, আটা, বেকিং সোডা এবং বেকিং পাউডার চেলে নিন এবং স্প্যাচুলা দিয়ে মেশান।",
        "timestamp": "0:01:40"
      },
      {
        "id": 126,
        "recipe_id": 17,
        "step_number": 4,
        "instruction_en": "Divide the dough into 8 equal balls. Roll them into smooth rounds and let them rest again for 15 minutes to ensure softness.",
        "instruction_bn": "ডোটি থেকে ৮টি লেচি কেটে গোল করে নিন এবং পুনরায় ১৫ মিনিটের জন্য রেস্টে রাখুন।",
        "timestamp": "0:03:41"
      },
      {
        "id": 127,
        "recipe_id": 17,
        "step_number": 5,
        "instruction_en": "Roll a ball into an oval shape using some dry flour. Sprinkle nigella seeds and coriander leaves, then press them in with a rolling pin.",
        "instruction_bn": "শুকনো ময়দা দিয়ে লেচিটি ডিম্বাকৃতি করে বেলে নিন। ওপরে কালোজিরে ও ধনেপাতা ছিটিয়ে বেলুন দিয়ে চেপে দিন।",
        "timestamp": "0:05:15"
      },
      {
        "id": 128,
        "recipe_id": 17,
        "step_number": 6,
        "instruction_en": "Flip the naan and apply water generously on the back side. This helps it stick to the iron tawa.",
        "instruction_bn": "নানটি উল্টে নিয়ে পেছনের পিঠে ভালো করে জল লাগিয়ে নিন যাতে এটি চাটুতে আটকে থাকে।",
        "timestamp": "0:05:45"
      },
      {
        "id": 129,
        "recipe_id": 17,
        "step_number": 7,
        "instruction_en": "Place the water-side down on a hot iron tawa. Prick with a fork to prevent over-puffing. Cook for 1.5 minutes.",
        "instruction_bn": "গরম চাটুতে জলের দিকটি দিয়ে বসিয়ে দিন। কাঁটা চামচ দিয়ে ফুটো করে দিন এবং দেড় মিনিট সেঁকুন।",
        "timestamp": "0:06:03"
      },
      {
        "id": 130,
        "recipe_id": 17,
        "step_number": 8,
        "instruction_en": "Flip the tawa over the direct gas flame and rotate it to cook the top side until golden brown spots appear.",
        "instruction_bn": "চাটুটিকে আগুনের ওপর উপুড় করে ধরুন এবং ঘুরিয়ে ঘুরিয়ে ওপরের পিঠটি সোনালী করে সেঁকে নিন।",
        "timestamp": "0:06:17"
      },
      {
        "id": 131,
        "recipe_id": 17,
        "step_number": 9,
        "instruction_en": "Remove from tawa and brush with melted butter. For garlic naan, add chopped garlic along with coriander leaves while rolling.",
        "instruction_bn": "চাটু থেকে নামিয়ে গলানো মাখন ব্রাশ করুন। গার্লিক নানের জন্য বেলার সময় রসুন কুচি ও ধনেপাতা ব্যবহার করুন।",
        "timestamp": "0:07:08"
      }
    ]
  },
  {
    "id": 18,
    "slug": "palong-chingri-recipe-spinach-with-prawns",
    "title_en": "Bengali Style Palong Chingri (Spinach with Prawns)",
    "title_bn": "চিংড়ি মাছ দিয়ে পালং শাক রান্না (পালং চিংড়ি)",
    "image": "https://i.ytimg.com/vi/lUl3NIZSF4w/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=lUl3NIZSF4w",
    "youtube_id": "lUl3NIZSF4w",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 15,
    "cook_time": 20,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:51.029Z",
    "updatedAt": "2026-01-06T01:34:51.029Z",
    "blogContent": {
      "id": 18,
      "recipe_id": 18,
      "intro_en": "Palong Chingri is a classic Bengali delicacy that combines the earthiness of fresh spinach with the sweet, succulent taste of prawns. It's a nutritious and flavorful dish that perfectly represents the simplicity of Bengali home cooking.",
      "intro_bn": "পালং চিংড়ি একটি জনপ্রিয় বাঙালি খাবার যা তাজা পালং শাকের মাটির গন্ধ এবং চিংড়ি মাছের মিষ্টি স্বাদের এক অপূর্ব সংমিশ্রণ। এটি একটি পুষ্টিকর এবং সুস্বাদু খাবার যা বাঙালি ঘরোয়া রান্নার সারল্যকে তুলে ধরে।",
      "what_makes_it_special_en": "The combination of iron-rich spinach and protein-packed prawns makes this dish a health powerhouse. The subtle use of roasted cumin at the end elevates the aroma to a professional level.",
      "what_makes_it_special_bn": "আয়রন সমৃদ্ধ পালং শাক এবং প্রোটিনে ঠাসা চিংড়ি মাছের সমন্বয় এই খাবারটিকে অত্যন্ত স্বাস্থ্যকর করে তোলে। রান্নার শেষে ভাজা জিরার গুঁড়ার ব্যবহার এর সুগন্ধকে এক অন্য মাত্রায় নিয়ে যায়।",
      "cooking_tips_en": "Do not overcook the prawns as they can become rubbery. Also, spinach releases a lot of water, so avoid adding extra water during the process.",
      "cooking_tips_bn": "চিংড়ি মাছ খুব বেশি সময় রান্না করবেন না, এতে মাছ শক্ত হয়ে যেতে পারে। এছাড়া পালং শাক থেকে অনেক পানি বের হয়, তাই রান্নার সময় আলাদা পানি না দেওয়াই ভালো।",
      "serving_en": "This dish is best served hot with a plate of steamed Basmati or Atap rice. A wedge of lime on the side enhances the flavors.",
      "serving_bn": "গরম ধোঁয়া ওঠা বাসমতি বা আতপ চালের ভাতের সাথে এটি সবচেয়ে ভালো লাগে। সাথে এক টুকরো লেবু এর স্বাদ আরও বাড়িয়ে দেয়।",
      "storage_en": "Can be stored in an airtight container in the refrigerator for up to 2 days. Reheat gently on the stovetop before serving.",
      "storage_bn": "একটি এয়ারটাইট পাত্রে ভরে ফ্রিজে ২ দিন পর্যন্ত সংরক্ষণ করা যাবে। খাওয়ার আগে চুলার হালকা আঁচে গরম করে নিন।",
      "full_blog_en": "In the heart of Bengali cuisine, vegetables and proteins are often paired to create balanced meals. Palong Chingri is a prime example of this philosophy. This recipe focuses on keeping the spinach vibrant while ensuring the prawns are tender. Starting with a base of sautéed onions and a blend of aromatic Indian spices like turmeric and cumin, the dish builds layers of flavor. The key is in 'Koshano' or slow-frying the spices until the oil separates. This ensures the raw smell of ginger and garlic is completely gone.\n\nOnce the prawns are added, they soak up the spicy base before the spinach is introduced. Spinach cooks very quickly and wilts down significantly, releasing its natural juices. Covering the pan allows the flavors to meld together. Finishing with fresh coriander and roasted cumin powder is a traditional touch that provides a refreshing end-note. Whether you are a seasoned cook or a beginner, this recipe is foolproof and yields restaurant-quality results at home.",
      "full_blog_bn": "বাঙালি রান্নার ঐতিহ্যে শাকসবজি এবং আমিষের সংমিশ্রণে সুষম খাবার তৈরির রীতি বহুদিনের। পালং চিংড়ি এই দর্শনের একটি অন্যতম উদাহরণ। এই রেসিপিটিতে পালং শাকের সতেজতা বজায় রাখার পাশাপাশি চিংড়ি মাছের কোমলতা নিশ্চিত করা হয়েছে। পেঁয়াজ কুচি এবং হলুদ-জিরার মতো সুগন্ধি মশলার মাধ্যমে রান্নার শুরুতেই স্বাদের একটি মজবুত ভিত্তি তৈরি হয়। মশলা ভালো করে কষানো বা 'কষানো' এই রান্নার প্রধান রহস্য, যা আদা-রসুনের কাঁচা গন্ধ দূর করে।\n\nচিংড়ি মাছগুলো মশলার সাথে মিশে যাওয়ার পর পালং শাক যোগ করা হয়। পালং শাক খুব দ্রুত সিদ্ধ হয় এবং এর নিজস্ব পানি বের করে দেয়, যা তরকারিকে আরও স্বাদযুক্ত করে। ঢাকনা দিয়ে রান্না করলে সব উপকরণের স্বাদ একে অপরের সাথে ভালোভাবে মিশে যায়। শেষে তাজা ধনে পাতা এবং ভাজা জিরার গুঁড়া যোগ করা একটি ঐতিহ্যবাহী পদ্ধতি যা খাবারে সতেজ ভাব আনে। আপনি নতুন রাঁধুনি হোন বা অভিজ্ঞ, এই সহজ পদ্ধতি অনুসরণ করে ঘরেই তৈরি করতে পারেন সেরা স্বাদের পালং চিংড়ি।"
    },
    "ingredients": [
      {
        "id": 158,
        "recipe_id": 18,
        "ingredient_id": 4,
        "quantity": "2",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "freshly chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 4,
          "name_en": "Onion",
          "name_bn": "পেঁয়াজ",
          "img": "https://www.themealdb.com/images/ingredients/Onion.png",
          "phonetic": [
            "piaz",
            "piyaz",
            "peaj",
            "peyaj"
          ],
          "createdAt": "2026-01-06T01:34:16.425Z",
          "updatedAt": "2026-01-06T01:34:16.425Z"
        }
      },
      {
        "id": 159,
        "recipe_id": 18,
        "ingredient_id": 8,
        "quantity": "3",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "for frying and cooking",
        "notes_bn": "রান্নার জন্য",
        "ingredient": {
          "id": 8,
          "name_en": "Tomato",
          "name_bn": "টমেটো",
          "img": "https://www.themealdb.com/images/ingredients/Tomato.png",
          "phonetic": [
            "tomato",
            "tamato",
            "tometo"
          ],
          "createdAt": "2026-01-06T01:34:17.123Z",
          "updatedAt": "2026-01-06T01:34:17.123Z"
        }
      },
      {
        "id": 160,
        "recipe_id": 18,
        "ingredient_id": 68,
        "quantity": "500",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "freshly chopped and washed",
        "notes_bn": "তাজা কুচি করা এবং ধোয়া",
        "ingredient": {
          "id": 68,
          "name_en": "Mint",
          "name_bn": "পুদিনা পাতা",
          "img": "https://www.themealdb.com/images/ingredients/Mint.png",
          "phonetic": [
            "mint",
            "meent"
          ],
          "createdAt": "2026-01-06T01:34:51.908Z",
          "updatedAt": "2026-01-06T01:34:51.908Z"
        }
      },
      {
        "id": 161,
        "recipe_id": 18,
        "ingredient_id": 69,
        "quantity": "250",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "cleaned and deveined",
        "notes_bn": "পরিষ্কার করা",
        "ingredient": {
          "id": 69,
          "name_en": "Thyme",
          "name_bn": "থাইম",
          "img": "https://www.themealdb.com/images/ingredients/Thyme.png",
          "phonetic": [
            "thyme",
            "thymee"
          ],
          "createdAt": "2026-01-06T01:34:52.080Z",
          "updatedAt": "2026-01-06T01:34:52.080Z"
        }
      },
      {
        "id": 162,
        "recipe_id": 18,
        "ingredient_id": 10,
        "quantity": "1/2",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 10,
          "name_en": "Rice",
          "name_bn": "চাল",
          "img": "https://www.themealdb.com/images/ingredients/Rice.png",
          "phonetic": [
            "chal",
            "chaal",
            "bhat"
          ],
          "createdAt": "2026-01-06T01:34:17.472Z",
          "updatedAt": "2026-01-06T01:34:17.472Z"
        }
      },
      {
        "id": 163,
        "recipe_id": 18,
        "ingredient_id": 2,
        "quantity": "1",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "fresh paste",
        "notes_bn": "তাজা বাটা",
        "ingredient": {
          "id": 2,
          "name_en": "Beef",
          "name_bn": "গরুর মাংস",
          "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Raw_beef_steak.jpg/640px-Raw_beef_steak.jpg",
          "phonetic": [
            "gorur mangsho",
            "gorur mangso",
            "mangsho",
            "beef"
          ],
          "createdAt": "2026-01-06T01:34:16.068Z",
          "updatedAt": "2026-01-06T01:34:16.068Z"
        }
      },
      {
        "id": 164,
        "recipe_id": 18,
        "ingredient_id": 5,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "pure powder",
        "notes_bn": "গুঁড়া",
        "ingredient": {
          "id": 5,
          "name_en": "Garlic",
          "name_bn": "রসুন",
          "img": "https://www.themealdb.com/images/ingredients/Garlic.png",
          "phonetic": [
            "rosun",
            "roshun",
            "rasun"
          ],
          "createdAt": "2026-01-06T01:34:16.608Z",
          "updatedAt": "2026-01-06T01:34:16.608Z"
        }
      },
      {
        "id": 165,
        "recipe_id": 18,
        "ingredient_id": 70,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "adjust to taste",
        "notes_bn": "স্বাদমতো",
        "ingredient": {
          "id": 70,
          "name_en": "Basil",
          "name_bn": "তুলসী পাতা/বেসিল",
          "img": "https://www.themealdb.com/images/ingredients/Basil.png",
          "phonetic": [
            "basil",
            "baasil",
            "baseel"
          ],
          "createdAt": "2026-01-06T01:34:52.605Z",
          "updatedAt": "2026-01-06T01:34:52.605Z"
        }
      },
      {
        "id": 166,
        "recipe_id": 18,
        "ingredient_id": 71,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "roasted preferred",
        "notes_bn": "ভাজা জিরার গুঁড়া",
        "ingredient": {
          "id": 71,
          "name_en": "Rosemary",
          "name_bn": "রোজমেরি",
          "img": "https://www.themealdb.com/images/ingredients/Rosemary.png",
          "phonetic": [
            "rosemary",
            "rosemaary",
            "roosemary",
            "roseemary"
          ],
          "createdAt": "2026-01-06T01:34:52.777Z",
          "updatedAt": "2026-01-06T01:34:52.777Z"
        }
      },
      {
        "id": 167,
        "recipe_id": 18,
        "ingredient_id": 72,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "ground coriander",
        "notes_bn": "গুঁড়া",
        "ingredient": {
          "id": 72,
          "name_en": "Oregano",
          "name_bn": "অরিগানো",
          "img": "https://www.themealdb.com/images/ingredients/Oregano.png",
          "phonetic": [
            "oregano",
            "oregaano",
            "ooreganoo",
            "oreegano"
          ],
          "createdAt": "2026-01-06T01:34:52.954Z",
          "updatedAt": "2026-01-06T01:34:52.954Z"
        }
      },
      {
        "id": 168,
        "recipe_id": 18,
        "ingredient_id": 73,
        "quantity": "4-5",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "slit lengthwise",
        "notes_bn": "মাঝখানে চেরা",
        "ingredient": {
          "id": 73,
          "name_en": "Red Pepper Flakes",
          "name_bn": "চিলি ফ্লেক্স",
          "img": "https://www.themealdb.com/images/ingredients/Red%20Pepper%20Flakes.png",
          "phonetic": [
            "red pepper flakes",
            "red pepper flaakes",
            "reed peeppeer flakees"
          ],
          "createdAt": "2026-01-06T01:34:53.132Z",
          "updatedAt": "2026-01-06T01:34:53.132Z"
        }
      }
    ],
    "steps": [
      {
        "id": 132,
        "recipe_id": 18,
        "step_number": 1,
        "instruction_en": "Heat oil in a pan and sauté the chopped onions until they turn light brown.",
        "instruction_bn": "একটি প্যানে তেল গরম করে কুচানো পেঁয়াজগুলো হালকা বাদামী হওয়া পর্যন্ত ভাজুন।",
        "timestamp": "0:25"
      },
      {
        "id": 133,
        "recipe_id": 18,
        "step_number": 2,
        "instruction_en": "Add ginger-garlic paste and sauté for a minute until the raw smell disappears.",
        "instruction_bn": "আদা-রসুন বাটা যোগ করুন এবং কাঁচা গন্ধ চলে না যাওয়া পর্যন্ত এক মিনিট ভাজুন।",
        "timestamp": "0:44"
      },
      {
        "id": 134,
        "recipe_id": 18,
        "step_number": 3,
        "instruction_en": "Add turmeric powder, coriander powder, cumin powder, and red chili powder. Add a splash of water to prevent the spices from burning and cook the masala well.",
        "instruction_bn": "হলুদ গুঁড়া, ধনিয়া গুঁড়া, জিরা গুঁড়া এবং লাল মরিচের গুঁড়া যোগ করুন। মশলা যেন পুড়ে না যায় তাই সামান্য পানি দিয়ে মশলাটি ভালো করে কষিয়ে নিন।",
        "timestamp": "0:56"
      },
      {
        "id": 135,
        "recipe_id": 18,
        "step_number": 4,
        "instruction_en": "Add the cleaned prawns to the masala and cook for 3-4 minutes until they are partially done.",
        "instruction_bn": "পরিষ্কার করা চিংড়ি মাছগুলো মশলায় দিয়ে দিন এবং আধা-সিদ্ধ হওয়া পর্যন্ত ৩-৪ মিনিট রান্না করুন।",
        "timestamp": "1:35"
      },
      {
        "id": 136,
        "recipe_id": 18,
        "step_number": 5,
        "instruction_en": "Now add the chopped spinach and green chillies. Mix everything well, cover the pan, and cook for 5 minutes.",
        "instruction_bn": "এবার কুচানো পালং শাক এবং কাঁচা মরিচ দিয়ে দিন। সবকিছু ভালো করে মিশিয়ে প্যানটি ঢেকে দিন এবং ৫ মিনিট রান্না করুন।",
        "timestamp": "2:10"
      },
      {
        "id": 137,
        "recipe_id": 18,
        "step_number": 6,
        "instruction_en": "Open the lid, add freshly chopped coriander leaves and a sprinkle of roasted cumin powder. Simmer for another 2-3 minutes until the water evaporates and oil separates.",
        "instruction_bn": "ঢাকনা খুলে তাজা ধনে পাতা কুচি এবং ভাজা জিরার গুঁড়া ছড়িয়ে দিন। পানি শুকিয়ে তেল উপরে উঠে আসা পর্যন্ত আরও ২-৩ মিনিট অল্প আঁচে রান্না করুন।",
        "timestamp": "2:57"
      }
    ]
  },
  {
    "id": 19,
    "slug": "palong-shaak-dal-bengali-spinach-lentil-curry",
    "title_en": "Bengali Spinach and Red Lentil Curry (Palong Shak Dal)",
    "title_bn": "মসুর ডাল দিয়ে পালং শাক রান্না (পালং শাক ডাল)",
    "image": "https://i.ytimg.com/vi/U1xZiS4NQ-E/maxresdefault.jpg",
    "youtube_url": "https://www.youtube.com/watch?v=U1xZiS4NQ-E",
    "youtube_id": "U1xZiS4NQ-E",
    "cuisine": "Indian",
    "category": "Main Course",
    "foodCategory": "Savory",
    "difficulty": "Easy",
    "prep_time": 15,
    "cook_time": 25,
    "servings": 4,
    "createdAt": "2026-01-06T01:34:53.328Z",
    "updatedAt": "2026-01-06T01:34:53.328Z",
    "blogContent": {
      "id": 19,
      "recipe_id": 19,
      "intro_en": "Palong Shak Dal is a comforting and nutritious Bengali dish that combines fresh spinach with creamy red lentils. This one-pot meal is a staple in Bengali households, offering a perfect balance of protein and vitamins.",
      "intro_bn": "পালং শাক ডাল একটি অত্যন্ত আরামদায়ক এবং পুষ্টিকর বাঙালি খাবার, যাতে তাজা পালং শাক এবং মসুর ডালের অপূর্ব স্বাদ পাওয়া যায়। এটি একটি সুষম খাবার যা প্রোটিন এবং ভিটামিনের চমৎকার উৎস।",
      "what_makes_it_special_en": "The secret to this dish's irresistible taste is the 'Bagar' or tempering at the end. Frying garlic and dry chillies until golden brown creates a smoky, aromatic profile that transforms simple lentils into a gourmet experience.",
      "what_makes_it_special_bn": "এই খাবারের অসাধারণ স্বাদের আসল রহস্য হলো রান্নার শেষে দেওয়া 'বাগাড়'। রসুন এবং শুকনা মরিচ বাদামী করে ভেজে শাকে দেওয়ার ফলে যে ধোঁয়াটে সুগন্ধ তৈরি হয়, তা ডালের স্বাদ বহুগুণ বাড়িয়ে দেয়।",
      "cooking_tips_en": "Don't overcook the spinach to maintain its vibrant green color and nutrients. If you prefer a thinner dal, add a bit of warm water after the lentils are cooked but before adding the spinach.",
      "cooking_tips_bn": "পালং শাকের উজ্জ্বল সবুজ রঙ এবং পুষ্টিগুণ বজায় রাখতে খুব বেশি সময় রান্না করবেন না। আপনি যদি ডাল একটু পাতলা খেতে পছন্দ করেন, তবে ডাল সিদ্ধ হওয়ার পর সামান্য গরম পানি যোগ করতে পারেন।",
      "serving_en": "This dish is best enjoyed with hot steamed rice. It also pairs wonderfully with handmade rotis or parathas for a wholesome lunch or dinner.",
      "serving_bn": "গরম ধোঁয়া ওঠা ভাতের সাথে এই পালং শাক ডাল সবচেয়ে ভালো লাগে। এছাড়া রুটি বা পরোটার সাথেও এটি দারুণ মানিয়ে যায়।",
      "storage_en": "Store leftovers in an airtight container in the refrigerator for up to 2 days. Reheat on the stovetop with a splash of water to restore the consistency.",
      "storage_bn": "অবশিষ্ট খাবারটি একটি এয়ারটাইট পাত্রে ভরে ফ্রিজে ২ দিন পর্যন্ত রাখতে পারেন। খাওয়ার আগে সামান্য পানি দিয়ে চুলায় গরম করে নিন।",
      "full_blog_en": "Bengali cuisine is renowned for its ingenious ways of preparing leafy greens, and Palong Shak Dal stands as a testament to this culinary tradition. This dish brings together the earthiness of red lentils (Masoor Dal) and the nutritional powerhouse that is spinach. The preparation starts by creating a flavorful base with aromatic spices like turmeric, coriander, and roasted cumin. The lentils are cooked until tender, providing a creamy backdrop for the fresh greens.\n\nWhat truly elevates this recipe is the technique of tempering, known as 'Bagar' in Bengali. By frying garlic, onions, and whole dried chillies in oil until they reach a deep golden hue, we infuse the entire dish with a rich, smoky flavor. The final result is a thick, hearty curry that is both satisfying and incredibly healthy. Whether you're looking for a quick weekday lunch or a nutritious side dish, this spinach-dal combo is sure to become a favorite in your kitchen.",
      "full_blog_bn": "বাঙালি রান্নায় শাক রান্নার হরেক রকম পদের মধ্যে পালং শাক ডাল একটি অনন্য স্থান দখল করে আছে। এই পদটি মসুর ডালের ঘন গঠন এবং পালং শাকের পুষ্টিগুণকে এক সুতোয় গেঁথে দেয়। রান্নার শুরুতে হলুদ, ধনিয়া এবং ভাজা জিরার মতো মসলা দিয়ে ডাল কষানো হয়, যা রান্নার ভিত্তি তৈরি করে। ডালটি যখন পুরোপুরি গলে যায়, তখন তাজা পালং শাকের সাথে মিলে এক চমৎকার টেক্সচার তৈরি করে।\n\nএই রেসিপিটির আসল বিশেষত্ব হলো এর বাগাড় দেওয়ার পদ্ধতি। গরম তেলে রসুন, পেঁয়াজ এবং শুকনা মরিচ গাঢ় করে ভেজে ডালে মেশালে যে রাজকীয় সুগন্ধ আসে, তা যে কারোর জিভে পানি আনতে বাধ্য। এটি যেমন সুস্বাদু, তেমনি তৈরি করাও অত্যন্ত সহজ। দুপুরের গরম ভাতের সাথে এই পালং শাক ডাল থাকলে আর অন্য পদের প্রয়োজন হয় না। স্বাস্থ্য সচেতন এবং ভোজনরসিক উভয়ের জন্যই এটি একটি আদর্শ রেসিপি।"
    },
    "ingredients": [
      {
        "id": 169,
        "recipe_id": 19,
        "ingredient_id": 68,
        "quantity": "500",
        "unit_en": "grams",
        "unit_bn": "গ্রাম",
        "notes_en": "freshly chopped",
        "notes_bn": "তাজা কুচি করা",
        "ingredient": {
          "id": 68,
          "name_en": "Mint",
          "name_bn": "পুদিনা পাতা",
          "img": "https://www.themealdb.com/images/ingredients/Mint.png",
          "phonetic": [
            "mint",
            "meent"
          ],
          "createdAt": "2026-01-06T01:34:51.908Z",
          "updatedAt": "2026-01-06T01:34:51.908Z"
        }
      },
      {
        "id": 170,
        "recipe_id": 19,
        "ingredient_id": 74,
        "quantity": "1/2",
        "unit_en": "cup",
        "unit_bn": "কাপ",
        "notes_en": "washed and drained",
        "notes_bn": "ধোয়া এবং পানি ঝরানো",
        "ingredient": {
          "id": 74,
          "name_en": "Mozzarella",
          "name_bn": "মোজারেলা চিজ",
          "img": "https://www.themealdb.com/images/ingredients/Mozzarella.png",
          "phonetic": [
            "mozzarella",
            "mozzaarellaa",
            "moozzarella",
            "mozzareella"
          ],
          "createdAt": "2026-01-06T01:34:54.179Z",
          "updatedAt": "2026-01-06T01:34:54.179Z"
        }
      },
      {
        "id": 171,
        "recipe_id": 19,
        "ingredient_id": 10,
        "quantity": "2",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "medium sized, sliced",
        "notes_bn": "মাঝারি সাইজ, কুচি করা",
        "ingredient": {
          "id": 10,
          "name_en": "Rice",
          "name_bn": "চাল",
          "img": "https://www.themealdb.com/images/ingredients/Rice.png",
          "phonetic": [
            "chal",
            "chaal",
            "bhat"
          ],
          "createdAt": "2026-01-06T01:34:17.472Z",
          "updatedAt": "2026-01-06T01:34:17.472Z"
        }
      },
      {
        "id": 172,
        "recipe_id": 19,
        "ingredient_id": 18,
        "quantity": "4-5",
        "unit_en": "cloves",
        "unit_bn": "কোয়া",
        "notes_en": "chopped",
        "notes_bn": "কুচি করা",
        "ingredient": {
          "id": 18,
          "name_en": "Cumin",
          "name_bn": "জিরা",
          "img": "https://www.themealdb.com/images/ingredients/Cumin.png",
          "phonetic": [
            "jeera",
            "jira",
            "zira"
          ],
          "createdAt": "2026-01-06T01:34:19.973Z",
          "updatedAt": "2026-01-06T01:34:19.973Z"
        }
      },
      {
        "id": 173,
        "recipe_id": 19,
        "ingredient_id": 5,
        "quantity": "1/2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "pure turmeric",
        "notes_bn": "হলুদ গুঁড়া",
        "ingredient": {
          "id": 5,
          "name_en": "Garlic",
          "name_bn": "রসুন",
          "img": "https://www.themealdb.com/images/ingredients/Garlic.png",
          "phonetic": [
            "rosun",
            "roshun",
            "rasun"
          ],
          "createdAt": "2026-01-06T01:34:16.608Z",
          "updatedAt": "2026-01-06T01:34:16.608Z"
        }
      },
      {
        "id": 174,
        "recipe_id": 19,
        "ingredient_id": 70,
        "quantity": "1/2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "adjust to spice level",
        "notes_bn": "স্বাদমতো",
        "ingredient": {
          "id": 70,
          "name_en": "Basil",
          "name_bn": "তুলসী পাতা/বেসিল",
          "img": "https://www.themealdb.com/images/ingredients/Basil.png",
          "phonetic": [
            "basil",
            "baasil",
            "baseel"
          ],
          "createdAt": "2026-01-06T01:34:52.605Z",
          "updatedAt": "2026-01-06T01:34:52.605Z"
        }
      },
      {
        "id": 175,
        "recipe_id": 19,
        "ingredient_id": 72,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "aromatic coriander",
        "notes_bn": "ধনিয়া গুঁড়া",
        "ingredient": {
          "id": 72,
          "name_en": "Oregano",
          "name_bn": "অরিগানো",
          "img": "https://www.themealdb.com/images/ingredients/Oregano.png",
          "phonetic": [
            "oregano",
            "oregaano",
            "ooreganoo",
            "oreegano"
          ],
          "createdAt": "2026-01-06T01:34:52.954Z",
          "updatedAt": "2026-01-06T01:34:52.954Z"
        }
      },
      {
        "id": 176,
        "recipe_id": 19,
        "ingredient_id": 71,
        "quantity": "1/2",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "roasted powder",
        "notes_bn": "ভাজা জিরার গুঁড়া",
        "ingredient": {
          "id": 71,
          "name_en": "Rosemary",
          "name_bn": "রোজমেরি",
          "img": "https://www.themealdb.com/images/ingredients/Rosemary.png",
          "phonetic": [
            "rosemary",
            "rosemaary",
            "roosemary",
            "roseemary"
          ],
          "createdAt": "2026-01-06T01:34:52.777Z",
          "updatedAt": "2026-01-06T01:34:52.777Z"
        }
      },
      {
        "id": 177,
        "recipe_id": 19,
        "ingredient_id": 73,
        "quantity": "2",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "slit",
        "notes_bn": "মাঝখানে চেরা",
        "ingredient": {
          "id": 73,
          "name_en": "Red Pepper Flakes",
          "name_bn": "চিলি ফ্লেক্স",
          "img": "https://www.themealdb.com/images/ingredients/Red%20Pepper%20Flakes.png",
          "phonetic": [
            "red pepper flakes",
            "red pepper flaakes",
            "reed peeppeer flakees"
          ],
          "createdAt": "2026-01-06T01:34:53.132Z",
          "updatedAt": "2026-01-06T01:34:53.132Z"
        }
      },
      {
        "id": 178,
        "recipe_id": 19,
        "ingredient_id": 75,
        "quantity": "3",
        "unit_en": "pieces",
        "unit_bn": "টি",
        "notes_en": "for tempering",
        "notes_bn": "বাগাড়ের জন্য",
        "ingredient": {
          "id": 75,
          "name_en": "Parmesan",
          "name_bn": "পারমেজান চিজ",
          "img": "https://www.themealdb.com/images/ingredients/Parmesan.png",
          "phonetic": [
            "parmesan",
            "paarmesaan",
            "parmeesan"
          ],
          "createdAt": "2026-01-06T01:34:55.163Z",
          "updatedAt": "2026-01-06T01:34:55.163Z"
        }
      },
      {
        "id": 179,
        "recipe_id": 19,
        "ingredient_id": 8,
        "quantity": "3",
        "unit_en": "tbsp",
        "unit_bn": "টেবিল চামচ",
        "notes_en": "divided",
        "notes_bn": "দুই ভাগে ব্যবহার্য",
        "ingredient": {
          "id": 8,
          "name_en": "Tomato",
          "name_bn": "টমেটো",
          "img": "https://www.themealdb.com/images/ingredients/Tomato.png",
          "phonetic": [
            "tomato",
            "tamato",
            "tometo"
          ],
          "createdAt": "2026-01-06T01:34:17.123Z",
          "updatedAt": "2026-01-06T01:34:17.123Z"
        }
      },
      {
        "id": 180,
        "recipe_id": 19,
        "ingredient_id": 12,
        "quantity": "1",
        "unit_en": "tsp",
        "unit_bn": "চা চামচ",
        "notes_en": "adjust to taste",
        "notes_bn": "স্বাদমতো",
        "ingredient": {
          "id": 12,
          "name_en": "Milk",
          "name_bn": "দুধ",
          "img": "https://www.themealdb.com/images/ingredients/Milk.png",
          "phonetic": [
            "dud",
            "dudh",
            "doodh"
          ],
          "createdAt": "2026-01-06T01:34:17.817Z",
          "updatedAt": "2026-01-06T01:34:17.817Z"
        }
      }
    ],
    "steps": [
      {
        "id": 138,
        "recipe_id": 19,
        "step_number": 1,
        "instruction_en": "Wash 1/2 cup of red lentils thoroughly and set aside.",
        "instruction_bn": "১/২ কাপ মসুর ডাল ভালো করে ধুয়ে একপাশে সরিয়ে রাখুন।",
        "timestamp": "0:33"
      },
      {
        "id": 139,
        "recipe_id": 19,
        "step_number": 2,
        "instruction_en": "Heat 2 tablespoons of oil in a pan. Sauté chopped onion and garlic until they soften. Add turmeric, chilli powder, coriander powder, roasted cumin powder, and salt. Mix well.",
        "instruction_bn": "একটি প্যানে ২ টেবিল চামচ তেল গরম করুন। এতে পেঁয়াজ ও রসুন কুচি দিয়ে কিছুক্ষণ ভাজুন। এরপর হলুদ, মরিচ গুঁড়া, ধনিয়া গুঁড়া, ভাজা জিরার গুঁড়া এবং লবণ যোগ করে ভালো করে মিশিয়ে নিন।",
        "timestamp": "0:47"
      },
      {
        "id": 140,
        "recipe_id": 19,
        "step_number": 3,
        "instruction_en": "Add the washed lentils to the spice mixture and sauté for a few minutes. Add 1 cup of water and cook until the lentils are almost done.",
        "instruction_bn": "মশলার মিশ্রণে ধুয়ে রাখা ডাল দিয়ে কয়েক মিনিট কষিয়ে নিন। এরপর ১ কাপ পানি যোগ করে ডাল সিদ্ধ হওয়া পর্যন্ত অপেক্ষা করুন।",
        "timestamp": "1:04"
      },
      {
        "id": 141,
        "recipe_id": 19,
        "step_number": 4,
        "instruction_en": "Add chopped spinach and green chillies to the cooked lentils. Cover and cook until the spinach is wilted and fully cooked. The spinach will release water, so no extra water is needed unless you want a thinner consistency.",
        "instruction_bn": "সিদ্ধ ডালের মধ্যে কুচানো পালং শাক ও কাঁচা মরিচ দিয়ে দিন। প্যানটি ঢেকে শাক পুরোপুরি সিদ্ধ হওয়া পর্যন্ত রান্না করুন। শাক থেকে পানি বের হবে, তাই আলাদা পানির প্রয়োজন নেই।",
        "timestamp": "1:34"
      },
      {
        "id": 142,
        "recipe_id": 19,
        "step_number": 5,
        "instruction_en": "In a separate small pan, heat 1 tablespoon of oil. Fry dry red chillies, more sliced onion, and garlic until they turn dark golden brown and crispy (Tarka/Bagar).",
        "instruction_bn": "আলাদা একটি ছোট প্যানে ১ টেবিল চামচ তেল গরম করে তাতে শুকনা মরিচ, পেঁয়াজ ও রসুন কুচি দিয়ে গাঢ় বাদামী ও মুচমুচে করে ভেজে নিন (বাগাড়)।",
        "timestamp": "2:31"
      },
      {
        "id": 143,
        "recipe_id": 19,
        "step_number": 6,
        "instruction_en": "Pour the tempering (Tarka) over the spinach-dal mixture and mix gently. This adds an incredible aroma and flavor. Serve hot.",
        "instruction_bn": "তৈরি করা বাগাড়টি পালং শাক ও ডালের মিশ্রণে ঢেলে দিন এবং হালকাভাবে মিশিয়ে নিন। এতে দারুণ সুগন্ধ ও স্বাদ যোগ হবে। গরম গরম পরিবেশন করুন।",
        "timestamp": "3:10"
      }
    ]
  }
]